AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/* Based on CPU DB MCF51AG128_80, version 3.00.011 (RegistersPrg V2.31) */
/*
** ###################################################################
**     Filename  : mcf51ag128.h
**     Processor : MCF51AG128VLK
**     FileFormat: V2.31
**     DataSheet : MCF51AG128RM Rev. 3 5/2009
**     Compiler  : CodeWarrior compiler
**     Date/Time : 13.11.2009, 15:07
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2009 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 13.11.2009, V3.00.0:
**              - Removed empty Bits structures from definitions of EWM and WDOG registers.
**
**     File-Format-Revisions:
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - Changes have not affected this file (because they are related to another family)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MCF51AG128_H
#define _MCF51AG128_H

/* Types definition */
typedef unsigned char byte;
typedef unsigned short word;
typedef unsigned long dword;

/* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(WDOG_REFRESH = 0xA602, WDOG_REFRESH = 0xB480)
#endif
#endif /* __RESET_WATCHDOG */

#pragma options align=packed

/**************** interrupt vector numbers ****************/
#define VectorNumber_INITSP             0
#define VectorNumber_INITPC             1
#define VectorNumber_Vaccerr            2
#define VectorNumber_Vadderr            3
#define VectorNumber_Viinstr            4
#define VectorNumber_VReserved5         5
#define VectorNumber_VReserved6         6
#define VectorNumber_VReserved7         7
#define VectorNumber_Vprviol            8
#define VectorNumber_Vtrace             9
#define VectorNumber_Vunilaop           10
#define VectorNumber_Vunilfop           11
#define VectorNumber_Vdbgi              12
#define VectorNumber_VReserved13        13
#define VectorNumber_Vferror            14
#define VectorNumber_VReserved15        15
#define VectorNumber_VReserved16        16
#define VectorNumber_VReserved17        17
#define VectorNumber_VReserved18        18
#define VectorNumber_VReserved19        19
#define VectorNumber_VReserved20        20
#define VectorNumber_VReserved21        21
#define VectorNumber_VReserved22        22
#define VectorNumber_VReserved23        23
#define VectorNumber_Vspuri             24
#define VectorNumber_VReserved25        25
#define VectorNumber_VReserved26        26
#define VectorNumber_VReserved27        27
#define VectorNumber_VReserved28        28
#define VectorNumber_VReserved29        29
#define VectorNumber_VReserved30        30
#define VectorNumber_VReserved31        31
#define VectorNumber_Vtrap0             32
#define VectorNumber_Vtrap1             33
#define VectorNumber_Vtrap2             34
#define VectorNumber_Vtrap3             35
#define VectorNumber_Vtrap4             36
#define VectorNumber_Vtrap5             37
#define VectorNumber_Vtrap6             38
#define VectorNumber_Vtrap7             39
#define VectorNumber_Vtrap8             40
#define VectorNumber_Vtrap9             41
#define VectorNumber_Vtrap10            42
#define VectorNumber_Vtrap11            43
#define VectorNumber_Vtrap12            44
#define VectorNumber_Vtrap13            45
#define VectorNumber_Vtrap14            46
#define VectorNumber_Vtrap15            47
#define VectorNumber_VReserved48        48
#define VectorNumber_VReserved49        49
#define VectorNumber_VReserved50        50
#define VectorNumber_VReserved51        51
#define VectorNumber_VReserved52        52
#define VectorNumber_VReserved53        53
#define VectorNumber_VReserved54        54
#define VectorNumber_VReserved55        55
#define VectorNumber_VReserved56        56
#define VectorNumber_VReserved57        57
#define VectorNumber_VReserved58        58
#define VectorNumber_VReserved59        59
#define VectorNumber_VReserved60        60
#define VectorNumber_Vunsinstr          61
#define VectorNumber_VReserved62        62
#define VectorNumber_VReserved63        63
#define VectorNumber_Virq               64
#define VectorNumber_Vlvd               65
#define VectorNumber_VReserved66        66
#define VectorNumber_VReserved67        67
#define VectorNumber_Vdmach0            68
#define VectorNumber_Vdmach1            69
#define VectorNumber_Vdmach2            70
#define VectorNumber_Vdmach3            71
#define VectorNumber_Vieventch0         72
#define VectorNumber_Vftm1fault_ovf     73
#define VectorNumber_Vftm1ch0           74
#define VectorNumber_Vftm1ch1           75
#define VectorNumber_Vftm1ch2           76
#define VectorNumber_Vftm1ch3           77
#define VectorNumber_Vftm1ch4           78
#define VectorNumber_Vftm1ch5           79
#define VectorNumber_Vftm2fault_ovf     80
#define VectorNumber_Vftm2ch0           81
#define VectorNumber_Vftm2ch1           82
#define VectorNumber_Vftm2ch2           83
#define VectorNumber_Vftm2ch3           84
#define VectorNumber_Vftm2ch4           85
#define VectorNumber_Vftm2ch5           86
#define VectorNumber_Vtpm3ovf           87
#define VectorNumber_Vtpm3ch0           88
#define VectorNumber_Vtpm3ch1           89
#define VectorNumber_Vadc               90
#define VectorNumber_Vhscmp1            91
#define VectorNumber_Vhscmp2            92
#define VectorNumber_Vieventch1         93
#define VectorNumber_Vspi1              94
#define VectorNumber_Vspi2              95
#define VectorNumber_Vsci1err           96
#define VectorNumber_Vsci1rx            97
#define VectorNumber_Vsci1tx            98
#define VectorNumber_Viic               99
#define VectorNumber_Vieventch2         100
#define VectorNumber_Vsci2err           101
#define VectorNumber_Vsci2rx            102
#define VectorNumber_VL7swi             103
#define VectorNumber_VL6swi             104
#define VectorNumber_VL5swi             105
#define VectorNumber_VL4swi             106
#define VectorNumber_VL3swi             107
#define VectorNumber_VL2swi             108
#define VectorNumber_VL1swi             109
#define VectorNumber_Vsci2tx            110
#define VectorNumber_Vportae            111
#define VectorNumber_Vportfj            112
#define VectorNumber_Vrtc_wdg           113
#define VectorNumber_Vieventch3         114

