AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/**************** interrupt vector table ****************/
#define INITSP                          0x00000000
#define INITPC                          0x00000004
#define Vaccerr                         0x00000008
#define Vadderr                         0x0000000C
#define Viinstr                         0x00000010
#define VReserved5                      0x00000014
#define VReserved6                      0x00000018
#define VReserved7                      0x0000001C
#define Vprviol                         0x00000020
#define Vtrace                          0x00000024
#define Vunilaop                        0x00000028
#define Vunilfop                        0x0000002C
#define Vdbgi                           0x00000030
#define VReserved13                     0x00000034
#define Vferror                         0x00000038
#define VReserved15                     0x0000003C
#define VReserved16                     0x00000040
#define VReserved17                     0x00000044
#define VReserved18                     0x00000048
#define VReserved19                     0x0000004C
#define VReserved20                     0x00000050
#define VReserved21                     0x00000054
#define VReserved22                     0x00000058
#define VReserved23                     0x0000005C
#define Vspuri                          0x00000060
#define VReserved25                     0x00000064
#define VReserved26                     0x00000068
#define VReserved27                     0x0000006C
#define VReserved28                     0x00000070
#define VReserved29                     0x00000074
#define VReserved30                     0x00000078
#define VReserved31                     0x0000007C
#define Vtrap0                          0x00000080
#define Vtrap1                          0x00000084
#define Vtrap2                          0x00000088
#define Vtrap3                          0x0000008C
#define Vtrap4                          0x00000090
#define Vtrap5                          0x00000094
#define Vtrap6                          0x00000098
#define Vtrap7                          0x0000009C
#define Vtrap8                          0x000000A0
#define Vtrap9                          0x000000A4
#define Vtrap10                         0x000000A8
#define Vtrap11                         0x000000AC
#define Vtrap12                         0x000000B0
#define Vtrap13                         0x000000B4
#define Vtrap14                         0x000000B8
#define Vtrap15                         0x000000BC
#define VReserved48                     0x000000C0
#define VReserved49                     0x000000C4
#define VReserved50                     0x000000C8
#define VReserved51                     0x000000CC
#define VReserved52                     0x000000D0
#define VReserved53                     0x000000D4
#define VReserved54                     0x000000D8
#define VReserved55                     0x000000DC
#define VReserved56                     0x000000E0
#define VReserved57                     0x000000E4
#define VReserved58                     0x000000E8
#define VReserved59                     0x000000EC
#define VReserved60                     0x000000F0
#define Vunsinstr                       0x000000F4
#define VReserved62                     0x000000F8
#define VReserved63                     0x000000FC
#define Virq                            0x00000100
#define Vlvd                            0x00000104
#define VReserved66                     0x00000108
#define VReserved67                     0x0000010C
#define Vdmach0                         0x00000110
#define Vdmach1                         0x00000114
#define Vdmach2                         0x00000118
#define Vdmach3                         0x0000011C
#define Vieventch0                      0x00000120
#define Vftm1fault_ovf                  0x00000124
#define Vftm1ch0                        0x00000128
#define Vftm1ch1                        0x0000012C
#define Vftm1ch2                        0x00000130
#define Vftm1ch3                        0x00000134
#define Vftm1ch4                        0x00000138
#define Vftm1ch5                        0x0000013C
#define Vftm2fault_ovf                  0x00000140
#define Vftm2ch0                        0x00000144
#define Vftm2ch1                        0x00000148
#define Vftm2ch2                        0x0000014C
#define Vftm2ch3                        0x00000150
#define Vftm2ch4                        0x00000154
#define Vftm2ch5                        0x00000158
#define Vtpm3ovf                        0x0000015C
#define Vtpm3ch0                        0x00000160
#define Vtpm3ch1                        0x00000164
#define Vadc                            0x00000168
#define Vhscmp1                         0x0000016C
#define Vhscmp2                         0x00000170
#define Vieventch1                      0x00000174
#define Vspi1                           0x00000178
#define Vspi2                           0x0000017C
#define Vsci1err                        0x00000180
#define Vsci1rx                         0x00000184
#define Vsci1tx                         0x00000188
#define Viic                            0x0000018C
#define Vieventch2                      0x00000190
#define Vsci2err                        0x00000194
#define Vsci2rx                         0x00000198
#define VL7swi                          0x0000019C
#define VL6swi                          0x000001A0
#define VL5swi                          0x000001A4
#define VL4swi                          0x000001A8
#define VL3swi                          0x000001AC
#define VL2swi                          0x000001B0
#define VL1swi                          0x000001B4
#define Vsci2tx                         0x000001B8
#define Vportae                         0x000001BC
#define Vportfj                         0x000001C0
#define Vrtc_wdg                        0x000001C4
#define Vieventch3                      0x000001C8

/**************** registers I/O map ****************/

/*** NVFTRIM - Nonvolatile ICS Fine Trim; 0x000003FE ***/
typedef union {
  byte Byte;
  struct {
    byte FTRIM       :1;                                       /* ICS Fine Trim */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} NVFTRIMSTR;
/* Tip for register initialization in the user code:  const byte NVFTRIM_INIT @0x000003FE = <NVFTRIM_INITVAL>; */
#define _NVFTRIM (*(const NVFTRIMSTR *)0x000003FE)
#define NVFTRIM                         _NVFTRIM.Byte
#define NVFTRIM_FTRIM                   _NVFTRIM.Bits.FTRIM

