AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTADDSTR _PTADD @0xFFFF8001;
#define PTADD                           _PTADD.Byte
#define PTADD_PTADD0                    _PTADD.Bits.PTADD0
#define PTADD_PTADD1                    _PTADD.Bits.PTADD1
#define PTADD_PTADD2                    _PTADD.Bits.PTADD2
#define PTADD_PTADD3                    _PTADD.Bits.PTADD3
#define PTADD_PTADD4                    _PTADD.Bits.PTADD4
#define PTADD_PTADD5                    _PTADD.Bits.PTADD5
#define PTADD_PTADD6                    _PTADD.Bits.PTADD6
#define PTADD_PTADD7                    _PTADD.Bits.PTADD7

#define PTADD_PTADD0_MASK               1
#define PTADD_PTADD1_MASK               2
#define PTADD_PTADD2_MASK               4
#define PTADD_PTADD3_MASK               8
#define PTADD_PTADD4_MASK               16
#define PTADD_PTADD5_MASK               32
#define PTADD_PTADD6_MASK               64
#define PTADD_PTADD7_MASK               128


/*** PTAPV - Port A Pin Value Register; 0xFFFF8002 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTAPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTAPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTAPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTAPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTAPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTAPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTAPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTAPVSTR;
extern volatile PTAPVSTR _PTAPV @0xFFFF8002;
#define PTAPV                           _PTAPV.Byte
#define PTAPV_PTAPV0                    _PTAPV.Bits.PTAPV0
#define PTAPV_PTAPV1                    _PTAPV.Bits.PTAPV1
#define PTAPV_PTAPV2                    _PTAPV.Bits.PTAPV2
#define PTAPV_PTAPV3                    _PTAPV.Bits.PTAPV3
#define PTAPV_PTAPV4                    _PTAPV.Bits.PTAPV4
#define PTAPV_PTAPV5                    _PTAPV.Bits.PTAPV5
#define PTAPV_PTAPV6                    _PTAPV.Bits.PTAPV6
#define PTAPV_PTAPV7                    _PTAPV.Bits.PTAPV7

#define PTAPV_PTAPV0_MASK               1
#define PTAPV_PTAPV1_MASK               2
#define PTAPV_PTAPV2_MASK               4
#define PTAPV_PTAPV3_MASK               8
#define PTAPV_PTAPV4_MASK               16
#define PTAPV_PTAPV5_MASK               32
#define PTAPV_PTAPV6_MASK               64
#define PTAPV_PTAPV7_MASK               128


/*** PTBD - Port B Data Register; 0xFFFF8004 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBD0       :1;                                       /* Port B Data Register Bit 0 */
    byte PTBD1       :1;                                       /* Port B Data Register Bit 1 */
    byte PTBD2       :1;                                       /* Port B Data Register Bit 2 */
    byte PTBD3       :1;                                       /* Port B Data Register Bit 3 */
    byte PTBD4       :1;                                       /* Port B Data Register Bit 4 */
    byte PTBD5       :1;                                       /* Port B Data Register Bit 5 */
    byte PTBD6       :1;                                       /* Port B Data Register Bit 6 */
    byte PTBD7       :1;                                       /* Port B Data Register Bit 7 */
  } Bits;
} PTBDSTR;
extern volatile PTBDSTR _PTBD @0xFFFF8004;
#define PTBD                            _PTBD.Byte
#define PTBD_PTBD0                      _PTBD.Bits.PTBD0
#define PTBD_PTBD1                      _PTBD.Bits.PTBD1
#define PTBD_PTBD2                      _PTBD.Bits.PTBD2
#define PTBD_PTBD3                      _PTBD.Bits.PTBD3
#define PTBD_PTBD4                      _PTBD.Bits.PTBD4
#define PTBD_PTBD5                      _PTBD.Bits.PTBD5
#define PTBD_PTBD6                      _PTBD.Bits.PTBD6
#define PTBD_PTBD7                      _PTBD.Bits.PTBD7

#define PTBD_PTBD0_MASK                 1
#define PTBD_PTBD1_MASK                 2
#define PTBD_PTBD2_MASK                 4
#define PTBD_PTBD3_MASK                 8
#define PTBD_PTBD4_MASK                 16
#define PTBD_PTBD5_MASK                 32
#define PTBD_PTBD6_MASK                 64
#define PTBD_PTBD7_MASK                 128


/*** PTBDD - Port B Data Direction Register; 0xFFFF8005 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBDD0      :1;                                       /* Data Direction for Port B Bit 0 */
    byte PTBDD1      :1;                                       /* Data Direction for Port B Bit 1 */
    byte PTBDD2      :1;                                       /* Data Direction for Port B Bit 2 */
    byte PTBDD3      :1;                                       /* Data Direction for Port B Bit 3 */
    byte PTBDD4      :1;                                       /* Data Direction for Port B Bit 4 */
    byte PTBDD5      :1;                                       /* Data Direction for Port B Bit 5 */
    byte PTBDD6      :1;                                       /* Data Direction for Port B Bit 6 */
    byte PTBDD7      :1;                                       /* Data Direction for Port B Bit 7 */
  } Bits;
} PTBDDSTR;
extern volatile PTBDDSTR _PTBDD @0xFFFF8005;
#define PTBDD                           _PTBDD.Byte
#define PTBDD_PTBDD0                    _PTBDD.Bits.PTBDD0
#define PTBDD_PTBDD1                    _PTBDD.Bits.PTBDD1
#define PTBDD_PTBDD2                    _PTBDD.Bits.PTBDD2
#define PTBDD_PTBDD3                    _PTBDD.Bits.PTBDD3
#define PTBDD_PTBDD4                    _PTBDD.Bits.PTBDD4
#define PTBDD_PTBDD5                    _PTBDD.Bits.PTBDD5
#define PTBDD_PTBDD6                    _PTBDD.Bits.PTBDD6
#define PTBDD_PTBDD7                    _PTBDD.Bits.PTBDD7

#define PTBDD_PTBDD0_MASK               1
#define PTBDD_PTBDD1_MASK               2
#define PTBDD_PTBDD2_MASK               4
#define PTBDD_PTBDD3_MASK               8
#define PTBDD_PTBDD4_MASK               16
#define PTBDD_PTBDD5_MASK               32
#define PTBDD_PTBDD6_MASK               64
#define PTBDD_PTBDD7_MASK               128


/*** PTBPV - Port B Pin Value Register; 0xFFFF8006 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTBPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTBPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTBPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTBPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTBPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTBPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTBPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTBPVSTR;
extern volatile PTBPVSTR _PTBPV @0xFFFF8006;
#define PTBPV                           _PTBPV.Byte
#define PTBPV_PTBPV0                    _PTBPV.Bits.PTBPV0
#define PTBPV_PTBPV1                    _PTBPV.Bits.PTBPV1
#define PTBPV_PTBPV2                    _PTBPV.Bits.PTBPV2
#define PTBPV_PTBPV3                    _PTBPV.Bits.PTBPV3
#define PTBPV_PTBPV4                    _PTBPV.Bits.PTBPV4
#define PTBPV_PTBPV5                    _PTBPV.Bits.PTBPV5
#define PTBPV_PTBPV6                    _PTBPV.Bits.PTBPV6
#define PTBPV_PTBPV7                    _PTBPV.Bits.PTBPV7

#define PTBPV_PTBPV0_MASK               1
#define PTBPV_PTBPV1_MASK               2
#define PTBPV_PTBPV2_MASK               4
#define PTBPV_PTBPV3_MASK               8
#define PTBPV_PTBPV4_MASK               16
#define PTBPV_PTBPV5_MASK               32
#define PTBPV_PTBPV6_MASK               64
#define PTBPV_PTBPV7_MASK               128


/*** PTCD - Port C Data Register; 0xFFFF8008 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCD0       :1;                                       /* Port C Data Register Bit 0 */
    byte PTCD1       :1;                                       /* Port C Data Register Bit 1 */
    byte PTCD2       :1;                                       /* Port C Data Register Bit 2 */
    byte PTCD3       :1;                                       /* Port C Data Register Bit 3 */
    byte PTCD4       :1;                                       /* Port C Data Register Bit 4 */
    byte PTCD5       :1;                                       /* Port C Data Register Bit 5 */
    byte PTCD6       :1;                                       /* Port C Data Register Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCD :7;
    byte         :1;
  } MergedBits;
} PTCDSTR;
extern volatile PTCDSTR _PTCD @0xFFFF8008;
#define PTCD                            _PTCD.Byte
#define PTCD_PTCD0                      _PTCD.Bits.PTCD0
#define PTCD_PTCD1                      _PTCD.Bits.PTCD1
#define PTCD_PTCD2                      _PTCD.Bits.PTCD2
#define PTCD_PTCD3                      _PTCD.Bits.PTCD3
#define PTCD_PTCD4                      _PTCD.Bits.PTCD4
#define PTCD_PTCD5                      _PTCD.Bits.PTCD5
#define PTCD_PTCD6                      _PTCD.Bits.PTCD6
#define PTCD_PTCD                       _PTCD.MergedBits.grpPTCD

