AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTDDDSTR _PTDDD @0xFFFF800D;
#define PTDDD                           _PTDDD.Byte
#define PTDDD_PTDDD0                    _PTDDD.Bits.PTDDD0
#define PTDDD_PTDDD1                    _PTDDD.Bits.PTDDD1
#define PTDDD_PTDDD2                    _PTDDD.Bits.PTDDD2
#define PTDDD_PTDDD3                    _PTDDD.Bits.PTDDD3
#define PTDDD_PTDDD4                    _PTDDD.Bits.PTDDD4
#define PTDDD_PTDDD5                    _PTDDD.Bits.PTDDD5
#define PTDDD_PTDDD6                    _PTDDD.Bits.PTDDD6
#define PTDDD_PTDDD7                    _PTDDD.Bits.PTDDD7

#define PTDDD_PTDDD0_MASK               1
#define PTDDD_PTDDD1_MASK               2
#define PTDDD_PTDDD2_MASK               4
#define PTDDD_PTDDD3_MASK               8
#define PTDDD_PTDDD4_MASK               16
#define PTDDD_PTDDD5_MASK               32
#define PTDDD_PTDDD6_MASK               64
#define PTDDD_PTDDD7_MASK               128


/*** PTDPV - Port D Pin Value Register; 0xFFFF800E ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTDPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTDPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTDPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTDPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTDPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTDPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTDPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTDPVSTR;
extern volatile PTDPVSTR _PTDPV @0xFFFF800E;
#define PTDPV                           _PTDPV.Byte
#define PTDPV_PTDPV0                    _PTDPV.Bits.PTDPV0
#define PTDPV_PTDPV1                    _PTDPV.Bits.PTDPV1
#define PTDPV_PTDPV2                    _PTDPV.Bits.PTDPV2
#define PTDPV_PTDPV3                    _PTDPV.Bits.PTDPV3
#define PTDPV_PTDPV4                    _PTDPV.Bits.PTDPV4
#define PTDPV_PTDPV5                    _PTDPV.Bits.PTDPV5
#define PTDPV_PTDPV6                    _PTDPV.Bits.PTDPV6
#define PTDPV_PTDPV7                    _PTDPV.Bits.PTDPV7

#define PTDPV_PTDPV0_MASK               1
#define PTDPV_PTDPV1_MASK               2
#define PTDPV_PTDPV2_MASK               4
#define PTDPV_PTDPV3_MASK               8
#define PTDPV_PTDPV4_MASK               16
#define PTDPV_PTDPV5_MASK               32
#define PTDPV_PTDPV6_MASK               64
#define PTDPV_PTDPV7_MASK               128


/*** PTED - Port E Data Register; 0xFFFF8010 ***/
typedef union {
  byte Byte;
  struct {
    byte PTED0       :1;                                       /* Port E Data Register Bit 0 */
    byte PTED1       :1;                                       /* Port E Data Register Bit 1 */
    byte PTED2       :1;                                       /* Port E Data Register Bit 2 */
    byte PTED3       :1;                                       /* Port E Data Register Bit 3 */
    byte PTED4       :1;                                       /* Port E Data Register Bit 4 */
    byte PTED5       :1;                                       /* Port E Data Register Bit 5 */
    byte PTED6       :1;                                       /* Port E Data Register Bit 6 */
    byte PTED7       :1;                                       /* Port E Data Register Bit 7 */
  } Bits;
} PTEDSTR;
extern volatile PTEDSTR _PTED @0xFFFF8010;
#define PTED                            _PTED.Byte
#define PTED_PTED0                      _PTED.Bits.PTED0
#define PTED_PTED1                      _PTED.Bits.PTED1
#define PTED_PTED2                      _PTED.Bits.PTED2
#define PTED_PTED3                      _PTED.Bits.PTED3
#define PTED_PTED4                      _PTED.Bits.PTED4
#define PTED_PTED5                      _PTED.Bits.PTED5
#define PTED_PTED6                      _PTED.Bits.PTED6
#define PTED_PTED7                      _PTED.Bits.PTED7

#define PTED_PTED0_MASK                 1
#define PTED_PTED1_MASK                 2
#define PTED_PTED2_MASK                 4
#define PTED_PTED3_MASK                 8
#define PTED_PTED4_MASK                 16
#define PTED_PTED5_MASK                 32
#define PTED_PTED6_MASK                 64
#define PTED_PTED7_MASK                 128


/*** PTEDD - Port E Data Direction Register; 0xFFFF8011 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEDD0      :1;                                       /* Data Direction for Port E Bit 0 */
    byte PTEDD1      :1;                                       /* Data Direction for Port E Bit 1 */
    byte PTEDD2      :1;                                       /* Data Direction for Port E Bit 2 */
    byte PTEDD3      :1;                                       /* Data Direction for Port E Bit 3 */
    byte PTEDD4      :1;                                       /* Data Direction for Port E Bit 4 */
    byte PTEDD5      :1;                                       /* Data Direction for Port E Bit 5 */
    byte PTEDD6      :1;                                       /* Data Direction for Port E Bit 6 */
    byte PTEDD7      :1;                                       /* Data Direction for Port E Bit 7 */
  } Bits;
} PTEDDSTR;
extern volatile PTEDDSTR _PTEDD @0xFFFF8011;
#define PTEDD                           _PTEDD.Byte
#define PTEDD_PTEDD0                    _PTEDD.Bits.PTEDD0
#define PTEDD_PTEDD1                    _PTEDD.Bits.PTEDD1
#define PTEDD_PTEDD2                    _PTEDD.Bits.PTEDD2
#define PTEDD_PTEDD3                    _PTEDD.Bits.PTEDD3
#define PTEDD_PTEDD4                    _PTEDD.Bits.PTEDD4
#define PTEDD_PTEDD5                    _PTEDD.Bits.PTEDD5
#define PTEDD_PTEDD6                    _PTEDD.Bits.PTEDD6
#define PTEDD_PTEDD7                    _PTEDD.Bits.PTEDD7

#define PTEDD_PTEDD0_MASK               1
#define PTEDD_PTEDD1_MASK               2
#define PTEDD_PTEDD2_MASK               4
#define PTEDD_PTEDD3_MASK               8
#define PTEDD_PTEDD4_MASK               16
#define PTEDD_PTEDD5_MASK               32
#define PTEDD_PTEDD6_MASK               64
#define PTEDD_PTEDD7_MASK               128


/*** PTEPV - Port E Pin Value Register; 0xFFFF8012 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTEPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTEPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTEPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTEPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTEPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTEPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTEPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTEPVSTR;
extern volatile PTEPVSTR _PTEPV @0xFFFF8012;
#define PTEPV                           _PTEPV.Byte
#define PTEPV_PTEPV0                    _PTEPV.Bits.PTEPV0
#define PTEPV_PTEPV1                    _PTEPV.Bits.PTEPV1
#define PTEPV_PTEPV2                    _PTEPV.Bits.PTEPV2
#define PTEPV_PTEPV3                    _PTEPV.Bits.PTEPV3
#define PTEPV_PTEPV4                    _PTEPV.Bits.PTEPV4
#define PTEPV_PTEPV5                    _PTEPV.Bits.PTEPV5
#define PTEPV_PTEPV6                    _PTEPV.Bits.PTEPV6
#define PTEPV_PTEPV7                    _PTEPV.Bits.PTEPV7

