AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTEPV_PTEPV0_MASK               1
#define PTEPV_PTEPV1_MASK               2
#define PTEPV_PTEPV2_MASK               4
#define PTEPV_PTEPV3_MASK               8
#define PTEPV_PTEPV4_MASK               16
#define PTEPV_PTEPV5_MASK               32
#define PTEPV_PTEPV6_MASK               64
#define PTEPV_PTEPV7_MASK               128


/*** PTFD - Port F Data Register; 0xFFFF8014 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFD0       :1;                                       /* Port F Data Register Bit 0 */
    byte PTFD1       :1;                                       /* Port F Data Register Bit 1 */
    byte PTFD2       :1;                                       /* Port F Data Register Bit 2 */
    byte PTFD3       :1;                                       /* Port F Data Register Bit 3 */
    byte PTFD4       :1;                                       /* Port F Data Register Bit 4 */
    byte PTFD5       :1;                                       /* Port F Data Register Bit 5 */
    byte PTFD6       :1;                                       /* Port F Data Register Bit 6 */
    byte PTFD7       :1;                                       /* Port F Data Register Bit 7 */
  } Bits;
} PTFDSTR;
extern volatile PTFDSTR _PTFD @0xFFFF8014;
#define PTFD                            _PTFD.Byte
#define PTFD_PTFD0                      _PTFD.Bits.PTFD0
#define PTFD_PTFD1                      _PTFD.Bits.PTFD1
#define PTFD_PTFD2                      _PTFD.Bits.PTFD2
#define PTFD_PTFD3                      _PTFD.Bits.PTFD3
#define PTFD_PTFD4                      _PTFD.Bits.PTFD4
#define PTFD_PTFD5                      _PTFD.Bits.PTFD5
#define PTFD_PTFD6                      _PTFD.Bits.PTFD6
#define PTFD_PTFD7                      _PTFD.Bits.PTFD7

#define PTFD_PTFD0_MASK                 1
#define PTFD_PTFD1_MASK                 2
#define PTFD_PTFD2_MASK                 4
#define PTFD_PTFD3_MASK                 8
#define PTFD_PTFD4_MASK                 16
#define PTFD_PTFD5_MASK                 32
#define PTFD_PTFD6_MASK                 64
#define PTFD_PTFD7_MASK                 128


/*** PTFDD - Port F Data Direction Register; 0xFFFF8015 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFDD0      :1;                                       /* Data Direction for Port F Bit 0 */
    byte PTFDD1      :1;                                       /* Data Direction for Port F Bit 1 */
    byte PTFDD2      :1;                                       /* Data Direction for Port F Bit 2 */
    byte PTFDD3      :1;                                       /* Data Direction for Port F Bit 3 */
    byte PTFDD4      :1;                                       /* Data Direction for Port F Bit 4 */
    byte PTFDD5      :1;                                       /* Data Direction for Port F Bit 5 */
    byte PTFDD6      :1;                                       /* Data Direction for Port F Bit 6 */
    byte PTFDD7      :1;                                       /* Data Direction for Port F Bit 7 */
  } Bits;
} PTFDDSTR;
extern volatile PTFDDSTR _PTFDD @0xFFFF8015;
#define PTFDD                           _PTFDD.Byte
#define PTFDD_PTFDD0                    _PTFDD.Bits.PTFDD0
#define PTFDD_PTFDD1                    _PTFDD.Bits.PTFDD1
#define PTFDD_PTFDD2                    _PTFDD.Bits.PTFDD2
#define PTFDD_PTFDD3                    _PTFDD.Bits.PTFDD3
#define PTFDD_PTFDD4                    _PTFDD.Bits.PTFDD4
#define PTFDD_PTFDD5                    _PTFDD.Bits.PTFDD5
#define PTFDD_PTFDD6                    _PTFDD.Bits.PTFDD6
#define PTFDD_PTFDD7                    _PTFDD.Bits.PTFDD7

#define PTFDD_PTFDD0_MASK               1
#define PTFDD_PTFDD1_MASK               2
#define PTFDD_PTFDD2_MASK               4
#define PTFDD_PTFDD3_MASK               8
#define PTFDD_PTFDD4_MASK               16
#define PTFDD_PTFDD5_MASK               32
#define PTFDD_PTFDD6_MASK               64
#define PTFDD_PTFDD7_MASK               128


/*** PTFPV - Port F Pin Value Register; 0xFFFF8016 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTFPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTFPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTFPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTFPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTFPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTFPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTFPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTFPVSTR;
extern volatile PTFPVSTR _PTFPV @0xFFFF8016;
#define PTFPV                           _PTFPV.Byte
#define PTFPV_PTFPV0                    _PTFPV.Bits.PTFPV0
#define PTFPV_PTFPV1                    _PTFPV.Bits.PTFPV1
#define PTFPV_PTFPV2                    _PTFPV.Bits.PTFPV2
#define PTFPV_PTFPV3                    _PTFPV.Bits.PTFPV3
#define PTFPV_PTFPV4                    _PTFPV.Bits.PTFPV4
#define PTFPV_PTFPV5                    _PTFPV.Bits.PTFPV5
#define PTFPV_PTFPV6                    _PTFPV.Bits.PTFPV6
#define PTFPV_PTFPV7                    _PTFPV.Bits.PTFPV7

#define PTFPV_PTFPV0_MASK               1
#define PTFPV_PTFPV1_MASK               2
#define PTFPV_PTFPV2_MASK               4
#define PTFPV_PTFPV3_MASK               8
#define PTFPV_PTFPV4_MASK               16
#define PTFPV_PTFPV5_MASK               32
#define PTFPV_PTFPV6_MASK               64
#define PTFPV_PTFPV7_MASK               128


/*** PTGD - Port G Data Register; 0xFFFF8018 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGD0       :1;                                       /* Port G Data Register Bit 0 */
    byte PTGD1       :1;                                       /* Port G Data Register Bit 1 */
    byte PTGD2       :1;                                       /* Port G Data Register Bit 2 */
    byte PTGD3       :1;                                       /* Port G Data Register Bit 3 */
    byte PTGD4       :1;                                       /* Port G Data Register Bit 4 */
    byte PTGD5       :1;                                       /* Port G Data Register Bit 5 */
    byte PTGD6       :1;                                       /* Port G Data Register Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGD :7;
    byte         :1;
  } MergedBits;
} PTGDSTR;
extern volatile PTGDSTR _PTGD @0xFFFF8018;
#define PTGD                            _PTGD.Byte
#define PTGD_PTGD0                      _PTGD.Bits.PTGD0
#define PTGD_PTGD1                      _PTGD.Bits.PTGD1
#define PTGD_PTGD2                      _PTGD.Bits.PTGD2
#define PTGD_PTGD3                      _PTGD.Bits.PTGD3
#define PTGD_PTGD4                      _PTGD.Bits.PTGD4
#define PTGD_PTGD5                      _PTGD.Bits.PTGD5
#define PTGD_PTGD6                      _PTGD.Bits.PTGD6
#define PTGD_PTGD                       _PTGD.MergedBits.grpPTGD

#define PTGD_PTGD0_MASK                 1
#define PTGD_PTGD1_MASK                 2
#define PTGD_PTGD2_MASK                 4
#define PTGD_PTGD3_MASK                 8
#define PTGD_PTGD4_MASK                 16
#define PTGD_PTGD5_MASK                 32
#define PTGD_PTGD6_MASK                 64
#define PTGD_PTGD_MASK                  127
#define PTGD_PTGD_BITNUM                0


/*** PTGDD - Port G Data Direction Register; 0xFFFF8019 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGDD0      :1;                                       /* Data Direction for Port G Bit 0 */
    byte PTGDD1      :1;                                       /* Data Direction for Port G Bit 1 */
    byte PTGDD2      :1;                                       /* Data Direction for Port G Bit 2 */
    byte PTGDD3      :1;                                       /* Data Direction for Port G Bit 3 */
    byte PTGDD4      :1;                                       /* Data Direction for Port G Bit 4 */
    byte PTGDD5      :1;                                       /* Data Direction for Port G Bit 5 */
    byte PTGDD6      :1;                                       /* Data Direction for Port G Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGDD :7;
    byte         :1;
  } MergedBits;
} PTGDDSTR;
extern volatile PTGDDSTR _PTGDD @0xFFFF8019;
#define PTGDD                           _PTGDD.Byte
#define PTGDD_PTGDD0                    _PTGDD.Bits.PTGDD0
#define PTGDD_PTGDD1                    _PTGDD.Bits.PTGDD1
#define PTGDD_PTGDD2                    _PTGDD.Bits.PTGDD2
#define PTGDD_PTGDD3                    _PTGDD.Bits.PTGDD3
#define PTGDD_PTGDD4                    _PTGDD.Bits.PTGDD4
#define PTGDD_PTGDD5                    _PTGDD.Bits.PTGDD5
#define PTGDD_PTGDD6                    _PTGDD.Bits.PTGDD6
#define PTGDD_PTGDD                     _PTGDD.MergedBits.grpPTGDD

#define PTGDD_PTGDD0_MASK               1
#define PTGDD_PTGDD1_MASK               2
#define PTGDD_PTGDD2_MASK               4
#define PTGDD_PTGDD3_MASK               8
#define PTGDD_PTGDD4_MASK               16
#define PTGDD_PTGDD5_MASK               32
#define PTGDD_PTGDD6_MASK               64
#define PTGDD_PTGDD_MASK                127
#define PTGDD_PTGDD_BITNUM              0


/*** PTGPV - Port G Pin Value Register; 0xFFFF801A ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTGPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTGPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTGPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTGPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTGPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTGPV6      :1;                                       /* Pin Value Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGPV :7;
    byte         :1;
  } MergedBits;
} PTGPVSTR;
extern volatile PTGPVSTR _PTGPV @0xFFFF801A;
#define PTGPV                           _PTGPV.Byte
#define PTGPV_PTGPV0                    _PTGPV.Bits.PTGPV0
#define PTGPV_PTGPV1                    _PTGPV.Bits.PTGPV1
#define PTGPV_PTGPV2                    _PTGPV.Bits.PTGPV2
#define PTGPV_PTGPV3                    _PTGPV.Bits.PTGPV3
#define PTGPV_PTGPV4                    _PTGPV.Bits.PTGPV4
#define PTGPV_PTGPV5                    _PTGPV.Bits.PTGPV5
#define PTGPV_PTGPV6                    _PTGPV.Bits.PTGPV6
#define PTGPV_PTGPV                     _PTGPV.MergedBits.grpPTGPV

#define PTGPV_PTGPV0_MASK               1
#define PTGPV_PTGPV1_MASK               2
#define PTGPV_PTGPV2_MASK               4
#define PTGPV_PTGPV3_MASK               8
#define PTGPV_PTGPV4_MASK               16
#define PTGPV_PTGPV5_MASK               32
#define PTGPV_PTGPV6_MASK               64
#define PTGPV_PTGPV_MASK                127
#define PTGPV_PTGPV_BITNUM              0


/*** PTHD - Port H Data Register; 0xFFFF801C ***/
typedef union {
  byte Byte;
  struct {
    byte PTHD0       :1;                                       /* Port H Data Register Bit 0 */
    byte PTHD1       :1;                                       /* Port H Data Register Bit 1 */
    byte PTHD2       :1;                                       /* Port H Data Register Bit 2 */
    byte PTHD3       :1;                                       /* Port H Data Register Bit 3 */
    byte PTHD4       :1;                                       /* Port H Data Register Bit 4 */
    byte PTHD5       :1;                                       /* Port H Data Register Bit 5 */
    byte PTHD6       :1;                                       /* Port H Data Register Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHD :7;
    byte         :1;
  } MergedBits;
} PTHDSTR;
extern volatile PTHDSTR _PTHD @0xFFFF801C;
#define PTHD                            _PTHD.Byte
#define PTHD_PTHD0                      _PTHD.Bits.PTHD0
#define PTHD_PTHD1                      _PTHD.Bits.PTHD1
#define PTHD_PTHD2                      _PTHD.Bits.PTHD2
#define PTHD_PTHD3                      _PTHD.Bits.PTHD3
#define PTHD_PTHD4                      _PTHD.Bits.PTHD4
#define PTHD_PTHD5                      _PTHD.Bits.PTHD5
#define PTHD_PTHD6                      _PTHD.Bits.PTHD6
#define PTHD_PTHD                       _PTHD.MergedBits.grpPTHD

#define PTHD_PTHD0_MASK                 1
#define PTHD_PTHD1_MASK                 2
#define PTHD_PTHD2_MASK                 4
#define PTHD_PTHD3_MASK                 8
#define PTHD_PTHD4_MASK                 16
#define PTHD_PTHD5_MASK                 32
#define PTHD_PTHD6_MASK                 64
#define PTHD_PTHD_MASK                  127
#define PTHD_PTHD_BITNUM                0


/*** PTHDD - Port H Data Direction Register; 0xFFFF801D ***/
typedef union {
  byte Byte;
  struct {
    byte PTHDD0      :1;                                       /* Data Direction for Port H Bit 0 */
    byte PTHDD1      :1;                                       /* Data Direction for Port H Bit 1 */
    byte PTHDD2      :1;                                       /* Data Direction for Port H Bit 2 */
    byte PTHDD3      :1;                                       /* Data Direction for Port H Bit 3 */
    byte PTHDD4      :1;                                       /* Data Direction for Port H Bit 4 */
    byte PTHDD5      :1;                                       /* Data Direction for Port H Bit 5 */
    byte PTHDD6      :1;                                       /* Data Direction for Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHDD :7;
    byte         :1;
  } MergedBits;
} PTHDDSTR;
extern volatile PTHDDSTR _PTHDD @0xFFFF801D;
#define PTHDD                           _PTHDD.Byte
#define PTHDD_PTHDD0                    _PTHDD.Bits.PTHDD0
#define PTHDD_PTHDD1                    _PTHDD.Bits.PTHDD1
#define PTHDD_PTHDD2                    _PTHDD.Bits.PTHDD2
#define PTHDD_PTHDD3                    _PTHDD.Bits.PTHDD3
#define PTHDD_PTHDD4                    _PTHDD.Bits.PTHDD4
#define PTHDD_PTHDD5                    _PTHDD.Bits.PTHDD5
#define PTHDD_PTHDD6                    _PTHDD.Bits.PTHDD6
#define PTHDD_PTHDD                     _PTHDD.MergedBits.grpPTHDD

#define PTHDD_PTHDD0_MASK               1
#define PTHDD_PTHDD1_MASK               2
#define PTHDD_PTHDD2_MASK               4
#define PTHDD_PTHDD3_MASK               8
#define PTHDD_PTHDD4_MASK               16
#define PTHDD_PTHDD5_MASK               32
#define PTHDD_PTHDD6_MASK               64
#define PTHDD_PTHDD_MASK                127
#define PTHDD_PTHDD_BITNUM              0


/*** PTHPV - Port H Pin Value Register; 0xFFFF801E ***/
typedef union {
  byte Byte;
  struct {
    byte PTHPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTHPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTHPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTHPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTHPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTHPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTHPV6      :1;                                       /* Pin Value Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHPV :7;
    byte         :1;
  } MergedBits;
} PTHPVSTR;
extern volatile PTHPVSTR _PTHPV @0xFFFF801E;
#define PTHPV                           _PTHPV.Byte
#define PTHPV_PTHPV0                    _PTHPV.Bits.PTHPV0
#define PTHPV_PTHPV1                    _PTHPV.Bits.PTHPV1
#define PTHPV_PTHPV2                    _PTHPV.Bits.PTHPV2
#define PTHPV_PTHPV3                    _PTHPV.Bits.PTHPV3
#define PTHPV_PTHPV4                    _PTHPV.Bits.PTHPV4
#define PTHPV_PTHPV5                    _PTHPV.Bits.PTHPV5
#define PTHPV_PTHPV6                    _PTHPV.Bits.PTHPV6
#define PTHPV_PTHPV                     _PTHPV.MergedBits.grpPTHPV

#define PTHPV_PTHPV0_MASK               1
#define PTHPV_PTHPV1_MASK               2
#define PTHPV_PTHPV2_MASK               4
#define PTHPV_PTHPV3_MASK               8
#define PTHPV_PTHPV4_MASK               16
#define PTHPV_PTHPV5_MASK               32
#define PTHPV_PTHPV6_MASK               64
#define PTHPV_PTHPV_MASK                127
#define PTHPV_PTHPV_BITNUM              0


/*** PTJD - Port J Data Register; 0xFFFF8020 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJD0       :1;                                       /* Port J Data Register Bit 0 */
    byte PTJD1       :1;                                       /* Port J Data Register Bit 1 */
    byte PTJD2       :1;                                       /* Port J Data Register Bit 2 */
    byte PTJD3       :1;                                       /* Port J Data Register Bit 3 */
    byte PTJD4       :1;                                       /* Port J Data Register Bit 4 */
    byte PTJD5       :1;                                       /* Port J Data Register Bit 5 */
    byte PTJD6       :1;                                       /* Port J Data Register Bit 6 */
    byte PTJD7       :1;                                       /* Port J Data Register Bit 7 */
  } Bits;
} PTJDSTR;
extern volatile PTJDSTR _PTJD @0xFFFF8020;
#define PTJD                            _PTJD.Byte
#define PTJD_PTJD0                      _PTJD.Bits.PTJD0
#define PTJD_PTJD1                      _PTJD.Bits.PTJD1
#define PTJD_PTJD2                      _PTJD.Bits.PTJD2
#define PTJD_PTJD3                      _PTJD.Bits.PTJD3
#define PTJD_PTJD4                      _PTJD.Bits.PTJD4
#define PTJD_PTJD5                      _PTJD.Bits.PTJD5
#define PTJD_PTJD6                      _PTJD.Bits.PTJD6
#define PTJD_PTJD7                      _PTJD.Bits.PTJD7

#define PTJD_PTJD0_MASK                 1
#define PTJD_PTJD1_MASK                 2
#define PTJD_PTJD2_MASK                 4
#define PTJD_PTJD3_MASK                 8
#define PTJD_PTJD4_MASK                 16
#define PTJD_PTJD5_MASK                 32
#define PTJD_PTJD6_MASK                 64
#define PTJD_PTJD7_MASK                 128


/*** PTJDD - Port J Data Direction Register; 0xFFFF8021 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJDD0      :1;                                       /* Data Direction for Port J Bit 0 */
    byte PTJDD1      :1;                                       /* Data Direction for Port J Bit 1 */
    byte PTJDD2      :1;                                       /* Data Direction for Port J Bit 2 */
    byte PTJDD3      :1;                                       /* Data Direction for Port J Bit 3 */
    byte PTJDD4      :1;                                       /* Data Direction for Port J Bit 4 */
    byte PTJDD5      :1;                                       /* Data Direction for Port J Bit 5 */
    byte PTJDD6      :1;                                       /* Data Direction for Port J Bit 6 */
    byte PTJDD7      :1;                                       /* Data Direction for Port J Bit 7 */
  } Bits;
} PTJDDSTR;
extern volatile PTJDDSTR _PTJDD @0xFFFF8021;
#define PTJDD                           _PTJDD.Byte
#define PTJDD_PTJDD0                    _PTJDD.Bits.PTJDD0
#define PTJDD_PTJDD1                    _PTJDD.Bits.PTJDD1
#define PTJDD_PTJDD2                    _PTJDD.Bits.PTJDD2
#define PTJDD_PTJDD3                    _PTJDD.Bits.PTJDD3
#define PTJDD_PTJDD4                    _PTJDD.Bits.PTJDD4
#define PTJDD_PTJDD5                    _PTJDD.Bits.PTJDD5
#define PTJDD_PTJDD6                    _PTJDD.Bits.PTJDD6
#define PTJDD_PTJDD7                    _PTJDD.Bits.PTJDD7

