AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTJDD_PTJDD0_MASK               1
#define PTJDD_PTJDD1_MASK               2
#define PTJDD_PTJDD2_MASK               4
#define PTJDD_PTJDD3_MASK               8
#define PTJDD_PTJDD4_MASK               16
#define PTJDD_PTJDD5_MASK               32
#define PTJDD_PTJDD6_MASK               64
#define PTJDD_PTJDD7_MASK               128


/*** PTJPV - Port J Pin Value Register; 0xFFFF8022 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJPV0      :1;                                       /* Pin Value Bit 0 */
    byte PTJPV1      :1;                                       /* Pin Value Bit 1 */
    byte PTJPV2      :1;                                       /* Pin Value Bit 2 */
    byte PTJPV3      :1;                                       /* Pin Value Bit 3 */
    byte PTJPV4      :1;                                       /* Pin Value Bit 4 */
    byte PTJPV5      :1;                                       /* Pin Value Bit 5 */
    byte PTJPV6      :1;                                       /* Pin Value Bit 6 */
    byte PTJPV7      :1;                                       /* Pin Value Bit 7 */
  } Bits;
} PTJPVSTR;
extern volatile PTJPVSTR _PTJPV @0xFFFF8022;
#define PTJPV                           _PTJPV.Byte
#define PTJPV_PTJPV0                    _PTJPV.Bits.PTJPV0
#define PTJPV_PTJPV1                    _PTJPV.Bits.PTJPV1
#define PTJPV_PTJPV2                    _PTJPV.Bits.PTJPV2
#define PTJPV_PTJPV3                    _PTJPV.Bits.PTJPV3
#define PTJPV_PTJPV4                    _PTJPV.Bits.PTJPV4
#define PTJPV_PTJPV5                    _PTJPV.Bits.PTJPV5
#define PTJPV_PTJPV6                    _PTJPV.Bits.PTJPV6
#define PTJPV_PTJPV7                    _PTJPV.Bits.PTJPV7

#define PTJPV_PTJPV0_MASK               1
#define PTJPV_PTJPV1_MASK               2
#define PTJPV_PTJPV2_MASK               4
#define PTJPV_PTJPV3_MASK               8
#define PTJPV_PTJPV4_MASK               16
#define PTJPV_PTJPV5_MASK               32
#define PTJPV_PTJPV6_MASK               64
#define PTJPV_PTJPV7_MASK               128


/*** ICSC1 - ICS Control Register 1; 0xFFFF8024 ***/
typedef union {
  byte Byte;
  struct {
    byte IREFSTEN    :1;                                       /* Internal Reference Stop Enable */
    byte IRCLKEN     :1;                                       /* Internal Reference Clock Enable */
    byte IREFS       :1;                                       /* Internal Reference Select */
    byte RDIV0       :1;                                       /* Reference Divider, bit 0 */
    byte RDIV1       :1;                                       /* Reference Divider, bit 1 */
    byte RDIV2       :1;                                       /* Reference Divider, bit 2 */
    byte CLKS0       :1;                                       /* Clock Source Select, bit 0 */
    byte CLKS1       :1;                                       /* Clock Source Select, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpRDIV :3;
    byte grpCLKS :2;
  } MergedBits;
} ICSC1STR;
extern volatile ICSC1STR _ICSC1 @0xFFFF8024;
#define ICSC1                           _ICSC1.Byte
#define ICSC1_IREFSTEN                  _ICSC1.Bits.IREFSTEN
#define ICSC1_IRCLKEN                   _ICSC1.Bits.IRCLKEN
#define ICSC1_IREFS                     _ICSC1.Bits.IREFS
#define ICSC1_RDIV0                     _ICSC1.Bits.RDIV0
#define ICSC1_RDIV1                     _ICSC1.Bits.RDIV1
#define ICSC1_RDIV2                     _ICSC1.Bits.RDIV2
#define ICSC1_CLKS0                     _ICSC1.Bits.CLKS0
#define ICSC1_CLKS1                     _ICSC1.Bits.CLKS1
#define ICSC1_RDIV                      _ICSC1.MergedBits.grpRDIV
#define ICSC1_CLKS                      _ICSC1.MergedBits.grpCLKS

#define ICSC1_IREFSTEN_MASK             1
#define ICSC1_IRCLKEN_MASK              2
#define ICSC1_IREFS_MASK                4
#define ICSC1_RDIV0_MASK                8
#define ICSC1_RDIV1_MASK                16
#define ICSC1_RDIV2_MASK                32
#define ICSC1_CLKS0_MASK                64
#define ICSC1_CLKS1_MASK                128
#define ICSC1_RDIV_MASK                 56
#define ICSC1_RDIV_BITNUM               3
#define ICSC1_CLKS_MASK                 192
#define ICSC1_CLKS_BITNUM               6


/*** ICSC2 - ICS Control Register 2; 0xFFFF8025 ***/
typedef union {
  byte Byte;
  struct {
    byte EREFSTEN    :1;                                       /* External Reference Stop Enable */
    byte ERCLKEN     :1;                                       /* External Reference Enable */
    byte EREFS       :1;                                       /* External Reference Select */
    byte LP          :1;                                       /* Low Power Select */
    byte HGO         :1;                                       /* High Gain Oscillator Select */
    byte RANGE       :1;                                       /* Frequency Range Select */
    byte BDIV0       :1;                                       /* Bus Frequency Divider, bit 0 */
    byte BDIV1       :1;                                       /* Bus Frequency Divider, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpBDIV :2;
  } MergedBits;
} ICSC2STR;
extern volatile ICSC2STR _ICSC2 @0xFFFF8025;
#define ICSC2                           _ICSC2.Byte
#define ICSC2_EREFSTEN                  _ICSC2.Bits.EREFSTEN
#define ICSC2_ERCLKEN                   _ICSC2.Bits.ERCLKEN
#define ICSC2_EREFS                     _ICSC2.Bits.EREFS
#define ICSC2_LP                        _ICSC2.Bits.LP
#define ICSC2_HGO                       _ICSC2.Bits.HGO
#define ICSC2_RANGE                     _ICSC2.Bits.RANGE
#define ICSC2_BDIV0                     _ICSC2.Bits.BDIV0
#define ICSC2_BDIV1                     _ICSC2.Bits.BDIV1
#define ICSC2_BDIV                      _ICSC2.MergedBits.grpBDIV

#define ICSC2_EREFSTEN_MASK             1
#define ICSC2_ERCLKEN_MASK              2
#define ICSC2_EREFS_MASK                4
#define ICSC2_LP_MASK                   8
#define ICSC2_HGO_MASK                  16
#define ICSC2_RANGE_MASK                32
#define ICSC2_BDIV0_MASK                64
#define ICSC2_BDIV1_MASK                128
#define ICSC2_BDIV_MASK                 192
#define ICSC2_BDIV_BITNUM               6


