AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** RTCCNT - RTC Counter Register; 0xFFFF8029 ***/
typedef union {
  byte Byte;
} RTCCNTSTR;
extern volatile RTCCNTSTR _RTCCNT @0xFFFF8029;
#define RTCCNT                          _RTCCNT.Byte


/*** RTCMOD - RTC Modulo Register; 0xFFFF802A ***/
typedef union {
  byte Byte;
} RTCMODSTR;
extern volatile RTCMODSTR _RTCMOD @0xFFFF802A;
#define RTCMOD                          _RTCMOD.Byte


/*** RTCSC1 - RTC DMA Enable Register; 0xFFFF802B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte DMAEN       :1;                                       /* RTC DMA Enable */
  } Bits;
} RTCSC1STR;
extern volatile RTCSC1STR _RTCSC1 @0xFFFF802B;
#define RTCSC1                          _RTCSC1.Byte
#define RTCSC1_DMAEN                    _RTCSC1.Bits.DMAEN

#define RTCSC1_DMAEN_MASK               128


/*** DAC1CTRL - DAC Control Register; 0xFFFF802D ***/
typedef union {
  byte Byte;
  struct {
    byte VOSEL0      :1;                                       /* DAC output voltage select, bit 0 */
    byte VOSEL1      :1;                                       /* DAC output voltage select, bit 1 */
    byte VOSEL2      :1;                                       /* DAC output voltage select, bit 2 */
    byte VOSEL3      :1;                                       /* DAC output voltage select, bit 3 */
    byte VOSEL4      :1;                                       /* DAC output voltage select, bit 4 */
    byte             :1; 
    byte VRSEL       :1;                                       /* Supply voltage reference source select. This bit selects the supply reference source */
    byte DACEN       :1;                                       /* DAC enable. When the module is disabled, the DAC is powered down to conserve power */
  } Bits;
  struct {
    byte grpVOSEL :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DAC1CTRLSTR;
extern volatile DAC1CTRLSTR _DAC1CTRL @0xFFFF802D;
#define DAC1CTRL                        _DAC1CTRL.Byte
#define DAC1CTRL_VOSEL0                 _DAC1CTRL.Bits.VOSEL0
#define DAC1CTRL_VOSEL1                 _DAC1CTRL.Bits.VOSEL1
#define DAC1CTRL_VOSEL2                 _DAC1CTRL.Bits.VOSEL2
#define DAC1CTRL_VOSEL3                 _DAC1CTRL.Bits.VOSEL3
#define DAC1CTRL_VOSEL4                 _DAC1CTRL.Bits.VOSEL4
#define DAC1CTRL_VRSEL                  _DAC1CTRL.Bits.VRSEL
#define DAC1CTRL_DACEN                  _DAC1CTRL.Bits.DACEN
#define DAC1CTRL_VOSEL                  _DAC1CTRL.MergedBits.grpVOSEL

#define DAC1CTRL_VOSEL0_MASK            1
#define DAC1CTRL_VOSEL1_MASK            2
#define DAC1CTRL_VOSEL2_MASK            4
#define DAC1CTRL_VOSEL3_MASK            8
#define DAC1CTRL_VOSEL4_MASK            16
#define DAC1CTRL_VRSEL_MASK             64
#define DAC1CTRL_DACEN_MASK             128
#define DAC1CTRL_VOSEL_MASK             31
#define DAC1CTRL_VOSEL_BITNUM           0


/*** DAC2CTRL - DAC Control Register; 0xFFFF802E ***/
typedef union {
  byte Byte;
  struct {
    byte VOSEL0      :1;                                       /* DAC output voltage select, bit 0 */
    byte VOSEL1      :1;                                       /* DAC output voltage select, bit 1 */
    byte VOSEL2      :1;                                       /* DAC output voltage select, bit 2 */
    byte VOSEL3      :1;                                       /* DAC output voltage select, bit 3 */
    byte VOSEL4      :1;                                       /* DAC output voltage select, bit 4 */
    byte             :1; 
    byte VRSEL       :1;                                       /* Supply voltage reference source select. This bit selects the supply reference source */
    byte DACEN       :1;                                       /* DAC enable. When the module is disabled, the DAC is powered down to conserve power */
  } Bits;
  struct {
    byte grpVOSEL :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DAC2CTRLSTR;
extern volatile DAC2CTRLSTR _DAC2CTRL @0xFFFF802E;
#define DAC2CTRL                        _DAC2CTRL.Byte
#define DAC2CTRL_VOSEL0                 _DAC2CTRL.Bits.VOSEL0
#define DAC2CTRL_VOSEL1                 _DAC2CTRL.Bits.VOSEL1
#define DAC2CTRL_VOSEL2                 _DAC2CTRL.Bits.VOSEL2
#define DAC2CTRL_VOSEL3                 _DAC2CTRL.Bits.VOSEL3
#define DAC2CTRL_VOSEL4                 _DAC2CTRL.Bits.VOSEL4
#define DAC2CTRL_VRSEL                  _DAC2CTRL.Bits.VRSEL
#define DAC2CTRL_DACEN                  _DAC2CTRL.Bits.DACEN
#define DAC2CTRL_VOSEL                  _DAC2CTRL.MergedBits.grpVOSEL

#define DAC2CTRL_VOSEL0_MASK            1
#define DAC2CTRL_VOSEL1_MASK            2
#define DAC2CTRL_VOSEL2_MASK            4
#define DAC2CTRL_VOSEL3_MASK            8
#define DAC2CTRL_VOSEL4_MASK            16
#define DAC2CTRL_VRSEL_MASK             64
#define DAC2CTRL_DACEN_MASK             128
#define DAC2CTRL_VOSEL_MASK             31
#define DAC2CTRL_VOSEL_BITNUM           0


/*** ADCSC1A - ADC Status and control register 1A; 0xFFFF8030 ***/
typedef union {
  word Word;
  struct {
    word ADCH0       :1;                                       /* Input Channel Select, bit 0 */
    word ADCH1       :1;                                       /* Input Channel Select, bit 1 */
    word ADCH2       :1;                                       /* Input Channel Select, bit 2 */
    word ADCH3       :1;                                       /* Input Channel Select, bit 3 */
    word ADCH4       :1;                                       /* Input Channel Select, bit 4 */
    word ADCO        :1;                                       /* Continuous Conversion Enable */
    word AIEN        :1;                                       /* Interrupt Enable */
    word COCO        :1;                                       /* Conversion Complete Flag */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpADCH :5;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ADCSC1ASTR;
extern volatile ADCSC1ASTR _ADCSC1A @0xFFFF8030;
#define ADCSC1A                         _ADCSC1A.Word
#define ADCSC1A_ADCH0                   _ADCSC1A.Bits.ADCH0
#define ADCSC1A_ADCH1                   _ADCSC1A.Bits.ADCH1
#define ADCSC1A_ADCH2                   _ADCSC1A.Bits.ADCH2
#define ADCSC1A_ADCH3                   _ADCSC1A.Bits.ADCH3
#define ADCSC1A_ADCH4                   _ADCSC1A.Bits.ADCH4
#define ADCSC1A_ADCO                    _ADCSC1A.Bits.ADCO
#define ADCSC1A_AIEN                    _ADCSC1A.Bits.AIEN
#define ADCSC1A_COCO                    _ADCSC1A.Bits.COCO
#define ADCSC1A_ADCH                    _ADCSC1A.MergedBits.grpADCH

