AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define ADCSC1A_ADCH0_MASK              1
#define ADCSC1A_ADCH1_MASK              2
#define ADCSC1A_ADCH2_MASK              4
#define ADCSC1A_ADCH3_MASK              8
#define ADCSC1A_ADCH4_MASK              16
#define ADCSC1A_ADCO_MASK               32
#define ADCSC1A_AIEN_MASK               64
#define ADCSC1A_COCO_MASK               128
#define ADCSC1A_ADCH_MASK               31
#define ADCSC1A_ADCH_BITNUM             0


/*** ADCSC2 - ADC Status and control register 2; 0xFFFF8032 ***/
typedef union {
  word Word;
  struct {
    word REFSEL0     :1;                                       /* REFSEL, bit 0 */
    word REFSEL1     :1;                                       /* REFSEL, bit 1 */
    word             :1; 
    word DMAEN       :1;                                       /* DMA Enable */
    word BB          :1;                                       /* Back-to-back Conversion Enable */
    word             :1; 
    word ADTRG       :1;                                       /* Conversion Trigger Select */
    word ADACT       :1;                                       /* Conversion Active */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpREFSEL :2;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ADCSC2STR;
extern volatile ADCSC2STR _ADCSC2 @0xFFFF8032;
#define ADCSC2                          _ADCSC2.Word
#define ADCSC2_REFSEL0                  _ADCSC2.Bits.REFSEL0
#define ADCSC2_REFSEL1                  _ADCSC2.Bits.REFSEL1
#define ADCSC2_DMAEN                    _ADCSC2.Bits.DMAEN
#define ADCSC2_BB                       _ADCSC2.Bits.BB
#define ADCSC2_ADTRG                    _ADCSC2.Bits.ADTRG
#define ADCSC2_ADACT                    _ADCSC2.Bits.ADACT
#define ADCSC2_REFSEL                   _ADCSC2.MergedBits.grpREFSEL

#define ADCSC2_REFSEL0_MASK             1
#define ADCSC2_REFSEL1_MASK             2
#define ADCSC2_DMAEN_MASK               8
#define ADCSC2_BB_MASK                  16
#define ADCSC2_ADTRG_MASK               64
#define ADCSC2_ADACT_MASK               128
#define ADCSC2_REFSEL_MASK              3
#define ADCSC2_REFSEL_BITNUM            0


/*** ADCCFG - ADC Configuration register; 0xFFFF803C ***/
typedef union {
  word Word;
  struct {
    word ADICLK0     :1;                                       /* Input Clock Select, bit 0 */
    word ADICLK1     :1;                                       /* Input Clock Select, bit 1 */
    word MODE0       :1;                                       /* Conversion Mode Selection, bit 0 */
    word MODE1       :1;                                       /* Conversion Mode Selection, bit 1 */
    word ADLSMP      :1;                                       /* Long Sample Time Configuration */
    word ADIV0       :1;                                       /* Clock Divide Select, bit 0 */
    word ADIV1       :1;                                       /* Clock Divide Select, bit 1 */
    word ADLPC       :1;                                       /* Low Power Configuration */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpADICLK :2;
    word grpMODE :2;
    word         :1;
    word grpADIV :2;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ADCCFGSTR;
extern volatile ADCCFGSTR _ADCCFG @0xFFFF803C;
#define ADCCFG                          _ADCCFG.Word
#define ADCCFG_ADICLK0                  _ADCCFG.Bits.ADICLK0
#define ADCCFG_ADICLK1                  _ADCCFG.Bits.ADICLK1
#define ADCCFG_MODE0                    _ADCCFG.Bits.MODE0
#define ADCCFG_MODE1                    _ADCCFG.Bits.MODE1
#define ADCCFG_ADLSMP                   _ADCCFG.Bits.ADLSMP
#define ADCCFG_ADIV0                    _ADCCFG.Bits.ADIV0
#define ADCCFG_ADIV1                    _ADCCFG.Bits.ADIV1
#define ADCCFG_ADLPC                    _ADCCFG.Bits.ADLPC
#define ADCCFG_ADICLK                   _ADCCFG.MergedBits.grpADICLK
#define ADCCFG_MODE                     _ADCCFG.MergedBits.grpMODE
#define ADCCFG_ADIV                     _ADCCFG.MergedBits.grpADIV

#define ADCCFG_ADICLK0_MASK             1
#define ADCCFG_ADICLK1_MASK             2
#define ADCCFG_MODE0_MASK               4
#define ADCCFG_MODE1_MASK               8
#define ADCCFG_ADLSMP_MASK              16
#define ADCCFG_ADIV0_MASK               32
#define ADCCFG_ADIV1_MASK               64
#define ADCCFG_ADLPC_MASK               128
#define ADCCFG_ADICLK_MASK              3
#define ADCCFG_ADICLK_BITNUM            0
#define ADCCFG_MODE_MASK                12
#define ADCCFG_MODE_BITNUM              2
#define ADCCFG_ADIV_MASK                96
#define ADCCFG_ADIV_BITNUM              5


/*** ADCSC1B - ADC Status and control register 1B; 0xFFFF8044 ***/
typedef union {
  word Word;
  struct {
    word ADCH0       :1;                                       /* Input Channel Select, bit 0 */
    word ADCH1       :1;                                       /* Input Channel Select, bit 1 */
    word ADCH2       :1;                                       /* Input Channel Select, bit 2 */
    word ADCH3       :1;                                       /* Input Channel Select, bit 3 */
    word ADCH4       :1;                                       /* Input Channel Select, bit 4 */
    word ADCO        :1;                                       /* Continuous Conversion Enable */
    word AIEN        :1;                                       /* Interrupt Enable */
    word COCO        :1;                                       /* Conversion Complete Flag */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpADCH :5;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ADCSC1BSTR;
extern volatile ADCSC1BSTR _ADCSC1B @0xFFFF8044;
#define ADCSC1B                         _ADCSC1B.Word
#define ADCSC1B_ADCH0                   _ADCSC1B.Bits.ADCH0
#define ADCSC1B_ADCH1                   _ADCSC1B.Bits.ADCH1
#define ADCSC1B_ADCH2                   _ADCSC1B.Bits.ADCH2
#define ADCSC1B_ADCH3                   _ADCSC1B.Bits.ADCH3
#define ADCSC1B_ADCH4                   _ADCSC1B.Bits.ADCH4
#define ADCSC1B_ADCO                    _ADCSC1B.Bits.ADCO
#define ADCSC1B_AIEN                    _ADCSC1B.Bits.AIEN
#define ADCSC1B_COCO                    _ADCSC1B.Bits.COCO
#define ADCSC1B_ADCH                    _ADCSC1B.MergedBits.grpADCH

#define ADCSC1B_ADCH0_MASK              1
#define ADCSC1B_ADCH1_MASK              2
#define ADCSC1B_ADCH2_MASK              4
#define ADCSC1B_ADCH3_MASK              8
#define ADCSC1B_ADCH4_MASK              16
#define ADCSC1B_ADCO_MASK               32
#define ADCSC1B_AIEN_MASK               64
#define ADCSC1B_COCO_MASK               128
#define ADCSC1B_ADCH_MASK               31
#define ADCSC1B_ADCH_BITNUM             0


