AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** ADCRA - ADC Data Result Registers A; 0xFFFF8046 ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word ADR0        :1;                                       /* Digital Result of the Conversion, bit 0 */
    word ADR1        :1;                                       /* Digital Result of the Conversion, bit 1 */
    word ADR2        :1;                                       /* Digital Result of the Conversion, bit 2 */
    word ADR3        :1;                                       /* Digital Result of the Conversion, bit 3 */
    word ADR4        :1;                                       /* Digital Result of the Conversion, bit 4 */
    word ADR5        :1;                                       /* Digital Result of the Conversion, bit 5 */
    word ADR6        :1;                                       /* Digital Result of the Conversion, bit 6 */
    word ADR7        :1;                                       /* Digital Result of the Conversion, bit 7 */
    word ADR8        :1;                                       /* Digital Result of the Conversion, bit 8 */
    word ADR9        :1;                                       /* Digital Result of the Conversion, bit 9 */
    word ADR10       :1;                                       /* Digital Result of the Conversion, bit 10 */
    word ADR11       :1;                                       /* Digital Result of the Conversion, bit 11 */
    word             :1; 
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word grpADR  :12;
    word         :1;
  } MergedBits;
} ADCRASTR;
extern volatile ADCRASTR _ADCRA @0xFFFF8046;
#define ADCRA                           _ADCRA.Word
#define ADCRA_ADR0                      _ADCRA.Bits.ADR0
#define ADCRA_ADR1                      _ADCRA.Bits.ADR1
#define ADCRA_ADR2                      _ADCRA.Bits.ADR2
#define ADCRA_ADR3                      _ADCRA.Bits.ADR3
#define ADCRA_ADR4                      _ADCRA.Bits.ADR4
#define ADCRA_ADR5                      _ADCRA.Bits.ADR5
#define ADCRA_ADR6                      _ADCRA.Bits.ADR6
#define ADCRA_ADR7                      _ADCRA.Bits.ADR7
#define ADCRA_ADR8                      _ADCRA.Bits.ADR8
#define ADCRA_ADR9                      _ADCRA.Bits.ADR9
#define ADCRA_ADR10                     _ADCRA.Bits.ADR10
#define ADCRA_ADR11                     _ADCRA.Bits.ADR11
#define ADCRA_ADR                       _ADCRA.MergedBits.grpADR

#define ADCRA_ADR0_MASK                 8
#define ADCRA_ADR1_MASK                 16
#define ADCRA_ADR2_MASK                 32
#define ADCRA_ADR3_MASK                 64
#define ADCRA_ADR4_MASK                 128
#define ADCRA_ADR5_MASK                 256
#define ADCRA_ADR6_MASK                 512
#define ADCRA_ADR7_MASK                 1024
#define ADCRA_ADR8_MASK                 2048
#define ADCRA_ADR9_MASK                 4096
#define ADCRA_ADR10_MASK                8192
#define ADCRA_ADR11_MASK                16384
#define ADCRA_ADR_MASK                  32760
#define ADCRA_ADR_BITNUM                3


/*** ADCRB - ADC Data Result Registers B; 0xFFFF8048 ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word ADR0        :1;                                       /* Digital Result of the Conversion, bit 0 */
    word ADR1        :1;                                       /* Digital Result of the Conversion, bit 1 */
    word ADR2        :1;                                       /* Digital Result of the Conversion, bit 2 */
    word ADR3        :1;                                       /* Digital Result of the Conversion, bit 3 */
    word ADR4        :1;                                       /* Digital Result of the Conversion, bit 4 */
    word ADR5        :1;                                       /* Digital Result of the Conversion, bit 5 */
    word ADR6        :1;                                       /* Digital Result of the Conversion, bit 6 */
    word ADR7        :1;                                       /* Digital Result of the Conversion, bit 7 */
    word ADR8        :1;                                       /* Digital Result of the Conversion, bit 8 */
    word ADR9        :1;                                       /* Digital Result of the Conversion, bit 9 */
    word ADR10       :1;                                       /* Digital Result of the Conversion, bit 10 */
    word ADR11       :1;                                       /* Digital Result of the Conversion, bit 11 */
    word             :1; 
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word grpADR  :12;
    word         :1;
  } MergedBits;
} ADCRBSTR;
extern volatile ADCRBSTR _ADCRB @0xFFFF8048;
#define ADCRB                           _ADCRB.Word
#define ADCRB_ADR0                      _ADCRB.Bits.ADR0
#define ADCRB_ADR1                      _ADCRB.Bits.ADR1
#define ADCRB_ADR2                      _ADCRB.Bits.ADR2
#define ADCRB_ADR3                      _ADCRB.Bits.ADR3
#define ADCRB_ADR4                      _ADCRB.Bits.ADR4
#define ADCRB_ADR5                      _ADCRB.Bits.ADR5
#define ADCRB_ADR6                      _ADCRB.Bits.ADR6
#define ADCRB_ADR7                      _ADCRB.Bits.ADR7
#define ADCRB_ADR8                      _ADCRB.Bits.ADR8
#define ADCRB_ADR9                      _ADCRB.Bits.ADR9
#define ADCRB_ADR10                     _ADCRB.Bits.ADR10
#define ADCRB_ADR11                     _ADCRB.Bits.ADR11
#define ADCRB_ADR                       _ADCRB.MergedBits.grpADR

#define ADCRB_ADR0_MASK                 8
#define ADCRB_ADR1_MASK                 16
#define ADCRB_ADR2_MASK                 32
#define ADCRB_ADR3_MASK                 64
#define ADCRB_ADR4_MASK                 128
#define ADCRB_ADR5_MASK                 256
#define ADCRB_ADR6_MASK                 512
#define ADCRB_ADR7_MASK                 1024
#define ADCRB_ADR8_MASK                 2048
#define ADCRB_ADR9_MASK                 4096
#define ADCRB_ADR10_MASK                8192
#define ADCRB_ADR11_MASK                16384
#define ADCRB_ADR_MASK                  32760
#define ADCRB_ADR_BITNUM                3


/*** SCI1BD - SCI1 Baud Rate Register; 0xFFFF8050 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI1BDH - SCI1 Baud Rate Register High; 0xFFFF8050 ***/
    union {
      byte Byte;
      struct {
        byte SBR8        :1;                                       /* Baud Rate Modulo Divisor Bit 8 */
        byte SBR9        :1;                                       /* Baud Rate Modulo Divisor Bit 9 */
        byte SBR10       :1;                                       /* Baud Rate Modulo Divisor Bit 10 */
        byte SBR11       :1;                                       /* Baud Rate Modulo Divisor Bit 11 */
        byte SBR12       :1;                                       /* Baud Rate Modulo Divisor Bit 12 */
        byte             :1; 
        byte RXEDGIE     :1;                                       /* RxD Input Active Edge Interrupt Enable (for RXEDGIF) */
        byte LBKDIE      :1;                                       /* LIN Break Detect Interrupt Enable (for LBKDIF) */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI1BDHSTR;
    #define SCI1BDH                     _SCI1BD.Overlap_STR.SCI1BDHSTR.Byte
    #define SCI1BDH_SBR8                _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR8
    #define SCI1BDH_SBR9                _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR9
    #define SCI1BDH_SBR10               _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR10
    #define SCI1BDH_SBR11               _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR11
    #define SCI1BDH_SBR12               _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.SBR12
    #define SCI1BDH_RXEDGIE             _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.RXEDGIE
    #define SCI1BDH_LBKDIE              _SCI1BD.Overlap_STR.SCI1BDHSTR.Bits.LBKDIE
    #define SCI1BDH_SBR_8               _SCI1BD.Overlap_STR.SCI1BDHSTR.MergedBits.grpSBR_8
    #define SCI1BDH_SBR                 SCI1BDH_SBR_8
    
    #define SCI1BDH_SBR8_MASK           1
    #define SCI1BDH_SBR9_MASK           2
    #define SCI1BDH_SBR10_MASK          4
    #define SCI1BDH_SBR11_MASK          8
    #define SCI1BDH_SBR12_MASK          16
    #define SCI1BDH_RXEDGIE_MASK        64
    #define SCI1BDH_LBKDIE_MASK         128
    #define SCI1BDH_SBR_8_MASK          31
    #define SCI1BDH_SBR_8_BITNUM        0
    

    /*** SCI1BDL - SCI1 Baud Rate Register Low; 0xFFFF8051 ***/
    union {
      byte Byte;
      struct {
        byte SBR0        :1;                                       /* Baud Rate Modulo Divisor Bit 0 */
        byte SBR1        :1;                                       /* Baud Rate Modulo Divisor Bit 1 */
        byte SBR2        :1;                                       /* Baud Rate Modulo Divisor Bit 2 */
        byte SBR3        :1;                                       /* Baud Rate Modulo Divisor Bit 3 */
        byte SBR4        :1;                                       /* Baud Rate Modulo Divisor Bit 4 */
        byte SBR5        :1;                                       /* Baud Rate Modulo Divisor Bit 5 */
        byte SBR6        :1;                                       /* Baud Rate Modulo Divisor Bit 6 */
        byte SBR7        :1;                                       /* Baud Rate Modulo Divisor Bit 7 */
      } Bits;
    } SCI1BDLSTR;
    #define SCI1BDL                     _SCI1BD.Overlap_STR.SCI1BDLSTR.Byte
    #define SCI1BDL_SBR0                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR0
    #define SCI1BDL_SBR1                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR1
    #define SCI1BDL_SBR2                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR2
    #define SCI1BDL_SBR3                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR3
    #define SCI1BDL_SBR4                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR4
    #define SCI1BDL_SBR5                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR5
    #define SCI1BDL_SBR6                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR6
    #define SCI1BDL_SBR7                _SCI1BD.Overlap_STR.SCI1BDLSTR.Bits.SBR7
    
    #define SCI1BDL_SBR0_MASK           1
    #define SCI1BDL_SBR1_MASK           2
    #define SCI1BDL_SBR2_MASK           4
    #define SCI1BDL_SBR3_MASK           8
    #define SCI1BDL_SBR4_MASK           16
    #define SCI1BDL_SBR5_MASK           32
    #define SCI1BDL_SBR6_MASK           64
    #define SCI1BDL_SBR7_MASK           128
    
  } Overlap_STR;

