AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** SCI1MA2 - SCI1 Match Address Registers 2; 0xFFFF8059 ***/
typedef union {
  byte Byte;
  struct {
    byte MA0         :1;                                       /* Match address value, bit 0 */
    byte MA1         :1;                                       /* Match address value, bit 1 */
    byte MA2         :1;                                       /* Match address value, bit 2 */
    byte MA3         :1;                                       /* Match address value, bit 3 */
    byte MA4         :1;                                       /* Match address value, bit 4 */
    byte MA5         :1;                                       /* Match address value, bit 5 */
    byte MA6         :1;                                       /* Match address value, bit 6 */
    byte MA7         :1;                                       /* Match address value, bit 7 */
  } Bits;
} SCI1MA2STR;
extern volatile SCI1MA2STR _SCI1MA2 @0xFFFF8059;
#define SCI1MA2                         _SCI1MA2.Byte
#define SCI1MA2_MA0                     _SCI1MA2.Bits.MA0
#define SCI1MA2_MA1                     _SCI1MA2.Bits.MA1
#define SCI1MA2_MA2                     _SCI1MA2.Bits.MA2
#define SCI1MA2_MA3                     _SCI1MA2.Bits.MA3
#define SCI1MA2_MA4                     _SCI1MA2.Bits.MA4
#define SCI1MA2_MA5                     _SCI1MA2.Bits.MA5
#define SCI1MA2_MA6                     _SCI1MA2.Bits.MA6
#define SCI1MA2_MA7                     _SCI1MA2.Bits.MA7

#define SCI1MA2_MA0_MASK                1
#define SCI1MA2_MA1_MASK                2
#define SCI1MA2_MA2_MASK                4
#define SCI1MA2_MA3_MASK                8
#define SCI1MA2_MA4_MASK                16
#define SCI1MA2_MA5_MASK                32
#define SCI1MA2_MA6_MASK                64
#define SCI1MA2_MA7_MASK                128


/*** SCI1C4 - SCI1 Control Register 4; 0xFFFF805A ***/
typedef union {
  byte Byte;
  struct {
    byte BRFA0       :1;                                       /* Baud rate fine adjust, bit 0 */
    byte BRFA1       :1;                                       /* Baud rate fine adjust, bit 1 */
    byte BRFA2       :1;                                       /* Baud rate fine adjust, bit 2 */
    byte BRFA3       :1;                                       /* Baud rate fine adjust, bit 3 */
    byte BRFA4       :1;                                       /* Baud rate fine adjust, bit 4 */
    byte             :1; 
    byte MAEN2       :1;                                       /* Match Address Mode Enable 2 */
    byte MAEN1       :1;                                       /* Match Address Mode Enable 1 */
  } Bits;
  struct {
    byte grpBRFA :5;
    byte         :1;
    byte grpMAEN_2 :1;
    byte grpMAEN_1 :1;
  } MergedBits;
} SCI1C4STR;
extern volatile SCI1C4STR _SCI1C4 @0xFFFF805A;
#define SCI1C4                          _SCI1C4.Byte
#define SCI1C4_BRFA0                    _SCI1C4.Bits.BRFA0
#define SCI1C4_BRFA1                    _SCI1C4.Bits.BRFA1
#define SCI1C4_BRFA2                    _SCI1C4.Bits.BRFA2
#define SCI1C4_BRFA3                    _SCI1C4.Bits.BRFA3
#define SCI1C4_BRFA4                    _SCI1C4.Bits.BRFA4
#define SCI1C4_MAEN2                    _SCI1C4.Bits.MAEN2
#define SCI1C4_MAEN1                    _SCI1C4.Bits.MAEN1
#define SCI1C4_BRFA                     _SCI1C4.MergedBits.grpBRFA

#define SCI1C4_BRFA0_MASK               1
#define SCI1C4_BRFA1_MASK               2
#define SCI1C4_BRFA2_MASK               4
#define SCI1C4_BRFA3_MASK               8
#define SCI1C4_BRFA4_MASK               16
#define SCI1C4_MAEN2_MASK               64
#define SCI1C4_MAEN1_MASK               128
#define SCI1C4_BRFA_MASK                31
#define SCI1C4_BRFA_BITNUM              0


/*** SCI1C5 - SCI1 Control Register 5; 0xFFFF805B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RDMAS       :1;                                       /* Receiver Full DMA Select */
    byte             :1; 
    byte TDMAS       :1;                                       /* Transmitter DMA Select */
  } Bits;
} SCI1C5STR;
extern volatile SCI1C5STR _SCI1C5 @0xFFFF805B;
#define SCI1C5                          _SCI1C5.Byte
#define SCI1C5_RDMAS                    _SCI1C5.Bits.RDMAS
#define SCI1C5_TDMAS                    _SCI1C5.Bits.TDMAS

#define SCI1C5_RDMAS_MASK               32
#define SCI1C5_TDMAS_MASK               128


/*** SCI2BD - SCI2 Baud Rate Register; 0xFFFF8060 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI2BDH - SCI2 Baud Rate Register High; 0xFFFF8060 ***/
    union {
      byte Byte;
      struct {
        byte SBR8        :1;                                       /* Baud Rate Modulo Divisor Bit 8 */
        byte SBR9        :1;                                       /* Baud Rate Modulo Divisor Bit 9 */
        byte SBR10       :1;                                       /* Baud Rate Modulo Divisor Bit 10 */
        byte SBR11       :1;                                       /* Baud Rate Modulo Divisor Bit 11 */
        byte SBR12       :1;                                       /* Baud Rate Modulo Divisor Bit 12 */
        byte             :1; 
        byte RXEDGIE     :1;                                       /* RxD Input Active Edge Interrupt Enable (for RXEDGIF) */
        byte LBKDIE      :1;                                       /* LIN Break Detect Interrupt Enable (for LBKDIF) */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI2BDHSTR;
    #define SCI2BDH                     _SCI2BD.Overlap_STR.SCI2BDHSTR.Byte
    #define SCI2BDH_SBR8                _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.SBR8
    #define SCI2BDH_SBR9                _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.SBR9
    #define SCI2BDH_SBR10               _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.SBR10
    #define SCI2BDH_SBR11               _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.SBR11
    #define SCI2BDH_SBR12               _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.SBR12
    #define SCI2BDH_RXEDGIE             _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.RXEDGIE
    #define SCI2BDH_LBKDIE              _SCI2BD.Overlap_STR.SCI2BDHSTR.Bits.LBKDIE
    #define SCI2BDH_SBR_8               _SCI2BD.Overlap_STR.SCI2BDHSTR.MergedBits.grpSBR_8
    #define SCI2BDH_SBR                 SCI2BDH_SBR_8
    
    #define SCI2BDH_SBR8_MASK           1
    #define SCI2BDH_SBR9_MASK           2
    #define SCI2BDH_SBR10_MASK          4
    #define SCI2BDH_SBR11_MASK          8
    #define SCI2BDH_SBR12_MASK          16
    #define SCI2BDH_RXEDGIE_MASK        64
    #define SCI2BDH_LBKDIE_MASK         128
    #define SCI2BDH_SBR_8_MASK          31
    #define SCI2BDH_SBR_8_BITNUM        0
    

