AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile SCI2C3STR _SCI2C3 @0xFFFF8066;
#define SCI2C3                          _SCI2C3.Byte
#define SCI2C3_PEIE                     _SCI2C3.Bits.PEIE
#define SCI2C3_FEIE                     _SCI2C3.Bits.FEIE
#define SCI2C3_NEIE                     _SCI2C3.Bits.NEIE
#define SCI2C3_ORIE                     _SCI2C3.Bits.ORIE
#define SCI2C3_TXINV                    _SCI2C3.Bits.TXINV
#define SCI2C3_TXDIR                    _SCI2C3.Bits.TXDIR
#define SCI2C3_T8                       _SCI2C3.Bits.T8
#define SCI2C3_R8                       _SCI2C3.Bits.R8

#define SCI2C3_PEIE_MASK                1
#define SCI2C3_FEIE_MASK                2
#define SCI2C3_NEIE_MASK                4
#define SCI2C3_ORIE_MASK                8
#define SCI2C3_TXINV_MASK               16
#define SCI2C3_TXDIR_MASK               32
#define SCI2C3_T8_MASK                  64
#define SCI2C3_R8_MASK                  128


/*** SCI2D - SCI2 Data Register; 0xFFFF8067 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Receive/Transmit Data Bit 0 */
    byte R1_T1       :1;                                       /* Receive/Transmit Data Bit 1 */
    byte R2_T2       :1;                                       /* Receive/Transmit Data Bit 2 */
    byte R3_T3       :1;                                       /* Receive/Transmit Data Bit 3 */
    byte R4_T4       :1;                                       /* Receive/Transmit Data Bit 4 */
    byte R5_T5       :1;                                       /* Receive/Transmit Data Bit 5 */
    byte R6_T6       :1;                                       /* Receive/Transmit Data Bit 6 */
    byte R7_T7       :1;                                       /* Receive/Transmit Data Bit 7 */
  } Bits;
} SCI2DSTR;
extern volatile SCI2DSTR _SCI2D @0xFFFF8067;
#define SCI2D                           _SCI2D.Byte
#define SCI2D_R0_T0                     _SCI2D.Bits.R0_T0
#define SCI2D_R1_T1                     _SCI2D.Bits.R1_T1
#define SCI2D_R2_T2                     _SCI2D.Bits.R2_T2
#define SCI2D_R3_T3                     _SCI2D.Bits.R3_T3
#define SCI2D_R4_T4                     _SCI2D.Bits.R4_T4
#define SCI2D_R5_T5                     _SCI2D.Bits.R5_T5
#define SCI2D_R6_T6                     _SCI2D.Bits.R6_T6
#define SCI2D_R7_T7                     _SCI2D.Bits.R7_T7

#define SCI2D_R0_T0_MASK                1
#define SCI2D_R1_T1_MASK                2
#define SCI2D_R2_T2_MASK                4
#define SCI2D_R3_T3_MASK                8
#define SCI2D_R4_T4_MASK                16
#define SCI2D_R5_T5_MASK                32
#define SCI2D_R6_T6_MASK                64
#define SCI2D_R7_T7_MASK                128


/*** SCI2MA1 - SCI2 Match Address Registers 1; 0xFFFF8068 ***/
typedef union {
  byte Byte;
  struct {
    byte MA0         :1;                                       /* Match address value, bit 0 */
    byte MA1         :1;                                       /* Match address value, bit 1 */
    byte MA2         :1;                                       /* Match address value, bit 2 */
    byte MA3         :1;                                       /* Match address value, bit 3 */
    byte MA4         :1;                                       /* Match address value, bit 4 */
    byte MA5         :1;                                       /* Match address value, bit 5 */
    byte MA6         :1;                                       /* Match address value, bit 6 */
    byte MA7         :1;                                       /* Match address value, bit 7 */
  } Bits;
} SCI2MA1STR;
extern volatile SCI2MA1STR _SCI2MA1 @0xFFFF8068;
#define SCI2MA1                         _SCI2MA1.Byte
#define SCI2MA1_MA0                     _SCI2MA1.Bits.MA0
#define SCI2MA1_MA1                     _SCI2MA1.Bits.MA1
#define SCI2MA1_MA2                     _SCI2MA1.Bits.MA2
#define SCI2MA1_MA3                     _SCI2MA1.Bits.MA3
#define SCI2MA1_MA4                     _SCI2MA1.Bits.MA4
#define SCI2MA1_MA5                     _SCI2MA1.Bits.MA5
#define SCI2MA1_MA6                     _SCI2MA1.Bits.MA6
#define SCI2MA1_MA7                     _SCI2MA1.Bits.MA7

#define SCI2MA1_MA0_MASK                1
#define SCI2MA1_MA1_MASK                2
#define SCI2MA1_MA2_MASK                4
#define SCI2MA1_MA3_MASK                8
#define SCI2MA1_MA4_MASK                16
#define SCI2MA1_MA5_MASK                32
#define SCI2MA1_MA6_MASK                64
#define SCI2MA1_MA7_MASK                128


/*** SCI2MA2 - SCI2 Match Address Registers 2; 0xFFFF8069 ***/
typedef union {
  byte Byte;
  struct {
    byte MA0         :1;                                       /* Match address value, bit 0 */
    byte MA1         :1;                                       /* Match address value, bit 1 */
    byte MA2         :1;                                       /* Match address value, bit 2 */
    byte MA3         :1;                                       /* Match address value, bit 3 */
    byte MA4         :1;                                       /* Match address value, bit 4 */
    byte MA5         :1;                                       /* Match address value, bit 5 */
    byte MA6         :1;                                       /* Match address value, bit 6 */
    byte MA7         :1;                                       /* Match address value, bit 7 */
  } Bits;
} SCI2MA2STR;
extern volatile SCI2MA2STR _SCI2MA2 @0xFFFF8069;
#define SCI2MA2                         _SCI2MA2.Byte
#define SCI2MA2_MA0                     _SCI2MA2.Bits.MA0
#define SCI2MA2_MA1                     _SCI2MA2.Bits.MA1
#define SCI2MA2_MA2                     _SCI2MA2.Bits.MA2
#define SCI2MA2_MA3                     _SCI2MA2.Bits.MA3
#define SCI2MA2_MA4                     _SCI2MA2.Bits.MA4
#define SCI2MA2_MA5                     _SCI2MA2.Bits.MA5
#define SCI2MA2_MA6                     _SCI2MA2.Bits.MA6
#define SCI2MA2_MA7                     _SCI2MA2.Bits.MA7

#define SCI2MA2_MA0_MASK                1
#define SCI2MA2_MA1_MASK                2
#define SCI2MA2_MA2_MASK                4
#define SCI2MA2_MA3_MASK                8
#define SCI2MA2_MA4_MASK                16
#define SCI2MA2_MA5_MASK                32
#define SCI2MA2_MA6_MASK                64
#define SCI2MA2_MA7_MASK                128


