AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** SCI2C4 - SCI2 Control Register 4; 0xFFFF806A ***/
typedef union {
  byte Byte;
  struct {
    byte BRFA0       :1;                                       /* Baud rate fine adjust, bit 0 */
    byte BRFA1       :1;                                       /* Baud rate fine adjust, bit 1 */
    byte BRFA2       :1;                                       /* Baud rate fine adjust, bit 2 */
    byte BRFA3       :1;                                       /* Baud rate fine adjust, bit 3 */
    byte BRFA4       :1;                                       /* Baud rate fine adjust, bit 4 */
    byte             :1; 
    byte MAEN2       :1;                                       /* Match Address Mode Enable 2 */
    byte MAEN1       :1;                                       /* Match Address Mode Enable 1 */
  } Bits;
  struct {
    byte grpBRFA :5;
    byte         :1;
    byte grpMAEN_2 :1;
    byte grpMAEN_1 :1;
  } MergedBits;
} SCI2C4STR;
extern volatile SCI2C4STR _SCI2C4 @0xFFFF806A;
#define SCI2C4                          _SCI2C4.Byte
#define SCI2C4_BRFA0                    _SCI2C4.Bits.BRFA0
#define SCI2C4_BRFA1                    _SCI2C4.Bits.BRFA1
#define SCI2C4_BRFA2                    _SCI2C4.Bits.BRFA2
#define SCI2C4_BRFA3                    _SCI2C4.Bits.BRFA3
#define SCI2C4_BRFA4                    _SCI2C4.Bits.BRFA4
#define SCI2C4_MAEN2                    _SCI2C4.Bits.MAEN2
#define SCI2C4_MAEN1                    _SCI2C4.Bits.MAEN1
#define SCI2C4_BRFA                     _SCI2C4.MergedBits.grpBRFA

#define SCI2C4_BRFA0_MASK               1
#define SCI2C4_BRFA1_MASK               2
#define SCI2C4_BRFA2_MASK               4
#define SCI2C4_BRFA3_MASK               8
#define SCI2C4_BRFA4_MASK               16
#define SCI2C4_MAEN2_MASK               64
#define SCI2C4_MAEN1_MASK               128
#define SCI2C4_BRFA_MASK                31
#define SCI2C4_BRFA_BITNUM              0


/*** SCI2C5 - SCI2 Control Register 5; 0xFFFF806B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RDMAS       :1;                                       /* Receiver Full DMA Select */
    byte             :1; 
    byte TDMAS       :1;                                       /* Transmitter DMA Select */
  } Bits;
} SCI2C5STR;
extern volatile SCI2C5STR _SCI2C5 @0xFFFF806B;
#define SCI2C5                          _SCI2C5.Byte
#define SCI2C5_RDMAS                    _SCI2C5.Bits.RDMAS
#define SCI2C5_TDMAS                    _SCI2C5.Bits.TDMAS

#define SCI2C5_RDMAS_MASK               32
#define SCI2C5_TDMAS_MASK               128


/*** TPM3SC - TPM3 Status and Control Register; 0xFFFF8070 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Divisor Select Bit 0 */
    byte PS1         :1;                                       /* Prescale Divisor Select Bit 1 */
    byte PS2         :1;                                       /* Prescale Divisor Select Bit 2 */
    byte CLKSA       :1;                                       /* Clock Source Select A */
    byte CLKSB       :1;                                       /* Clock Source Select B */
    byte CPWMS       :1;                                       /* Center-Aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte grpCLKSx :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TPM3SCSTR;
extern volatile TPM3SCSTR _TPM3SC @0xFFFF8070;
#define TPM3SC                          _TPM3SC.Byte
#define TPM3SC_PS0                      _TPM3SC.Bits.PS0
#define TPM3SC_PS1                      _TPM3SC.Bits.PS1
#define TPM3SC_PS2                      _TPM3SC.Bits.PS2
#define TPM3SC_CLKSA                    _TPM3SC.Bits.CLKSA
#define TPM3SC_CLKSB                    _TPM3SC.Bits.CLKSB
#define TPM3SC_CPWMS                    _TPM3SC.Bits.CPWMS
#define TPM3SC_TOIE                     _TPM3SC.Bits.TOIE
#define TPM3SC_TOF                      _TPM3SC.Bits.TOF
#define TPM3SC_PS                       _TPM3SC.MergedBits.grpPS
#define TPM3SC_CLKSx                    _TPM3SC.MergedBits.grpCLKSx

#define TPM3SC_PS0_MASK                 1
#define TPM3SC_PS1_MASK                 2
#define TPM3SC_PS2_MASK                 4
#define TPM3SC_CLKSA_MASK               8
#define TPM3SC_CLKSB_MASK               16
#define TPM3SC_CPWMS_MASK               32
#define TPM3SC_TOIE_MASK                64
#define TPM3SC_TOF_MASK                 128
#define TPM3SC_PS_MASK                  7
#define TPM3SC_PS_BITNUM                0
#define TPM3SC_CLKSx_MASK               24
#define TPM3SC_CLKSx_BITNUM             3


/*** TPM3CNT - TPM3 Timer Counter Register; 0xFFFF8071 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3CNTH - TPM3 Timer Counter Register High; 0xFFFF8071 ***/
    union {
      byte Byte;
    } TPM3CNTHSTR;
    #define TPM3CNTH                    _TPM3CNT.Overlap_STR.TPM3CNTHSTR.Byte
    

    /*** TPM3CNTL - TPM3 Timer Counter Register Low; 0xFFFF8072 ***/
    union {
      byte Byte;
    } TPM3CNTLSTR;
    #define TPM3CNTL                    _TPM3CNT.Overlap_STR.TPM3CNTLSTR.Byte
    
  } Overlap_STR;

} TPM3CNTSTR;
extern volatile TPM3CNTSTR _TPM3CNT @0xFFFF8071;
#define TPM3CNT                         _TPM3CNT.Word


/*** TPM3MOD - TPM3 Timer Counter Modulo Register; 0xFFFF8073 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TPM3MODH - TPM3 Timer Counter Modulo Register High; 0xFFFF8073 ***/
    union {
      byte Byte;
    } TPM3MODHSTR;
    #define TPM3MODH                    _TPM3MOD.Overlap_STR.TPM3MODHSTR.Byte
    

    /*** TPM3MODL - TPM3 Timer Counter Modulo Register Low; 0xFFFF8074 ***/
    union {
      byte Byte;
    } TPM3MODLSTR;
    #define TPM3MODL                    _TPM3MOD.Overlap_STR.TPM3MODLSTR.Byte
    
  } Overlap_STR;

} TPM3MODSTR;
