AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
} FTM1C1VSTR;
extern volatile FTM1C1VSTR _FTM1C1V @0xFFFF8089;
#define FTM1C1V                         _FTM1C1V.Word


/*** FTM1C2SC - FTM1 Timer Channel 2 Status and Control Register; 0xFFFF808B ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH2F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS2A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS2B       :1;                                       /* Edge/Level Select Bit B */
    byte MS2A        :1;                                       /* Mode Select A for FTM1 Channel 2 */
    byte MS2B        :1;                                       /* Mode Select B for FTM1 Channel 2 */
    byte CH2IE       :1;                                       /* Channel 2 Interrupt Enable */
    byte CH2F        :1;                                       /* Channel 2 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS2x :2;
    byte grpMS2x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1C2SCSTR;
extern volatile FTM1C2SCSTR _FTM1C2SC @0xFFFF808B;
#define FTM1C2SC                        _FTM1C2SC.Byte
#define FTM1C2SC_DMA                    _FTM1C2SC.Bits.DMA
#define FTM1C2SC_ELS2A                  _FTM1C2SC.Bits.ELS2A
#define FTM1C2SC_ELS2B                  _FTM1C2SC.Bits.ELS2B
#define FTM1C2SC_MS2A                   _FTM1C2SC.Bits.MS2A
#define FTM1C2SC_MS2B                   _FTM1C2SC.Bits.MS2B
#define FTM1C2SC_CH2IE                  _FTM1C2SC.Bits.CH2IE
#define FTM1C2SC_CH2F                   _FTM1C2SC.Bits.CH2F
#define FTM1C2SC_ELS2x                  _FTM1C2SC.MergedBits.grpELS2x
#define FTM1C2SC_MS2x                   _FTM1C2SC.MergedBits.grpMS2x

#define FTM1C2SC_DMA_MASK               1
#define FTM1C2SC_ELS2A_MASK             4
#define FTM1C2SC_ELS2B_MASK             8
#define FTM1C2SC_MS2A_MASK              16
#define FTM1C2SC_MS2B_MASK              32
#define FTM1C2SC_CH2IE_MASK             64
#define FTM1C2SC_CH2F_MASK              128
#define FTM1C2SC_ELS2x_MASK             12
#define FTM1C2SC_ELS2x_BITNUM           2
#define FTM1C2SC_MS2x_MASK              48
#define FTM1C2SC_MS2x_BITNUM            4


/*** FTM1C2V - FTM1 Timer Channel 2 Value Register; 0xFFFF808C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1C2VH - FTM1 Timer Channel 2 Value Register High; 0xFFFF808C ***/
    union {
      byte Byte;
    } FTM1C2VHSTR;
    #define FTM1C2VH                    _FTM1C2V.Overlap_STR.FTM1C2VHSTR.Byte
    

    /*** FTM1C2VL - FTM1 Timer Channel 2 Value Register Low; 0xFFFF808D ***/
    union {
      byte Byte;
    } FTM1C2VLSTR;
    #define FTM1C2VL                    _FTM1C2V.Overlap_STR.FTM1C2VLSTR.Byte
    
  } Overlap_STR;

} FTM1C2VSTR;
extern volatile FTM1C2VSTR _FTM1C2V @0xFFFF808C;
#define FTM1C2V                         _FTM1C2V.Word


/*** FTM1C3SC - FTM1 Timer Channel 3 Status and Control Register; 0xFFFF808E ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH3F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS3A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS3B       :1;                                       /* Edge/Level Select Bit B */
    byte MS3A        :1;                                       /* Mode Select A for FTM1 Channel 3 */
    byte MS3B        :1;                                       /* Mode Select B for FTM1 Channel 3 */
    byte CH3IE       :1;                                       /* Channel 3 Interrupt Enable */
    byte CH3F        :1;                                       /* Channel 3 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS3x :2;
    byte grpMS3x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1C3SCSTR;
extern volatile FTM1C3SCSTR _FTM1C3SC @0xFFFF808E;
#define FTM1C3SC                        _FTM1C3SC.Byte
#define FTM1C3SC_DMA                    _FTM1C3SC.Bits.DMA
#define FTM1C3SC_ELS3A                  _FTM1C3SC.Bits.ELS3A
#define FTM1C3SC_ELS3B                  _FTM1C3SC.Bits.ELS3B
#define FTM1C3SC_MS3A                   _FTM1C3SC.Bits.MS3A
#define FTM1C3SC_MS3B                   _FTM1C3SC.Bits.MS3B
#define FTM1C3SC_CH3IE                  _FTM1C3SC.Bits.CH3IE
#define FTM1C3SC_CH3F                   _FTM1C3SC.Bits.CH3F
#define FTM1C3SC_ELS3x                  _FTM1C3SC.MergedBits.grpELS3x
#define FTM1C3SC_MS3x                   _FTM1C3SC.MergedBits.grpMS3x

#define FTM1C3SC_DMA_MASK               1
#define FTM1C3SC_ELS3A_MASK             4
#define FTM1C3SC_ELS3B_MASK             8
#define FTM1C3SC_MS3A_MASK              16
#define FTM1C3SC_MS3B_MASK              32
#define FTM1C3SC_CH3IE_MASK             64
#define FTM1C3SC_CH3F_MASK              128
#define FTM1C3SC_ELS3x_MASK             12
#define FTM1C3SC_ELS3x_BITNUM           2
#define FTM1C3SC_MS3x_MASK              48
#define FTM1C3SC_MS3x_BITNUM            4


/*** FTM1C3V - FTM1 Timer Channel 3 Value Register; 0xFFFF808F ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1C3VH - FTM1 Timer Channel 3 Value Register High; 0xFFFF808F ***/
    union {
      byte Byte;
    } FTM1C3VHSTR;
    #define FTM1C3VH                    _FTM1C3V.Overlap_STR.FTM1C3VHSTR.Byte
    

    /*** FTM1C3VL - FTM1 Timer Channel 3 Value Register Low; 0xFFFF8090 ***/
    union {
      byte Byte;
    } FTM1C3VLSTR;
    #define FTM1C3VL                    _FTM1C3V.Overlap_STR.FTM1C3VLSTR.Byte
    
  } Overlap_STR;

} FTM1C3VSTR;
extern volatile FTM1C3VSTR _FTM1C3V @0xFFFF808F;
#define FTM1C3V                         _FTM1C3V.Word


/*** FTM1C4SC - FTM1 Timer Channel 4 Status and Control Register; 0xFFFF8091 ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH4F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS4A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS4B       :1;                                       /* Edge/Level Select Bit B */
    byte MS4A        :1;                                       /* Mode Select A for FTM1 Channel 4 */
    byte MS4B        :1;                                       /* Mode Select B for FTM1 Channel 4 */
    byte CH4IE       :1;                                       /* Channel 4 Interrupt Enable */
    byte CH4F        :1;                                       /* Channel 4 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS4x :2;
    byte grpMS4x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1C4SCSTR;
extern volatile FTM1C4SCSTR _FTM1C4SC @0xFFFF8091;
#define FTM1C4SC                        _FTM1C4SC.Byte
#define FTM1C4SC_DMA                    _FTM1C4SC.Bits.DMA
#define FTM1C4SC_ELS4A                  _FTM1C4SC.Bits.ELS4A
#define FTM1C4SC_ELS4B                  _FTM1C4SC.Bits.ELS4B
#define FTM1C4SC_MS4A                   _FTM1C4SC.Bits.MS4A
#define FTM1C4SC_MS4B                   _FTM1C4SC.Bits.MS4B
#define FTM1C4SC_CH4IE                  _FTM1C4SC.Bits.CH4IE
#define FTM1C4SC_CH4F                   _FTM1C4SC.Bits.CH4F
#define FTM1C4SC_ELS4x                  _FTM1C4SC.MergedBits.grpELS4x
#define FTM1C4SC_MS4x                   _FTM1C4SC.MergedBits.grpMS4x

#define FTM1C4SC_DMA_MASK               1
#define FTM1C4SC_ELS4A_MASK             4
#define FTM1C4SC_ELS4B_MASK             8
#define FTM1C4SC_MS4A_MASK              16
#define FTM1C4SC_MS4B_MASK              32
#define FTM1C4SC_CH4IE_MASK             64
#define FTM1C4SC_CH4F_MASK              128
#define FTM1C4SC_ELS4x_MASK             12
#define FTM1C4SC_ELS4x_BITNUM           2
#define FTM1C4SC_MS4x_MASK              48
#define FTM1C4SC_MS4x_BITNUM            4


/*** FTM1C4V - FTM1 Timer Channel 4 Value Register; 0xFFFF8092 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1C4VH - FTM1 Timer Channel 4 Value Register High; 0xFFFF8092 ***/
    union {
      byte Byte;
    } FTM1C4VHSTR;
    #define FTM1C4VH                    _FTM1C4V.Overlap_STR.FTM1C4VHSTR.Byte
    

    /*** FTM1C4VL - FTM1 Timer Channel 4 Value Register Low; 0xFFFF8093 ***/
    union {
      byte Byte;
    } FTM1C4VLSTR;
    #define FTM1C4VL                    _FTM1C4V.Overlap_STR.FTM1C4VLSTR.Byte
    
  } Overlap_STR;

} FTM1C4VSTR;
extern volatile FTM1C4VSTR _FTM1C4V @0xFFFF8092;
#define FTM1C4V                         _FTM1C4V.Word


