AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** FTM1C5SC - FTM1 Timer Channel 5 Status and Control Register; 0xFFFF8094 ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH5F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS5A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS5B       :1;                                       /* Edge/Level Select Bit B */
    byte MS5A        :1;                                       /* Mode Select A for FTM1 Channel 5 */
    byte MS5B        :1;                                       /* Mode Select B for FTM1 Channel 5 */
    byte CH5IE       :1;                                       /* Channel 5 Interrupt Enable */
    byte CH5F        :1;                                       /* Channel 5 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS5x :2;
    byte grpMS5x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1C5SCSTR;
extern volatile FTM1C5SCSTR _FTM1C5SC @0xFFFF8094;
#define FTM1C5SC                        _FTM1C5SC.Byte
#define FTM1C5SC_DMA                    _FTM1C5SC.Bits.DMA
#define FTM1C5SC_ELS5A                  _FTM1C5SC.Bits.ELS5A
#define FTM1C5SC_ELS5B                  _FTM1C5SC.Bits.ELS5B
#define FTM1C5SC_MS5A                   _FTM1C5SC.Bits.MS5A
#define FTM1C5SC_MS5B                   _FTM1C5SC.Bits.MS5B
#define FTM1C5SC_CH5IE                  _FTM1C5SC.Bits.CH5IE
#define FTM1C5SC_CH5F                   _FTM1C5SC.Bits.CH5F
#define FTM1C5SC_ELS5x                  _FTM1C5SC.MergedBits.grpELS5x
#define FTM1C5SC_MS5x                   _FTM1C5SC.MergedBits.grpMS5x

#define FTM1C5SC_DMA_MASK               1
#define FTM1C5SC_ELS5A_MASK             4
#define FTM1C5SC_ELS5B_MASK             8
#define FTM1C5SC_MS5A_MASK              16
#define FTM1C5SC_MS5B_MASK              32
#define FTM1C5SC_CH5IE_MASK             64
#define FTM1C5SC_CH5F_MASK              128
#define FTM1C5SC_ELS5x_MASK             12
#define FTM1C5SC_ELS5x_BITNUM           2
#define FTM1C5SC_MS5x_MASK              48
#define FTM1C5SC_MS5x_BITNUM            4


/*** FTM1C5V - FTM1 Timer Channel 5 Value Register; 0xFFFF8095 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1C5VH - FTM1 Timer Channel 5 Value Register High; 0xFFFF8095 ***/
    union {
      byte Byte;
    } FTM1C5VHSTR;
    #define FTM1C5VH                    _FTM1C5V.Overlap_STR.FTM1C5VHSTR.Byte
    

    /*** FTM1C5VL - FTM1 Timer Channel 5 Value Register Low; 0xFFFF8096 ***/
    union {
      byte Byte;
    } FTM1C5VLSTR;
    #define FTM1C5VL                    _FTM1C5V.Overlap_STR.FTM1C5VLSTR.Byte
    
  } Overlap_STR;

} FTM1C5VSTR;
extern volatile FTM1C5VSTR _FTM1C5V @0xFFFF8095;
#define FTM1C5V                         _FTM1C5V.Word


/*** FTM1CNTIN - FTM1 Counter Initial Value Registers; 0xFFFF80A0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM1CNTINH - FTM1 Counter Initial Value Registers High; 0xFFFF80A0 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* FTM1 Counter Initial Value Bit 8 */
        byte BIT9        :1;                                       /* FTM1 Counter Initial Value Bit 9 */
        byte BIT10       :1;                                       /* FTM1 Counter Initial Value Bit 10 */
        byte BIT11       :1;                                       /* FTM1 Counter Initial Value Bit 11 */
        byte BIT12       :1;                                       /* FTM1 Counter Initial Value Bit 12 */
        byte BIT13       :1;                                       /* FTM1 Counter Initial Value Bit 13 */
        byte BIT14       :1;                                       /* FTM1 Counter Initial Value Bit 14 */
        byte BIT15       :1;                                       /* FTM1 Counter Initial Value Bit 15 */
      } Bits;
    } FTM1CNTINHSTR;
    #define FTM1CNTINH                  _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Byte
    #define FTM1CNTINH_BIT8             _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT8
    #define FTM1CNTINH_BIT9             _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT9
    #define FTM1CNTINH_BIT10            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT10
    #define FTM1CNTINH_BIT11            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT11
    #define FTM1CNTINH_BIT12            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT12
    #define FTM1CNTINH_BIT13            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT13
    #define FTM1CNTINH_BIT14            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT14
    #define FTM1CNTINH_BIT15            _FTM1CNTIN.Overlap_STR.FTM1CNTINHSTR.Bits.BIT15
    
    #define FTM1CNTINH_BIT8_MASK        1
    #define FTM1CNTINH_BIT9_MASK        2
    #define FTM1CNTINH_BIT10_MASK       4
    #define FTM1CNTINH_BIT11_MASK       8
    #define FTM1CNTINH_BIT12_MASK       16
    #define FTM1CNTINH_BIT13_MASK       32
    #define FTM1CNTINH_BIT14_MASK       64
    #define FTM1CNTINH_BIT15_MASK       128
    

    /*** FTM1CNTINL - FTM1 Counter Initial Value Registers Low; 0xFFFF80A1 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* FTM1 Counter Initial Value Bit 0 */
        byte BIT1        :1;                                       /* FTM1 Counter Initial Value Bit 1 */
        byte BIT2        :1;                                       /* FTM1 Counter Initial Value Bit 2 */
        byte BIT3        :1;                                       /* FTM1 Counter Initial Value Bit 3 */
        byte BIT4        :1;                                       /* FTM1 Counter Initial Value Bit 4 */
        byte BIT5        :1;                                       /* FTM1 Counter Initial Value Bit 5 */
        byte BIT6        :1;                                       /* FTM1 Counter Initial Value Bit 6 */
        byte BIT7        :1;                                       /* FTM1 Counter Initial Value Bit 7 */
      } Bits;
    } FTM1CNTINLSTR;
    #define FTM1CNTINL                  _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Byte
    #define FTM1CNTINL_BIT0             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT0
    #define FTM1CNTINL_BIT1             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT1
    #define FTM1CNTINL_BIT2             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT2
    #define FTM1CNTINL_BIT3             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT3
    #define FTM1CNTINL_BIT4             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT4
    #define FTM1CNTINL_BIT5             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT5
    #define FTM1CNTINL_BIT6             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT6
    #define FTM1CNTINL_BIT7             _FTM1CNTIN.Overlap_STR.FTM1CNTINLSTR.Bits.BIT7
    
    #define FTM1CNTINL_BIT0_MASK        1
    #define FTM1CNTINL_BIT1_MASK        2
    #define FTM1CNTINL_BIT2_MASK        4
    #define FTM1CNTINL_BIT3_MASK        8
    #define FTM1CNTINL_BIT4_MASK        16
    #define FTM1CNTINL_BIT5_MASK        32
    #define FTM1CNTINL_BIT6_MASK        64
    #define FTM1CNTINL_BIT7_MASK        128
    
  } Overlap_STR;

