AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define FTM1SYNC_CNTMIN_MASK            1
#define FTM1SYNC_CNTMAX_MASK            2
#define FTM1SYNC_REINIT_MASK            4
#define FTM1SYNC_SYNCHOM_MASK           8
#define FTM1SYNC_TRIG0_MASK             16
#define FTM1SYNC_TRIG1_MASK             32
#define FTM1SYNC_TRIG2_MASK             64
#define FTM1SYNC_SWSYNC_MASK            128
#define FTM1SYNC_TRIG_MASK              112
#define FTM1SYNC_TRIG_BITNUM            4


/*** FTM1OUTINIT - FTM1 Initial State for Channels Output Register; 0xFFFF80A5 ***/
typedef union {
  byte Byte;
  struct {
    byte CH0OI       :1;                                       /* Initial State for Channel 0 Output */
    byte CH1OI       :1;                                       /* Initial State for Channel 1 Output */
    byte CH2OI       :1;                                       /* Initial State for Channel 2 Output */
    byte CH3OI       :1;                                       /* Initial State for Channel 3 Output */
    byte CH4OI       :1;                                       /* Initial State for Channel 4 Output */
    byte CH5OI       :1;                                       /* Initial State for Channel 5 Output */
    byte             :1; 
    byte             :1; 
  } Bits;
} FTM1OUTINITSTR;
extern volatile FTM1OUTINITSTR _FTM1OUTINIT @0xFFFF80A5;
#define FTM1OUTINIT                     _FTM1OUTINIT.Byte
#define FTM1OUTINIT_CH0OI               _FTM1OUTINIT.Bits.CH0OI
#define FTM1OUTINIT_CH1OI               _FTM1OUTINIT.Bits.CH1OI
#define FTM1OUTINIT_CH2OI               _FTM1OUTINIT.Bits.CH2OI
#define FTM1OUTINIT_CH3OI               _FTM1OUTINIT.Bits.CH3OI
#define FTM1OUTINIT_CH4OI               _FTM1OUTINIT.Bits.CH4OI
#define FTM1OUTINIT_CH5OI               _FTM1OUTINIT.Bits.CH5OI

#define FTM1OUTINIT_CH0OI_MASK          1
#define FTM1OUTINIT_CH1OI_MASK          2
#define FTM1OUTINIT_CH2OI_MASK          4
#define FTM1OUTINIT_CH3OI_MASK          8
#define FTM1OUTINIT_CH4OI_MASK          16
#define FTM1OUTINIT_CH5OI_MASK          32


/*** FTM1OUTMASK - FTM1 Output Mask Register; 0xFFFF80A6 ***/
typedef union {
  byte Byte;
  struct {
    byte CH0OM       :1;                                       /* Channel 0 Output Mask */
    byte CH1OM       :1;                                       /* Channel 1 Output Mask */
    byte CH2OM       :1;                                       /* Channel 2 Output Mask */
    byte CH3OM       :1;                                       /* Channel 3 Output Mask */
    byte CH4OM       :1;                                       /* Channel 4 Output Mask */
    byte CH5OM       :1;                                       /* Channel 5 Output Mask */
    byte             :1; 
    byte             :1; 
  } Bits;
} FTM1OUTMASKSTR;
extern volatile FTM1OUTMASKSTR _FTM1OUTMASK @0xFFFF80A6;
#define FTM1OUTMASK                     _FTM1OUTMASK.Byte
#define FTM1OUTMASK_CH0OM               _FTM1OUTMASK.Bits.CH0OM
#define FTM1OUTMASK_CH1OM               _FTM1OUTMASK.Bits.CH1OM
#define FTM1OUTMASK_CH2OM               _FTM1OUTMASK.Bits.CH2OM
#define FTM1OUTMASK_CH3OM               _FTM1OUTMASK.Bits.CH3OM
#define FTM1OUTMASK_CH4OM               _FTM1OUTMASK.Bits.CH4OM
#define FTM1OUTMASK_CH5OM               _FTM1OUTMASK.Bits.CH5OM

#define FTM1OUTMASK_CH0OM_MASK          1
#define FTM1OUTMASK_CH1OM_MASK          2
#define FTM1OUTMASK_CH2OM_MASK          4
#define FTM1OUTMASK_CH3OM_MASK          8
#define FTM1OUTMASK_CH4OM_MASK          16
#define FTM1OUTMASK_CH5OM_MASK          32


/*** FTM1COMBINE0 - FTM1 Function For Linked Channel 0 Register; 0xFFFF80A7 ***/
typedef union {
  byte Byte;
  struct {
    byte COMBINE     :1;                                       /* Enables the Combine of the Channels 0 and 1 */
    byte COMP        :1;                                       /* Complementary of Channel 0 */
    byte             :1; 
    byte             :1; 
    byte DTEN        :1;                                       /* Deadtime Enable */
    byte SYNCEN      :1;                                       /* Synchronization Enable */
    byte FAULTEN     :1;                                       /* Fault Control Enable */
    byte             :1; 
  } Bits;
} FTM1COMBINE0STR;
extern volatile FTM1COMBINE0STR _FTM1COMBINE0 @0xFFFF80A7;
#define FTM1COMBINE0                    _FTM1COMBINE0.Byte
#define FTM1COMBINE0_COMBINE            _FTM1COMBINE0.Bits.COMBINE
#define FTM1COMBINE0_COMP               _FTM1COMBINE0.Bits.COMP
#define FTM1COMBINE0_DTEN               _FTM1COMBINE0.Bits.DTEN
#define FTM1COMBINE0_SYNCEN             _FTM1COMBINE0.Bits.SYNCEN
#define FTM1COMBINE0_FAULTEN            _FTM1COMBINE0.Bits.FAULTEN
/* FTM1COMBINE_ARR: Access 3 FTM1COMBINEx registers in an array */
#define FTM1COMBINE_ARR                 ((volatile byte *) &FTM1COMBINE0)

#define FTM1COMBINE0_COMBINE_MASK       1
#define FTM1COMBINE0_COMP_MASK          2
#define FTM1COMBINE0_DTEN_MASK          16
#define FTM1COMBINE0_SYNCEN_MASK        32
#define FTM1COMBINE0_FAULTEN_MASK       64


/*** FTM1COMBINE1 - FTM1 Function For Linked Channel 1 Register; 0xFFFF80A8 ***/
typedef union {
  byte Byte;
  struct {
    byte COMBINE     :1;                                       /* Enables the Combine of the Channels 2 and 3 */
    byte COMP        :1;                                       /* Complementary of Channel 2 */
    byte             :1; 
    byte             :1; 
    byte DTEN        :1;                                       /* Deadtime Enable */
    byte SYNCEN      :1;                                       /* Synchronization Enable */
    byte FAULTEN     :1;                                       /* Fault Control Enable */
    byte             :1; 
  } Bits;
} FTM1COMBINE1STR;
extern volatile FTM1COMBINE1STR _FTM1COMBINE1 @0xFFFF80A8;
#define FTM1COMBINE1                    _FTM1COMBINE1.Byte
#define FTM1COMBINE1_COMBINE            _FTM1COMBINE1.Bits.COMBINE
#define FTM1COMBINE1_COMP               _FTM1COMBINE1.Bits.COMP
#define FTM1COMBINE1_DTEN               _FTM1COMBINE1.Bits.DTEN
#define FTM1COMBINE1_SYNCEN             _FTM1COMBINE1.Bits.SYNCEN
#define FTM1COMBINE1_FAULTEN            _FTM1COMBINE1.Bits.FAULTEN

#define FTM1COMBINE1_COMBINE_MASK       1
#define FTM1COMBINE1_COMP_MASK          2
#define FTM1COMBINE1_DTEN_MASK          16
#define FTM1COMBINE1_SYNCEN_MASK        32
#define FTM1COMBINE1_FAULTEN_MASK       64


/*** FTM1COMBINE2 - FTM1 Function For Linked Channel 2 Register; 0xFFFF80A9 ***/
typedef union {
  byte Byte;
  struct {
    byte COMBINE     :1;                                       /* Enables the Combine of the Channels 4 and 5 */
    byte COMP        :1;                                       /* Complementary of Channel 4 */
    byte             :1; 
    byte             :1; 
    byte DTEN        :1;                                       /* Deadtime Enable */
    byte SYNCEN      :1;                                       /* Synchronization Enable */
    byte FAULTEN     :1;                                       /* Fault Control Enable */
    byte             :1; 
  } Bits;
} FTM1COMBINE2STR;
extern volatile FTM1COMBINE2STR _FTM1COMBINE2 @0xFFFF80A9;
#define FTM1COMBINE2                    _FTM1COMBINE2.Byte
#define FTM1COMBINE2_COMBINE            _FTM1COMBINE2.Bits.COMBINE
#define FTM1COMBINE2_COMP               _FTM1COMBINE2.Bits.COMP
#define FTM1COMBINE2_DTEN               _FTM1COMBINE2.Bits.DTEN
#define FTM1COMBINE2_SYNCEN             _FTM1COMBINE2.Bits.SYNCEN
#define FTM1COMBINE2_FAULTEN            _FTM1COMBINE2.Bits.FAULTEN

#define FTM1COMBINE2_COMBINE_MASK       1
#define FTM1COMBINE2_COMP_MASK          2
#define FTM1COMBINE2_DTEN_MASK          16
#define FTM1COMBINE2_SYNCEN_MASK        32
#define FTM1COMBINE2_FAULTEN_MASK       64


/*** FTM1DEADTIME - FTM1 Deadtime Insertion Control Register; 0xFFFF80AB ***/
typedef union {
  byte Byte;
  struct {
    byte DTVAL0      :1;                                       /* Deadtime Value Bits, bit 0 */
    byte DTVAL1      :1;                                       /* Deadtime Value Bits, bit 1 */
    byte DTVAL2      :1;                                       /* Deadtime Value Bits, bit 2 */
    byte DTVAL3      :1;                                       /* Deadtime Value Bits, bit 3 */
    byte DTVAL4      :1;                                       /* Deadtime Value Bits, bit 4 */
    byte DTVAL5      :1;                                       /* Deadtime Value Bits, bit 5 */
    byte DTPS0       :1;                                       /* Deadtime Prescaler Value Bits, bit 0 */
    byte DTPS1       :1;                                       /* Deadtime Prescaler Value Bits, bit 1 */
  } Bits;
  struct {
    byte grpDTVAL :6;
    byte grpDTPS :2;
  } MergedBits;
} FTM1DEADTIMESTR;
extern volatile FTM1DEADTIMESTR _FTM1DEADTIME @0xFFFF80AB;
#define FTM1DEADTIME                    _FTM1DEADTIME.Byte
#define FTM1DEADTIME_DTVAL0             _FTM1DEADTIME.Bits.DTVAL0
#define FTM1DEADTIME_DTVAL1             _FTM1DEADTIME.Bits.DTVAL1
#define FTM1DEADTIME_DTVAL2             _FTM1DEADTIME.Bits.DTVAL2
#define FTM1DEADTIME_DTVAL3             _FTM1DEADTIME.Bits.DTVAL3
#define FTM1DEADTIME_DTVAL4             _FTM1DEADTIME.Bits.DTVAL4
#define FTM1DEADTIME_DTVAL5             _FTM1DEADTIME.Bits.DTVAL5
#define FTM1DEADTIME_DTPS0              _FTM1DEADTIME.Bits.DTPS0
#define FTM1DEADTIME_DTPS1              _FTM1DEADTIME.Bits.DTPS1
#define FTM1DEADTIME_DTVAL              _FTM1DEADTIME.MergedBits.grpDTVAL
#define FTM1DEADTIME_DTPS               _FTM1DEADTIME.MergedBits.grpDTPS

#define FTM1DEADTIME_DTVAL0_MASK        1
#define FTM1DEADTIME_DTVAL1_MASK        2
#define FTM1DEADTIME_DTVAL2_MASK        4
#define FTM1DEADTIME_DTVAL3_MASK        8
#define FTM1DEADTIME_DTVAL4_MASK        16
#define FTM1DEADTIME_DTVAL5_MASK        32
#define FTM1DEADTIME_DTPS0_MASK         64
#define FTM1DEADTIME_DTPS1_MASK         128
#define FTM1DEADTIME_DTVAL_MASK         63
#define FTM1DEADTIME_DTVAL_BITNUM       0
#define FTM1DEADTIME_DTPS_MASK          192
#define FTM1DEADTIME_DTPS_BITNUM        6


/*** FTM1EXTTRIG - FTM1 ExternalTrigger Register; 0xFFFF80AC ***/
typedef union {
  byte Byte;
  struct {
    byte CH2TRIG     :1;                                       /* Channel 2 trigger enable */
    byte CH3TRIG     :1;                                       /* Channel 3 trigger enable */
    byte CH4TRIG     :1;                                       /* Channel 4 trigger enable */
    byte CH5TRIG     :1;                                       /* Channel 5 trigger enable */
    byte CH0TRIG     :1;                                       /* Channel 0 trigger enable */
    byte CH1TRIG     :1;                                       /* Channel 1 trigger enable */
    byte INITTRIGEN  :1;                                       /* Enables the Generation of a Trigger Signal */
    byte TRIGF       :1;                                       /* Channel trigger flag */
  } Bits;
} FTM1EXTTRIGSTR;
extern volatile FTM1EXTTRIGSTR _FTM1EXTTRIG @0xFFFF80AC;
#define FTM1EXTTRIG                     _FTM1EXTTRIG.Byte
#define FTM1EXTTRIG_CH2TRIG             _FTM1EXTTRIG.Bits.CH2TRIG
#define FTM1EXTTRIG_CH3TRIG             _FTM1EXTTRIG.Bits.CH3TRIG
#define FTM1EXTTRIG_CH4TRIG             _FTM1EXTTRIG.Bits.CH4TRIG
#define FTM1EXTTRIG_CH5TRIG             _FTM1EXTTRIG.Bits.CH5TRIG
#define FTM1EXTTRIG_CH0TRIG             _FTM1EXTTRIG.Bits.CH0TRIG
#define FTM1EXTTRIG_CH1TRIG             _FTM1EXTTRIG.Bits.CH1TRIG
#define FTM1EXTTRIG_INITTRIGEN          _FTM1EXTTRIG.Bits.INITTRIGEN
#define FTM1EXTTRIG_TRIGF               _FTM1EXTTRIG.Bits.TRIGF

