AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define FTM1EXTTRIG_CH2TRIG_MASK        1
#define FTM1EXTTRIG_CH3TRIG_MASK        2
#define FTM1EXTTRIG_CH4TRIG_MASK        4
#define FTM1EXTTRIG_CH5TRIG_MASK        8
#define FTM1EXTTRIG_CH0TRIG_MASK        16
#define FTM1EXTTRIG_CH1TRIG_MASK        32
#define FTM1EXTTRIG_INITTRIGEN_MASK     64
#define FTM1EXTTRIG_TRIGF_MASK          128


/*** FTM1POL - FTM1 Channels Polarity Register; 0xFFFF80AD ***/
typedef union {
  byte Byte;
  struct {
    byte POL0        :1;                                       /* Channel 0 Polarity */
    byte POL1        :1;                                       /* Channel 1 Polarity */
    byte POL2        :1;                                       /* Channel 2 Polarity */
    byte POL3        :1;                                       /* Channel 3 Polarity */
    byte POL4        :1;                                       /* Channel 4 Polarity */
    byte POL5        :1;                                       /* Channel 5 Polarity */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPOL  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1POLSTR;
extern volatile FTM1POLSTR _FTM1POL @0xFFFF80AD;
#define FTM1POL                         _FTM1POL.Byte
#define FTM1POL_POL0                    _FTM1POL.Bits.POL0
#define FTM1POL_POL1                    _FTM1POL.Bits.POL1
#define FTM1POL_POL2                    _FTM1POL.Bits.POL2
#define FTM1POL_POL3                    _FTM1POL.Bits.POL3
#define FTM1POL_POL4                    _FTM1POL.Bits.POL4
#define FTM1POL_POL5                    _FTM1POL.Bits.POL5
#define FTM1POL_POL                     _FTM1POL.MergedBits.grpPOL

#define FTM1POL_POL0_MASK               1
#define FTM1POL_POL1_MASK               2
#define FTM1POL_POL2_MASK               4
#define FTM1POL_POL3_MASK               8
#define FTM1POL_POL4_MASK               16
#define FTM1POL_POL5_MASK               32
#define FTM1POL_POL_MASK                63
#define FTM1POL_POL_BITNUM              0


/*** FTM1FMS - FTM1 Fault Mode Status Register; 0xFFFF80AE ***/
typedef union {
  byte Byte;
  struct {
    byte FAULTF0     :1;                                       /* Fault detection flag 0 */
    byte FAULTF1     :1;                                       /* Fault detection flag 1 */
    byte FAULTF2     :1;                                       /* Fault detection flag 2 */
    byte FAULTF3     :1;                                       /* Fault detection flag 3 */
    byte             :1; 
    byte FAULTIN     :1;                                       /* Fault Input */
    byte WPEN        :1;                                       /* Write Protected Enable */
    byte FAULTF      :1;                                       /* Fault Detection Flag */
  } Bits;
  struct {
    byte         :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1FMSSTR;
extern volatile FTM1FMSSTR _FTM1FMS @0xFFFF80AE;
#define FTM1FMS                         _FTM1FMS.Byte
#define FTM1FMS_FAULTF0                 _FTM1FMS.Bits.FAULTF0
#define FTM1FMS_FAULTF1                 _FTM1FMS.Bits.FAULTF1
#define FTM1FMS_FAULTF2                 _FTM1FMS.Bits.FAULTF2
#define FTM1FMS_FAULTF3                 _FTM1FMS.Bits.FAULTF3
#define FTM1FMS_FAULTIN                 _FTM1FMS.Bits.FAULTIN
#define FTM1FMS_WPEN                    _FTM1FMS.Bits.WPEN
#define FTM1FMS_FAULTF                  _FTM1FMS.Bits.FAULTF

#define FTM1FMS_FAULTF0_MASK            1
#define FTM1FMS_FAULTF1_MASK            2
#define FTM1FMS_FAULTF2_MASK            4
#define FTM1FMS_FAULTF3_MASK            8
#define FTM1FMS_FAULTIN_MASK            32
#define FTM1FMS_WPEN_MASK               64
#define FTM1FMS_FAULTF_MASK             128


/*** FTM1FILTER0 - FTM1 Input Capture Filter Control Register 0; 0xFFFF80AF ***/
typedef union {
  byte Byte;
  struct {
    byte CH0FVAL0    :1;                                       /* Channel 0 Input Filter Bits, bit 0 */
    byte CH0FVAL1    :1;                                       /* Channel 0 Input Filter Bits, bit 1 */
    byte CH0FVAL2    :1;                                       /* Channel 0 Input Filter Bits, bit 2 */
    byte CH0FVAL3    :1;                                       /* Channel 0 Input Filter Bits, bit 3 */
    byte CH1FVAL0    :1;                                       /* Channel 1 Input Filter Bits, bit 0 */
    byte CH1FVAL1    :1;                                       /* Channel 1 Input Filter Bits, bit 1 */
    byte CH1FVAL2    :1;                                       /* Channel 1 Input Filter Bits, bit 2 */
    byte CH1FVAL3    :1;                                       /* Channel 1 Input Filter Bits, bit 3 */
  } Bits;
  struct {
    byte grpCH0FVAL :4;
    byte grpCH1FVAL :4;
  } MergedBits;
} FTM1FILTER0STR;
extern volatile FTM1FILTER0STR _FTM1FILTER0 @0xFFFF80AF;
#define FTM1FILTER0                     _FTM1FILTER0.Byte
#define FTM1FILTER0_CH0FVAL0            _FTM1FILTER0.Bits.CH0FVAL0
#define FTM1FILTER0_CH0FVAL1            _FTM1FILTER0.Bits.CH0FVAL1
#define FTM1FILTER0_CH0FVAL2            _FTM1FILTER0.Bits.CH0FVAL2
#define FTM1FILTER0_CH0FVAL3            _FTM1FILTER0.Bits.CH0FVAL3
#define FTM1FILTER0_CH1FVAL0            _FTM1FILTER0.Bits.CH1FVAL0
#define FTM1FILTER0_CH1FVAL1            _FTM1FILTER0.Bits.CH1FVAL1
#define FTM1FILTER0_CH1FVAL2            _FTM1FILTER0.Bits.CH1FVAL2
#define FTM1FILTER0_CH1FVAL3            _FTM1FILTER0.Bits.CH1FVAL3
/* FTM1FILTER_ARR: Access 2 FTM1FILTERx registers in an array */
#define FTM1FILTER_ARR                  ((volatile byte *) &FTM1FILTER0)
#define FTM1FILTER0_CH0FVAL             _FTM1FILTER0.MergedBits.grpCH0FVAL
#define FTM1FILTER0_CH1FVAL             _FTM1FILTER0.MergedBits.grpCH1FVAL

#define FTM1FILTER0_CH0FVAL0_MASK       1
#define FTM1FILTER0_CH0FVAL1_MASK       2
#define FTM1FILTER0_CH0FVAL2_MASK       4
#define FTM1FILTER0_CH0FVAL3_MASK       8
#define FTM1FILTER0_CH1FVAL0_MASK       16
#define FTM1FILTER0_CH1FVAL1_MASK       32
#define FTM1FILTER0_CH1FVAL2_MASK       64
#define FTM1FILTER0_CH1FVAL3_MASK       128
#define FTM1FILTER0_CH0FVAL_MASK        15
#define FTM1FILTER0_CH0FVAL_BITNUM      0
#define FTM1FILTER0_CH1FVAL_MASK        240
#define FTM1FILTER0_CH1FVAL_BITNUM      4


/*** FTM1FILTER1 - FTM1 Input Capture Filter Control Register 1; 0xFFFF80B0 ***/
typedef union {
  byte Byte;
  struct {
    byte CH2FVAL0    :1;                                       /* Channel 2 Input Filter Bits, bit 0 */
    byte CH2FVAL1    :1;                                       /* Channel 2 Input Filter Bits, bit 1 */
    byte CH2FVAL2    :1;                                       /* Channel 2 Input Filter Bits, bit 2 */
    byte CH2FVAL3    :1;                                       /* Channel 2 Input Filter Bits, bit 3 */
    byte CH3FVAL0    :1;                                       /* Channel 3 Input Filter Bits, bit 0 */
    byte CH3FVAL1    :1;                                       /* Channel 3 Input Filter Bits, bit 1 */
    byte CH3FVAL2    :1;                                       /* Channel 3 Input Filter Bits, bit 2 */
    byte CH3FVAL3    :1;                                       /* Channel 3 Input Filter Bits, bit 3 */
  } Bits;
  struct {
    byte grpCH2FVAL :4;
    byte grpCH3FVAL :4;
  } MergedBits;
} FTM1FILTER1STR;
extern volatile FTM1FILTER1STR _FTM1FILTER1 @0xFFFF80B0;
#define FTM1FILTER1                     _FTM1FILTER1.Byte
#define FTM1FILTER1_CH2FVAL0            _FTM1FILTER1.Bits.CH2FVAL0
#define FTM1FILTER1_CH2FVAL1            _FTM1FILTER1.Bits.CH2FVAL1
#define FTM1FILTER1_CH2FVAL2            _FTM1FILTER1.Bits.CH2FVAL2
#define FTM1FILTER1_CH2FVAL3            _FTM1FILTER1.Bits.CH2FVAL3
#define FTM1FILTER1_CH3FVAL0            _FTM1FILTER1.Bits.CH3FVAL0
#define FTM1FILTER1_CH3FVAL1            _FTM1FILTER1.Bits.CH3FVAL1
#define FTM1FILTER1_CH3FVAL2            _FTM1FILTER1.Bits.CH3FVAL2
#define FTM1FILTER1_CH3FVAL3            _FTM1FILTER1.Bits.CH3FVAL3
#define FTM1FILTER1_CH2FVAL             _FTM1FILTER1.MergedBits.grpCH2FVAL
#define FTM1FILTER1_CH3FVAL             _FTM1FILTER1.MergedBits.grpCH3FVAL

