AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define FTM1FILTER1_CH2FVAL0_MASK       1
#define FTM1FILTER1_CH2FVAL1_MASK       2
#define FTM1FILTER1_CH2FVAL2_MASK       4
#define FTM1FILTER1_CH2FVAL3_MASK       8
#define FTM1FILTER1_CH3FVAL0_MASK       16
#define FTM1FILTER1_CH3FVAL1_MASK       32
#define FTM1FILTER1_CH3FVAL2_MASK       64
#define FTM1FILTER1_CH3FVAL3_MASK       128
#define FTM1FILTER1_CH2FVAL_MASK        15
#define FTM1FILTER1_CH2FVAL_BITNUM      0
#define FTM1FILTER1_CH3FVAL_MASK        240
#define FTM1FILTER1_CH3FVAL_BITNUM      4


/*** FTM1FLTFILTER - FTM1 Fault Input Filter Control Register; 0xFFFF80B1 ***/
typedef union {
  byte Byte;
  struct {
    byte FFVAL0      :1;                                       /* Fault Input Filter Bits, bit 0 */
    byte FFVAL1      :1;                                       /* Fault Input Filter Bits, bit 1 */
    byte FFVAL2      :1;                                       /* Fault Input Filter Bits, bit 2 */
    byte FFVAL3      :1;                                       /* Fault Input Filter Bits, bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFFVAL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM1FLTFILTERSTR;
extern volatile FTM1FLTFILTERSTR _FTM1FLTFILTER @0xFFFF80B1;
#define FTM1FLTFILTER                   _FTM1FLTFILTER.Byte
#define FTM1FLTFILTER_FFVAL0            _FTM1FLTFILTER.Bits.FFVAL0
#define FTM1FLTFILTER_FFVAL1            _FTM1FLTFILTER.Bits.FFVAL1
#define FTM1FLTFILTER_FFVAL2            _FTM1FLTFILTER.Bits.FFVAL2
#define FTM1FLTFILTER_FFVAL3            _FTM1FLTFILTER.Bits.FFVAL3
#define FTM1FLTFILTER_FFVAL             _FTM1FLTFILTER.MergedBits.grpFFVAL

#define FTM1FLTFILTER_FFVAL0_MASK       1
#define FTM1FLTFILTER_FFVAL1_MASK       2
#define FTM1FLTFILTER_FFVAL2_MASK       4
#define FTM1FLTFILTER_FFVAL3_MASK       8
#define FTM1FLTFILTER_FFVAL_MASK        15
#define FTM1FLTFILTER_FFVAL_BITNUM      0


/*** FTM1FLTCTRL - FTM1 Fault Control Register; 0xFFFF80B2 ***/
typedef union {
  byte Byte;
  struct {
    byte FAULT0EN    :1;                                       /* Fault input 0 enable */
    byte FAULT1EN    :1;                                       /* Fault input 1 enable */
    byte             :1; 
    byte             :1; 
    byte FFLTR0EN    :1;                                       /* Fault input 0 filter enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} FTM1FLTCTRLSTR;
extern volatile FTM1FLTCTRLSTR _FTM1FLTCTRL @0xFFFF80B2;
#define FTM1FLTCTRL                     _FTM1FLTCTRL.Byte
#define FTM1FLTCTRL_FAULT0EN            _FTM1FLTCTRL.Bits.FAULT0EN
#define FTM1FLTCTRL_FAULT1EN            _FTM1FLTCTRL.Bits.FAULT1EN
#define FTM1FLTCTRL_FFLTR0EN            _FTM1FLTCTRL.Bits.FFLTR0EN

#define FTM1FLTCTRL_FAULT0EN_MASK       1
#define FTM1FLTCTRL_FAULT1EN_MASK       2
#define FTM1FLTCTRL_FFLTR0EN_MASK       16


/*** FTM2SC - FTM2 Status and Control Register; 0xFFFF80C0 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Divisor Select Bit 0 */
    byte PS1         :1;                                       /* Prescale Divisor Select Bit 1 */
    byte PS2         :1;                                       /* Prescale Divisor Select Bit 2 */
    byte CLKSA       :1;                                       /* Clock Source Select A */
    byte CLKSB       :1;                                       /* Clock Source Select B */
    byte CPWMS       :1;                                       /* Center-Aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte grpCLKSx :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2SCSTR;
extern volatile FTM2SCSTR _FTM2SC @0xFFFF80C0;
#define FTM2SC                          _FTM2SC.Byte
#define FTM2SC_PS0                      _FTM2SC.Bits.PS0
#define FTM2SC_PS1                      _FTM2SC.Bits.PS1
#define FTM2SC_PS2                      _FTM2SC.Bits.PS2
#define FTM2SC_CLKSA                    _FTM2SC.Bits.CLKSA
#define FTM2SC_CLKSB                    _FTM2SC.Bits.CLKSB
#define FTM2SC_CPWMS                    _FTM2SC.Bits.CPWMS
#define FTM2SC_TOIE                     _FTM2SC.Bits.TOIE
#define FTM2SC_TOF                      _FTM2SC.Bits.TOF
#define FTM2SC_PS                       _FTM2SC.MergedBits.grpPS
#define FTM2SC_CLKSx                    _FTM2SC.MergedBits.grpCLKSx

#define FTM2SC_PS0_MASK                 1
#define FTM2SC_PS1_MASK                 2
#define FTM2SC_PS2_MASK                 4
#define FTM2SC_CLKSA_MASK               8
#define FTM2SC_CLKSB_MASK               16
#define FTM2SC_CPWMS_MASK               32
#define FTM2SC_TOIE_MASK                64
#define FTM2SC_TOF_MASK                 128
#define FTM2SC_PS_MASK                  7
#define FTM2SC_PS_BITNUM                0
#define FTM2SC_CLKSx_MASK               24
#define FTM2SC_CLKSx_BITNUM             3


/*** FTM2CNT - FTM2 Timer Counter Register; 0xFFFF80C1 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2CNTH - FTM2 Timer Counter Register High; 0xFFFF80C1 ***/
    union {
      byte Byte;
    } FTM2CNTHSTR;
    #define FTM2CNTH                    _FTM2CNT.Overlap_STR.FTM2CNTHSTR.Byte
    

    /*** FTM2CNTL - FTM2 Timer Counter Register Low; 0xFFFF80C2 ***/
    union {
      byte Byte;
    } FTM2CNTLSTR;
    #define FTM2CNTL                    _FTM2CNT.Overlap_STR.FTM2CNTLSTR.Byte
    
  } Overlap_STR;

} FTM2CNTSTR;
extern volatile FTM2CNTSTR _FTM2CNT @0xFFFF80C1;
#define FTM2CNT                         _FTM2CNT.Word


/*** FTM2MOD - FTM2 Timer Counter Modulo Register; 0xFFFF80C3 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2MODH - FTM2 Timer Counter Modulo Register High; 0xFFFF80C3 ***/
    union {
      byte Byte;
    } FTM2MODHSTR;
    #define FTM2MODH                    _FTM2MOD.Overlap_STR.FTM2MODHSTR.Byte
    

    /*** FTM2MODL - FTM2 Timer Counter Modulo Register Low; 0xFFFF80C4 ***/
    union {
      byte Byte;
    } FTM2MODLSTR;
    #define FTM2MODL                    _FTM2MOD.Overlap_STR.FTM2MODLSTR.Byte
    
  } Overlap_STR;

} FTM2MODSTR;
