AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile FTM2C2SCSTR _FTM2C2SC @0xFFFF80CB;
#define FTM2C2SC                        _FTM2C2SC.Byte
#define FTM2C2SC_DMA                    _FTM2C2SC.Bits.DMA
#define FTM2C2SC_ELS2A                  _FTM2C2SC.Bits.ELS2A
#define FTM2C2SC_ELS2B                  _FTM2C2SC.Bits.ELS2B
#define FTM2C2SC_MS2A                   _FTM2C2SC.Bits.MS2A
#define FTM2C2SC_MS2B                   _FTM2C2SC.Bits.MS2B
#define FTM2C2SC_CH2IE                  _FTM2C2SC.Bits.CH2IE
#define FTM2C2SC_CH2F                   _FTM2C2SC.Bits.CH2F
#define FTM2C2SC_ELS2x                  _FTM2C2SC.MergedBits.grpELS2x
#define FTM2C2SC_MS2x                   _FTM2C2SC.MergedBits.grpMS2x

#define FTM2C2SC_DMA_MASK               1
#define FTM2C2SC_ELS2A_MASK             4
#define FTM2C2SC_ELS2B_MASK             8
#define FTM2C2SC_MS2A_MASK              16
#define FTM2C2SC_MS2B_MASK              32
#define FTM2C2SC_CH2IE_MASK             64
#define FTM2C2SC_CH2F_MASK              128
#define FTM2C2SC_ELS2x_MASK             12
#define FTM2C2SC_ELS2x_BITNUM           2
#define FTM2C2SC_MS2x_MASK              48
#define FTM2C2SC_MS2x_BITNUM            4


/*** FTM2C2V - FTM2 Timer Channel 2 Value Register; 0xFFFF80CC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2C2VH - FTM2 Timer Channel 2 Value Register High; 0xFFFF80CC ***/
    union {
      byte Byte;
    } FTM2C2VHSTR;
    #define FTM2C2VH                    _FTM2C2V.Overlap_STR.FTM2C2VHSTR.Byte
    

    /*** FTM2C2VL - FTM2 Timer Channel 2 Value Register Low; 0xFFFF80CD ***/
    union {
      byte Byte;
    } FTM2C2VLSTR;
    #define FTM2C2VL                    _FTM2C2V.Overlap_STR.FTM2C2VLSTR.Byte
    
  } Overlap_STR;

} FTM2C2VSTR;
extern volatile FTM2C2VSTR _FTM2C2V @0xFFFF80CC;
#define FTM2C2V                         _FTM2C2V.Word


/*** FTM2C3SC - FTM2 Timer Channel 3 Status and Control Register; 0xFFFF80CE ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH3F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS3A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS3B       :1;                                       /* Edge/Level Select Bit B */
    byte MS3A        :1;                                       /* Mode Select A for FTM2 Channel 3 */
    byte MS3B        :1;                                       /* Mode Select B for FTM2 Channel 3 */
    byte CH3IE       :1;                                       /* Channel 3 Interrupt Enable */
    byte CH3F        :1;                                       /* Channel 3 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS3x :2;
    byte grpMS3x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2C3SCSTR;
extern volatile FTM2C3SCSTR _FTM2C3SC @0xFFFF80CE;
#define FTM2C3SC                        _FTM2C3SC.Byte
#define FTM2C3SC_DMA                    _FTM2C3SC.Bits.DMA
#define FTM2C3SC_ELS3A                  _FTM2C3SC.Bits.ELS3A
#define FTM2C3SC_ELS3B                  _FTM2C3SC.Bits.ELS3B
#define FTM2C3SC_MS3A                   _FTM2C3SC.Bits.MS3A
#define FTM2C3SC_MS3B                   _FTM2C3SC.Bits.MS3B
#define FTM2C3SC_CH3IE                  _FTM2C3SC.Bits.CH3IE
#define FTM2C3SC_CH3F                   _FTM2C3SC.Bits.CH3F
#define FTM2C3SC_ELS3x                  _FTM2C3SC.MergedBits.grpELS3x
#define FTM2C3SC_MS3x                   _FTM2C3SC.MergedBits.grpMS3x

#define FTM2C3SC_DMA_MASK               1
#define FTM2C3SC_ELS3A_MASK             4
#define FTM2C3SC_ELS3B_MASK             8
#define FTM2C3SC_MS3A_MASK              16
#define FTM2C3SC_MS3B_MASK              32
#define FTM2C3SC_CH3IE_MASK             64
#define FTM2C3SC_CH3F_MASK              128
#define FTM2C3SC_ELS3x_MASK             12
#define FTM2C3SC_ELS3x_BITNUM           2
#define FTM2C3SC_MS3x_MASK              48
#define FTM2C3SC_MS3x_BITNUM            4


/*** FTM2C3V - FTM2 Timer Channel 3 Value Register; 0xFFFF80CF ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2C3VH - FTM2 Timer Channel 3 Value Register High; 0xFFFF80CF ***/
    union {
      byte Byte;
    } FTM2C3VHSTR;
    #define FTM2C3VH                    _FTM2C3V.Overlap_STR.FTM2C3VHSTR.Byte
    

    /*** FTM2C3VL - FTM2 Timer Channel 3 Value Register Low; 0xFFFF80D0 ***/
    union {
      byte Byte;
    } FTM2C3VLSTR;
    #define FTM2C3VL                    _FTM2C3V.Overlap_STR.FTM2C3VLSTR.Byte
    
  } Overlap_STR;

} FTM2C3VSTR;
extern volatile FTM2C3VSTR _FTM2C3V @0xFFFF80CF;
#define FTM2C3V                         _FTM2C3V.Word


/*** FTM2C4SC - FTM2 Timer Channel 4 Status and Control Register; 0xFFFF80D1 ***/
typedef union {
  byte Byte;
  struct {
    byte DMA         :1;                                       /* The DMA bit enables DMA requests on CH4F flag being set rather than issuing a CPU interrupt request */
    byte             :1; 
    byte ELS4A       :1;                                       /* Edge/Level Select Bit A */
    byte ELS4B       :1;                                       /* Edge/Level Select Bit B */
    byte MS4A        :1;                                       /* Mode Select A for FTM2 Channel 4 */
    byte MS4B        :1;                                       /* Mode Select B for FTM2 Channel 4 */
    byte CH4IE       :1;                                       /* Channel 4 Interrupt Enable */
    byte CH4F        :1;                                       /* Channel 4 Flag */
  } Bits;
  struct {
    byte grpDMx  :1;
    byte         :1;
    byte grpELS4x :2;
    byte grpMS4x :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2C4SCSTR;
extern volatile FTM2C4SCSTR _FTM2C4SC @0xFFFF80D1;
#define FTM2C4SC                        _FTM2C4SC.Byte
#define FTM2C4SC_DMA                    _FTM2C4SC.Bits.DMA
#define FTM2C4SC_ELS4A                  _FTM2C4SC.Bits.ELS4A
#define FTM2C4SC_ELS4B                  _FTM2C4SC.Bits.ELS4B
#define FTM2C4SC_MS4A                   _FTM2C4SC.Bits.MS4A
#define FTM2C4SC_MS4B                   _FTM2C4SC.Bits.MS4B
#define FTM2C4SC_CH4IE                  _FTM2C4SC.Bits.CH4IE
#define FTM2C4SC_CH4F                   _FTM2C4SC.Bits.CH4F
#define FTM2C4SC_ELS4x                  _FTM2C4SC.MergedBits.grpELS4x
#define FTM2C4SC_MS4x                   _FTM2C4SC.MergedBits.grpMS4x

#define FTM2C4SC_DMA_MASK               1
#define FTM2C4SC_ELS4A_MASK             4
#define FTM2C4SC_ELS4B_MASK             8
#define FTM2C4SC_MS4A_MASK              16
#define FTM2C4SC_MS4B_MASK              32
#define FTM2C4SC_CH4IE_MASK             64
#define FTM2C4SC_CH4F_MASK              128
#define FTM2C4SC_ELS4x_MASK             12
#define FTM2C4SC_ELS4x_BITNUM           2
#define FTM2C4SC_MS4x_MASK              48
#define FTM2C4SC_MS4x_BITNUM            4


/*** FTM2C4V - FTM2 Timer Channel 4 Value Register; 0xFFFF80D2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2C4VH - FTM2 Timer Channel 4 Value Register High; 0xFFFF80D2 ***/
    union {
      byte Byte;
    } FTM2C4VHSTR;
    #define FTM2C4VH                    _FTM2C4V.Overlap_STR.FTM2C4VHSTR.Byte
    

