AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    word BIT0        :1;                                       /* FTM2 Counter Initial Value Bit 0 */
    word BIT1        :1;                                       /* FTM2 Counter Initial Value Bit 1 */
    word BIT2        :1;                                       /* FTM2 Counter Initial Value Bit 2 */
    word BIT3        :1;                                       /* FTM2 Counter Initial Value Bit 3 */
    word BIT4        :1;                                       /* FTM2 Counter Initial Value Bit 4 */
    word BIT5        :1;                                       /* FTM2 Counter Initial Value Bit 5 */
    word BIT6        :1;                                       /* FTM2 Counter Initial Value Bit 6 */
    word BIT7        :1;                                       /* FTM2 Counter Initial Value Bit 7 */
    word BIT8        :1;                                       /* FTM2 Counter Initial Value Bit 8 */
    word BIT9        :1;                                       /* FTM2 Counter Initial Value Bit 9 */
    word BIT10       :1;                                       /* FTM2 Counter Initial Value Bit 10 */
    word BIT11       :1;                                       /* FTM2 Counter Initial Value Bit 11 */
    word BIT12       :1;                                       /* FTM2 Counter Initial Value Bit 12 */
    word BIT13       :1;                                       /* FTM2 Counter Initial Value Bit 13 */
    word BIT14       :1;                                       /* FTM2 Counter Initial Value Bit 14 */
    word BIT15       :1;                                       /* FTM2 Counter Initial Value Bit 15 */
  } Bits;
} FTM2CNTINSTR;
extern volatile FTM2CNTINSTR _FTM2CNTIN @0xFFFF80E0;
#define FTM2CNTIN                       _FTM2CNTIN.Word
#define FTM2CNTIN_BIT0                  _FTM2CNTIN.Bits.BIT0
#define FTM2CNTIN_BIT1                  _FTM2CNTIN.Bits.BIT1
#define FTM2CNTIN_BIT2                  _FTM2CNTIN.Bits.BIT2
#define FTM2CNTIN_BIT3                  _FTM2CNTIN.Bits.BIT3
#define FTM2CNTIN_BIT4                  _FTM2CNTIN.Bits.BIT4
#define FTM2CNTIN_BIT5                  _FTM2CNTIN.Bits.BIT5
#define FTM2CNTIN_BIT6                  _FTM2CNTIN.Bits.BIT6
#define FTM2CNTIN_BIT7                  _FTM2CNTIN.Bits.BIT7
#define FTM2CNTIN_BIT8                  _FTM2CNTIN.Bits.BIT8
#define FTM2CNTIN_BIT9                  _FTM2CNTIN.Bits.BIT9
#define FTM2CNTIN_BIT10                 _FTM2CNTIN.Bits.BIT10
#define FTM2CNTIN_BIT11                 _FTM2CNTIN.Bits.BIT11
#define FTM2CNTIN_BIT12                 _FTM2CNTIN.Bits.BIT12
#define FTM2CNTIN_BIT13                 _FTM2CNTIN.Bits.BIT13
#define FTM2CNTIN_BIT14                 _FTM2CNTIN.Bits.BIT14
#define FTM2CNTIN_BIT15                 _FTM2CNTIN.Bits.BIT15

#define FTM2CNTIN_BIT0_MASK             1
#define FTM2CNTIN_BIT1_MASK             2
#define FTM2CNTIN_BIT2_MASK             4
#define FTM2CNTIN_BIT3_MASK             8
#define FTM2CNTIN_BIT4_MASK             16
#define FTM2CNTIN_BIT5_MASK             32
#define FTM2CNTIN_BIT6_MASK             64
#define FTM2CNTIN_BIT7_MASK             128
#define FTM2CNTIN_BIT8_MASK             256
#define FTM2CNTIN_BIT9_MASK             512
#define FTM2CNTIN_BIT10_MASK            1024
#define FTM2CNTIN_BIT11_MASK            2048
#define FTM2CNTIN_BIT12_MASK            4096
#define FTM2CNTIN_BIT13_MASK            8192
#define FTM2CNTIN_BIT14_MASK            16384
#define FTM2CNTIN_BIT15_MASK            32768


/*** FTM2STATUS - FTM2 Capture and Compare Status Register; 0xFFFF80E2 ***/
typedef union {
  byte Byte;
  struct {
    byte CH0F        :1;                                       /* Channel 0 Flag */
    byte CH1F        :1;                                       /* Channel 1 Flag */
    byte CH2F        :1;                                       /* Channel 2 Flag */
    byte CH3F        :1;                                       /* Channel 3 Flag */
    byte CH4F        :1;                                       /* Channel 4 Flag */
    byte CH5F        :1;                                       /* Channel 5 Flag */
    byte             :1; 
    byte             :1; 
  } Bits;
} FTM2STATUSSTR;
extern volatile FTM2STATUSSTR _FTM2STATUS @0xFFFF80E2;
#define FTM2STATUS                      _FTM2STATUS.Byte
#define FTM2STATUS_CH0F                 _FTM2STATUS.Bits.CH0F
#define FTM2STATUS_CH1F                 _FTM2STATUS.Bits.CH1F
#define FTM2STATUS_CH2F                 _FTM2STATUS.Bits.CH2F
#define FTM2STATUS_CH3F                 _FTM2STATUS.Bits.CH3F
#define FTM2STATUS_CH4F                 _FTM2STATUS.Bits.CH4F
#define FTM2STATUS_CH5F                 _FTM2STATUS.Bits.CH5F

#define FTM2STATUS_CH0F_MASK            1
#define FTM2STATUS_CH1F_MASK            2
#define FTM2STATUS_CH2F_MASK            4
#define FTM2STATUS_CH3F_MASK            8
#define FTM2STATUS_CH4F_MASK            16
#define FTM2STATUS_CH5F_MASK            32


/*** FTM2MODE - FTM2 Features Mode Selection Register; 0xFFFF80E3 ***/
typedef union {
  byte Byte;
  struct {
    byte FTMEN       :1;                                       /* FTM2 Enable */
    byte INIT        :1;                                       /* Initialize the Channels Output */
    byte WPDIS       :1;                                       /* Write Protected Disable */
    byte PWMSYNC     :1;                                       /* PWM synchronization mode */
    byte CAPTTEST    :1;                                       /* Capture test mode enable */
    byte FAULTM0     :1;                                       /* Fault Control Mode Bits, bit 0 */
    byte FAULTM1     :1;                                       /* Fault Control Mode Bits, bit 1 */
    byte FAULTIE     :1;                                       /* Fault Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpFAULTM :2;
    byte         :1;
  } MergedBits;
} FTM2MODESTR;
extern volatile FTM2MODESTR _FTM2MODE @0xFFFF80E3;
#define FTM2MODE                        _FTM2MODE.Byte
#define FTM2MODE_FTMEN                  _FTM2MODE.Bits.FTMEN
#define FTM2MODE_INIT                   _FTM2MODE.Bits.INIT
#define FTM2MODE_WPDIS                  _FTM2MODE.Bits.WPDIS
#define FTM2MODE_PWMSYNC                _FTM2MODE.Bits.PWMSYNC
#define FTM2MODE_CAPTTEST               _FTM2MODE.Bits.CAPTTEST
#define FTM2MODE_FAULTM0                _FTM2MODE.Bits.FAULTM0
#define FTM2MODE_FAULTM1                _FTM2MODE.Bits.FAULTM1
#define FTM2MODE_FAULTIE                _FTM2MODE.Bits.FAULTIE
#define FTM2MODE_FAULTM                 _FTM2MODE.MergedBits.grpFAULTM

#define FTM2MODE_FTMEN_MASK             1
#define FTM2MODE_INIT_MASK              2
#define FTM2MODE_WPDIS_MASK             4
#define FTM2MODE_PWMSYNC_MASK           8
#define FTM2MODE_CAPTTEST_MASK          16
#define FTM2MODE_FAULTM0_MASK           32
#define FTM2MODE_FAULTM1_MASK           64
#define FTM2MODE_FAULTIE_MASK           128
#define FTM2MODE_FAULTM_MASK            96
#define FTM2MODE_FAULTM_BITNUM          5


/*** FTM2SYNC - FTM2 Synchronization Register; 0xFFFF80E4 ***/
typedef union {
  byte Byte;
  struct {
    byte CNTMIN      :1;                                       /* FTM2 Counter is Minimum */
    byte CNTMAX      :1;                                       /* FTM2 Counter is Maximum */
    byte REINIT      :1;                                       /* Reinitialization of FTM2 Counter by Synchronization */
    byte SYNCHOM     :1;                                       /* Output Mask by Synchronization */
    byte TRIG0       :1;                                       /* External Trigger Bit 0 for Synchronization */
    byte TRIG1       :1;                                       /* External Trigger Bit 1 for Synchronization */
    byte TRIG2       :1;                                       /* External Trigger Bit 2 for Synchronization */
    byte SWSYNC      :1;                                       /* Software Trigger for Synchronization */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpTRIG :3;
    byte         :1;
  } MergedBits;
} FTM2SYNCSTR;
extern volatile FTM2SYNCSTR _FTM2SYNC @0xFFFF80E4;
#define FTM2SYNC                        _FTM2SYNC.Byte
#define FTM2SYNC_CNTMIN                 _FTM2SYNC.Bits.CNTMIN
#define FTM2SYNC_CNTMAX                 _FTM2SYNC.Bits.CNTMAX
#define FTM2SYNC_REINIT                 _FTM2SYNC.Bits.REINIT
#define FTM2SYNC_SYNCHOM                _FTM2SYNC.Bits.SYNCHOM
#define FTM2SYNC_TRIG0                  _FTM2SYNC.Bits.TRIG0
#define FTM2SYNC_TRIG1                  _FTM2SYNC.Bits.TRIG1
#define FTM2SYNC_TRIG2                  _FTM2SYNC.Bits.TRIG2
#define FTM2SYNC_SWSYNC                 _FTM2SYNC.Bits.SWSYNC
#define FTM2SYNC_TRIG                   _FTM2SYNC.MergedBits.grpTRIG

