AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** FTM2COMBINE2 - FTM2 Function For Linked Channel 2 Register; 0xFFFF80E9 ***/
typedef union {
  byte Byte;
  struct {
    byte COMBINE     :1;                                       /* Enables the Combine of the Channels 4 and 5 */
    byte COMP        :1;                                       /* Complementary of Channel 4 */
    byte             :1; 
    byte             :1; 
    byte DTEN        :1;                                       /* Deadtime Enable */
    byte SYNCEN      :1;                                       /* Synchronization Enable */
    byte FAULTEN     :1;                                       /* Fault Control Enable */
    byte             :1; 
  } Bits;
} FTM2COMBINE2STR;
extern volatile FTM2COMBINE2STR _FTM2COMBINE2 @0xFFFF80E9;
#define FTM2COMBINE2                    _FTM2COMBINE2.Byte
#define FTM2COMBINE2_COMBINE            _FTM2COMBINE2.Bits.COMBINE
#define FTM2COMBINE2_COMP               _FTM2COMBINE2.Bits.COMP
#define FTM2COMBINE2_DTEN               _FTM2COMBINE2.Bits.DTEN
#define FTM2COMBINE2_SYNCEN             _FTM2COMBINE2.Bits.SYNCEN
#define FTM2COMBINE2_FAULTEN            _FTM2COMBINE2.Bits.FAULTEN

#define FTM2COMBINE2_COMBINE_MASK       1
#define FTM2COMBINE2_COMP_MASK          2
#define FTM2COMBINE2_DTEN_MASK          16
#define FTM2COMBINE2_SYNCEN_MASK        32
#define FTM2COMBINE2_FAULTEN_MASK       64


/*** FTM2DEADTIME - FTM2 Deadtime Insertion Control Register; 0xFFFF80EB ***/
typedef union {
  byte Byte;
  struct {
    byte DTVAL0      :1;                                       /* Deadtime Value Bits, bit 0 */
    byte DTVAL1      :1;                                       /* Deadtime Value Bits, bit 1 */
    byte DTVAL2      :1;                                       /* Deadtime Value Bits, bit 2 */
    byte DTVAL3      :1;                                       /* Deadtime Value Bits, bit 3 */
    byte DTVAL4      :1;                                       /* Deadtime Value Bits, bit 4 */
    byte DTVAL5      :1;                                       /* Deadtime Value Bits, bit 5 */
    byte DTPS0       :1;                                       /* Deadtime Prescaler Value Bits, bit 0 */
    byte DTPS1       :1;                                       /* Deadtime Prescaler Value Bits, bit 1 */
  } Bits;
  struct {
    byte grpDTVAL :6;
    byte grpDTPS :2;
  } MergedBits;
} FTM2DEADTIMESTR;
extern volatile FTM2DEADTIMESTR _FTM2DEADTIME @0xFFFF80EB;
#define FTM2DEADTIME                    _FTM2DEADTIME.Byte
#define FTM2DEADTIME_DTVAL0             _FTM2DEADTIME.Bits.DTVAL0
#define FTM2DEADTIME_DTVAL1             _FTM2DEADTIME.Bits.DTVAL1
#define FTM2DEADTIME_DTVAL2             _FTM2DEADTIME.Bits.DTVAL2
#define FTM2DEADTIME_DTVAL3             _FTM2DEADTIME.Bits.DTVAL3
#define FTM2DEADTIME_DTVAL4             _FTM2DEADTIME.Bits.DTVAL4
#define FTM2DEADTIME_DTVAL5             _FTM2DEADTIME.Bits.DTVAL5
#define FTM2DEADTIME_DTPS0              _FTM2DEADTIME.Bits.DTPS0
#define FTM2DEADTIME_DTPS1              _FTM2DEADTIME.Bits.DTPS1
#define FTM2DEADTIME_DTVAL              _FTM2DEADTIME.MergedBits.grpDTVAL
#define FTM2DEADTIME_DTPS               _FTM2DEADTIME.MergedBits.grpDTPS

#define FTM2DEADTIME_DTVAL0_MASK        1
#define FTM2DEADTIME_DTVAL1_MASK        2
#define FTM2DEADTIME_DTVAL2_MASK        4
#define FTM2DEADTIME_DTVAL3_MASK        8
#define FTM2DEADTIME_DTVAL4_MASK        16
#define FTM2DEADTIME_DTVAL5_MASK        32
#define FTM2DEADTIME_DTPS0_MASK         64
#define FTM2DEADTIME_DTPS1_MASK         128
#define FTM2DEADTIME_DTVAL_MASK         63
#define FTM2DEADTIME_DTVAL_BITNUM       0
#define FTM2DEADTIME_DTPS_MASK          192
#define FTM2DEADTIME_DTPS_BITNUM        6


/*** FTM2EXTTRIG - FTM2 ExternalTrigger Register; 0xFFFF80EC ***/
typedef union {
  byte Byte;
  struct {
    byte CH2TRIG     :1;                                       /* Channel 2 trigger enable */
    byte CH3TRIG     :1;                                       /* Channel 3 trigger enable */
    byte CH4TRIG     :1;                                       /* Channel 4 trigger enable */
    byte CH5TRIG     :1;                                       /* Channel 5 trigger enable */
    byte CH0TRIG     :1;                                       /* Channel 0 trigger enable */
    byte CH1TRIG     :1;                                       /* Channel 1 trigger enable */
    byte INITTRIGEN  :1;                                       /* Enables the Generation of a Trigger Signal */
    byte TRIGF       :1;                                       /* Channel trigger flag */
  } Bits;
} FTM2EXTTRIGSTR;
extern volatile FTM2EXTTRIGSTR _FTM2EXTTRIG @0xFFFF80EC;
#define FTM2EXTTRIG                     _FTM2EXTTRIG.Byte
#define FTM2EXTTRIG_CH2TRIG             _FTM2EXTTRIG.Bits.CH2TRIG
#define FTM2EXTTRIG_CH3TRIG             _FTM2EXTTRIG.Bits.CH3TRIG
#define FTM2EXTTRIG_CH4TRIG             _FTM2EXTTRIG.Bits.CH4TRIG
#define FTM2EXTTRIG_CH5TRIG             _FTM2EXTTRIG.Bits.CH5TRIG
#define FTM2EXTTRIG_CH0TRIG             _FTM2EXTTRIG.Bits.CH0TRIG
#define FTM2EXTTRIG_CH1TRIG             _FTM2EXTTRIG.Bits.CH1TRIG
#define FTM2EXTTRIG_INITTRIGEN          _FTM2EXTTRIG.Bits.INITTRIGEN
#define FTM2EXTTRIG_TRIGF               _FTM2EXTTRIG.Bits.TRIGF

#define FTM2EXTTRIG_CH2TRIG_MASK        1
#define FTM2EXTTRIG_CH3TRIG_MASK        2
#define FTM2EXTTRIG_CH4TRIG_MASK        4
#define FTM2EXTTRIG_CH5TRIG_MASK        8
#define FTM2EXTTRIG_CH0TRIG_MASK        16
#define FTM2EXTTRIG_CH1TRIG_MASK        32
#define FTM2EXTTRIG_INITTRIGEN_MASK     64
#define FTM2EXTTRIG_TRIGF_MASK          128


/*** FTM2POL - FTM2 Channels Polarity Register; 0xFFFF80ED ***/
typedef union {
  byte Byte;
  struct {
    byte POL0        :1;                                       /* Channel 0 Polarity */
    byte POL1        :1;                                       /* Channel 1 Polarity */
    byte POL2        :1;                                       /* Channel 2 Polarity */
    byte POL3        :1;                                       /* Channel 3 Polarity */
    byte POL4        :1;                                       /* Channel 4 Polarity */
    byte POL5        :1;                                       /* Channel 5 Polarity */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPOL  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2POLSTR;
extern volatile FTM2POLSTR _FTM2POL @0xFFFF80ED;
#define FTM2POL                         _FTM2POL.Byte
#define FTM2POL_POL0                    _FTM2POL.Bits.POL0
#define FTM2POL_POL1                    _FTM2POL.Bits.POL1
#define FTM2POL_POL2                    _FTM2POL.Bits.POL2
#define FTM2POL_POL3                    _FTM2POL.Bits.POL3
#define FTM2POL_POL4                    _FTM2POL.Bits.POL4
#define FTM2POL_POL5                    _FTM2POL.Bits.POL5
#define FTM2POL_POL                     _FTM2POL.MergedBits.grpPOL

#define FTM2POL_POL0_MASK               1
#define FTM2POL_POL1_MASK               2
#define FTM2POL_POL2_MASK               4
#define FTM2POL_POL3_MASK               8
#define FTM2POL_POL4_MASK               16
#define FTM2POL_POL5_MASK               32
#define FTM2POL_POL_MASK                63
#define FTM2POL_POL_BITNUM              0


