AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define FTM2FILTER1_CH2FVAL0_MASK       1
#define FTM2FILTER1_CH2FVAL1_MASK       2
#define FTM2FILTER1_CH2FVAL2_MASK       4
#define FTM2FILTER1_CH2FVAL3_MASK       8
#define FTM2FILTER1_CH3FVAL0_MASK       16
#define FTM2FILTER1_CH3FVAL1_MASK       32
#define FTM2FILTER1_CH3FVAL2_MASK       64
#define FTM2FILTER1_CH3FVAL3_MASK       128
#define FTM2FILTER1_CH2FVAL_MASK        15
#define FTM2FILTER1_CH2FVAL_BITNUM      0
#define FTM2FILTER1_CH3FVAL_MASK        240
#define FTM2FILTER1_CH3FVAL_BITNUM      4


/*** FTM2FLTFILTER - FTM2 Fault Input Filter Control Register; 0xFFFF80F1 ***/
typedef union {
  byte Byte;
  struct {
    byte FFVAL0      :1;                                       /* Fault Input Filter Bits, bit 0 */
    byte FFVAL1      :1;                                       /* Fault Input Filter Bits, bit 1 */
    byte FFVAL2      :1;                                       /* Fault Input Filter Bits, bit 2 */
    byte FFVAL3      :1;                                       /* Fault Input Filter Bits, bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpFFVAL :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2FLTFILTERSTR;
extern volatile FTM2FLTFILTERSTR _FTM2FLTFILTER @0xFFFF80F1;
#define FTM2FLTFILTER                   _FTM2FLTFILTER.Byte
#define FTM2FLTFILTER_FFVAL0            _FTM2FLTFILTER.Bits.FFVAL0
#define FTM2FLTFILTER_FFVAL1            _FTM2FLTFILTER.Bits.FFVAL1
#define FTM2FLTFILTER_FFVAL2            _FTM2FLTFILTER.Bits.FFVAL2
#define FTM2FLTFILTER_FFVAL3            _FTM2FLTFILTER.Bits.FFVAL3
#define FTM2FLTFILTER_FFVAL             _FTM2FLTFILTER.MergedBits.grpFFVAL

#define FTM2FLTFILTER_FFVAL0_MASK       1
#define FTM2FLTFILTER_FFVAL1_MASK       2
#define FTM2FLTFILTER_FFVAL2_MASK       4
#define FTM2FLTFILTER_FFVAL3_MASK       8
#define FTM2FLTFILTER_FFVAL_MASK        15
#define FTM2FLTFILTER_FFVAL_BITNUM      0


/*** FTM2FLTCTRL - FTM2 Fault Control Register; 0xFFFF80F2 ***/
typedef union {
  byte Byte;
  struct {
    byte FAULT0EN    :1;                                       /* Fault input 0 enable */
    byte FAULT1EN    :1;                                       /* Fault input 1 enable */
    byte             :1; 
    byte             :1; 
    byte FFLTR0EN    :1;                                       /* Fault input 0 filter enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} FTM2FLTCTRLSTR;
extern volatile FTM2FLTCTRLSTR _FTM2FLTCTRL @0xFFFF80F2;
#define FTM2FLTCTRL                     _FTM2FLTCTRL.Byte
#define FTM2FLTCTRL_FAULT0EN            _FTM2FLTCTRL.Bits.FAULT0EN
#define FTM2FLTCTRL_FAULT1EN            _FTM2FLTCTRL.Bits.FAULT1EN
#define FTM2FLTCTRL_FFLTR0EN            _FTM2FLTCTRL.Bits.FFLTR0EN

#define FTM2FLTCTRL_FAULT0EN_MASK       1
#define FTM2FLTCTRL_FAULT1EN_MASK       2
#define FTM2FLTCTRL_FFLTR0EN_MASK       16


/*** PTAPUE - Port A Pulling Enable Register; 0xFFFF8100 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPUE0     :1;                                       /* Internal Pulling Enable for Port A Bit 0 */
    byte PTAPUE1     :1;                                       /* Internal Pulling Enable for Port A Bit 1 */
    byte PTAPUE2     :1;                                       /* Internal Pulling Enable for Port A Bit 2 */
    byte PTAPUE3     :1;                                       /* Internal Pulling Enable for Port A Bit 3 */
    byte PTAPUE4     :1;                                       /* Internal Pulling Enable for Port A Bit 4 */
    byte PTAPUE5     :1;                                       /* Internal Pulling Enable for Port A Bit 5 */
    byte PTAPUE6     :1;                                       /* Internal Pulling Enable for Port A Bit 6 */
    byte PTAPUE7     :1;                                       /* Internal Pulling Enable for Port A Bit 7 */
  } Bits;
} PTAPUESTR;
extern volatile PTAPUESTR _PTAPUE @0xFFFF8100;
#define PTAPUE                          _PTAPUE.Byte
#define PTAPUE_PTAPUE0                  _PTAPUE.Bits.PTAPUE0
#define PTAPUE_PTAPUE1                  _PTAPUE.Bits.PTAPUE1
#define PTAPUE_PTAPUE2                  _PTAPUE.Bits.PTAPUE2
#define PTAPUE_PTAPUE3                  _PTAPUE.Bits.PTAPUE3
#define PTAPUE_PTAPUE4                  _PTAPUE.Bits.PTAPUE4
#define PTAPUE_PTAPUE5                  _PTAPUE.Bits.PTAPUE5
#define PTAPUE_PTAPUE6                  _PTAPUE.Bits.PTAPUE6
#define PTAPUE_PTAPUE7                  _PTAPUE.Bits.PTAPUE7

#define PTAPUE_PTAPUE0_MASK             1
#define PTAPUE_PTAPUE1_MASK             2
#define PTAPUE_PTAPUE2_MASK             4
#define PTAPUE_PTAPUE3_MASK             8
#define PTAPUE_PTAPUE4_MASK             16
#define PTAPUE_PTAPUE5_MASK             32
#define PTAPUE_PTAPUE6_MASK             64
#define PTAPUE_PTAPUE7_MASK             128


/*** PTAPUS - Port A Pullup/Pulldown Select Register; 0xFFFF8101 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTAPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTAPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTAPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTAPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTAPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTAPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTAPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTAPUSSTR;
extern volatile PTAPUSSTR _PTAPUS @0xFFFF8101;
#define PTAPUS                          _PTAPUS.Byte
#define PTAPUS_PTAPUS0                  _PTAPUS.Bits.PTAPUS0
#define PTAPUS_PTAPUS1                  _PTAPUS.Bits.PTAPUS1
#define PTAPUS_PTAPUS2                  _PTAPUS.Bits.PTAPUS2
#define PTAPUS_PTAPUS3                  _PTAPUS.Bits.PTAPUS3
#define PTAPUS_PTAPUS4                  _PTAPUS.Bits.PTAPUS4
#define PTAPUS_PTAPUS5                  _PTAPUS.Bits.PTAPUS5
#define PTAPUS_PTAPUS6                  _PTAPUS.Bits.PTAPUS6
#define PTAPUS_PTAPUS7                  _PTAPUS.Bits.PTAPUS7

