AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTAPUS_PTAPUS0_MASK             1
#define PTAPUS_PTAPUS1_MASK             2
#define PTAPUS_PTAPUS2_MASK             4
#define PTAPUS_PTAPUS3_MASK             8
#define PTAPUS_PTAPUS4_MASK             16
#define PTAPUS_PTAPUS5_MASK             32
#define PTAPUS_PTAPUS6_MASK             64
#define PTAPUS_PTAPUS7_MASK             128


/*** PTADS - Port A Drive Strength Selection Register; 0xFFFF8102 ***/
typedef union {
  byte Byte;
  struct {
    byte PTADS0      :1;                                       /* Output Drive Strength Selection for Port A Bit 0 */
    byte PTADS1      :1;                                       /* Output Drive Strength Selection for Port A Bit 1 */
    byte PTADS2      :1;                                       /* Output Drive Strength Selection for Port A Bit 2 */
    byte PTADS3      :1;                                       /* Output Drive Strength Selection for Port A Bit 3 */
    byte PTADS4      :1;                                       /* Output Drive Strength Selection for Port A Bit 4 */
    byte PTADS5      :1;                                       /* Output Drive Strength Selection for Port A Bit 5 */
    byte PTADS6      :1;                                       /* Output Drive Strength Selection for Port A Bit 6 */
    byte PTADS7      :1;                                       /* Output Drive Strength Selection for Port A Bit 7 */
  } Bits;
} PTADSSTR;
extern volatile PTADSSTR _PTADS @0xFFFF8102;
#define PTADS                           _PTADS.Byte
#define PTADS_PTADS0                    _PTADS.Bits.PTADS0
#define PTADS_PTADS1                    _PTADS.Bits.PTADS1
#define PTADS_PTADS2                    _PTADS.Bits.PTADS2
#define PTADS_PTADS3                    _PTADS.Bits.PTADS3
#define PTADS_PTADS4                    _PTADS.Bits.PTADS4
#define PTADS_PTADS5                    _PTADS.Bits.PTADS5
#define PTADS_PTADS6                    _PTADS.Bits.PTADS6
#define PTADS_PTADS7                    _PTADS.Bits.PTADS7

#define PTADS_PTADS0_MASK               1
#define PTADS_PTADS1_MASK               2
#define PTADS_PTADS2_MASK               4
#define PTADS_PTADS3_MASK               8
#define PTADS_PTADS4_MASK               16
#define PTADS_PTADS5_MASK               32
#define PTADS_PTADS6_MASK               64
#define PTADS_PTADS7_MASK               128


/*** PTASRE - Port A Slew Rate Enable Register; 0xFFFF8103 ***/
typedef union {
  byte Byte;
  struct {
    byte PTASRE0     :1;                                       /* Output Slew Rate Enable for Port A Bit 0 */
    byte PTASRE1     :1;                                       /* Output Slew Rate Enable for Port A Bit 1 */
    byte PTASRE2     :1;                                       /* Output Slew Rate Enable for Port A Bit 2 */
    byte PTASRE3     :1;                                       /* Output Slew Rate Enable for Port A Bit 3 */
    byte PTASRE4     :1;                                       /* Output Slew Rate Enable for Port A Bit 4 */
    byte PTASRE5     :1;                                       /* Output Slew Rate Enable for Port A Bit 5 */
    byte PTASRE6     :1;                                       /* Output Slew Rate Enable for Port A Bit 6 */
    byte PTASRE7     :1;                                       /* Output Slew Rate Enable for Port A Bit 7 */
  } Bits;
} PTASRESTR;
extern volatile PTASRESTR _PTASRE @0xFFFF8103;
#define PTASRE                          _PTASRE.Byte
#define PTASRE_PTASRE0                  _PTASRE.Bits.PTASRE0
#define PTASRE_PTASRE1                  _PTASRE.Bits.PTASRE1
#define PTASRE_PTASRE2                  _PTASRE.Bits.PTASRE2
#define PTASRE_PTASRE3                  _PTASRE.Bits.PTASRE3
#define PTASRE_PTASRE4                  _PTASRE.Bits.PTASRE4
#define PTASRE_PTASRE5                  _PTASRE.Bits.PTASRE5
#define PTASRE_PTASRE6                  _PTASRE.Bits.PTASRE6
#define PTASRE_PTASRE7                  _PTASRE.Bits.PTASRE7

#define PTASRE_PTASRE0_MASK             1
#define PTASRE_PTASRE1_MASK             2
#define PTASRE_PTASRE2_MASK             4
#define PTASRE_PTASRE3_MASK             8
#define PTASRE_PTASRE4_MASK             16
#define PTASRE_PTASRE5_MASK             32
#define PTASRE_PTASRE6_MASK             64
#define PTASRE_PTASRE7_MASK             128


/*** PTAPFE - Port A Passive Filter Enable Register; 0xFFFF8104 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTAPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTAPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTAPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTAPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTAPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTAPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTAPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTAPFESTR;
extern volatile PTAPFESTR _PTAPFE @0xFFFF8104;
#define PTAPFE                          _PTAPFE.Byte
#define PTAPFE_PTAPFE0                  _PTAPFE.Bits.PTAPFE0
#define PTAPFE_PTAPFE1                  _PTAPFE.Bits.PTAPFE1
#define PTAPFE_PTAPFE2                  _PTAPFE.Bits.PTAPFE2
#define PTAPFE_PTAPFE3                  _PTAPFE.Bits.PTAPFE3
#define PTAPFE_PTAPFE4                  _PTAPFE.Bits.PTAPFE4
#define PTAPFE_PTAPFE5                  _PTAPFE.Bits.PTAPFE5
#define PTAPFE_PTAPFE6                  _PTAPFE.Bits.PTAPFE6
#define PTAPFE_PTAPFE7                  _PTAPFE.Bits.PTAPFE7

#define PTAPFE_PTAPFE0_MASK             1
#define PTAPFE_PTAPFE1_MASK             2
#define PTAPFE_PTAPFE2_MASK             4
#define PTAPFE_PTAPFE3_MASK             8
#define PTAPFE_PTAPFE4_MASK             16
#define PTAPFE_PTAPFE5_MASK             32
#define PTAPFE_PTAPFE6_MASK             64
#define PTAPFE_PTAPFE7_MASK             128


