AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTAIC - Port A Interrupt Control Register; 0xFFFF8105 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTAIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTADMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTAICSTR;
extern volatile PTAICSTR _PTAIC @0xFFFF8105;
#define PTAIC                           _PTAIC.Byte
#define PTAIC_PTAMOD                    _PTAIC.Bits.PTAMOD
#define PTAIC_PTAIE                     _PTAIC.Bits.PTAIE
#define PTAIC_PTADMAEN                  _PTAIC.Bits.PTADMAEN

#define PTAIC_PTAMOD_MASK               1
#define PTAIC_PTAIE_MASK                2
#define PTAIC_PTADMAEN_MASK             128


/*** PTAIPE - Port A Interrupt Pin Enable Register; 0xFFFF8106 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTAIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTAIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTAIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTAIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTAIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTAIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTAIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTAIPESTR;
extern volatile PTAIPESTR _PTAIPE @0xFFFF8106;
#define PTAIPE                          _PTAIPE.Byte
#define PTAIPE_PTAIPE0                  _PTAIPE.Bits.PTAIPE0
#define PTAIPE_PTAIPE1                  _PTAIPE.Bits.PTAIPE1
#define PTAIPE_PTAIPE2                  _PTAIPE.Bits.PTAIPE2
#define PTAIPE_PTAIPE3                  _PTAIPE.Bits.PTAIPE3
#define PTAIPE_PTAIPE4                  _PTAIPE.Bits.PTAIPE4
#define PTAIPE_PTAIPE5                  _PTAIPE.Bits.PTAIPE5
#define PTAIPE_PTAIPE6                  _PTAIPE.Bits.PTAIPE6
#define PTAIPE_PTAIPE7                  _PTAIPE.Bits.PTAIPE7

#define PTAIPE_PTAIPE0_MASK             1
#define PTAIPE_PTAIPE1_MASK             2
#define PTAIPE_PTAIPE2_MASK             4
#define PTAIPE_PTAIPE3_MASK             8
#define PTAIPE_PTAIPE4_MASK             16
#define PTAIPE_PTAIPE5_MASK             32
#define PTAIPE_PTAIPE6_MASK             64
#define PTAIPE_PTAIPE7_MASK             128


/*** PTAIF - Port A Interrupt Flag Register; 0xFFFF8107 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTAIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTAIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTAIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTAIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTAIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTAIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTAIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTAIFSTR;
extern volatile PTAIFSTR _PTAIF @0xFFFF8107;
#define PTAIF                           _PTAIF.Byte
#define PTAIF_PTAIF0                    _PTAIF.Bits.PTAIF0
#define PTAIF_PTAIF1                    _PTAIF.Bits.PTAIF1
#define PTAIF_PTAIF2                    _PTAIF.Bits.PTAIF2
#define PTAIF_PTAIF3                    _PTAIF.Bits.PTAIF3
#define PTAIF_PTAIF4                    _PTAIF.Bits.PTAIF4
#define PTAIF_PTAIF5                    _PTAIF.Bits.PTAIF5
#define PTAIF_PTAIF6                    _PTAIF.Bits.PTAIF6
#define PTAIF_PTAIF7                    _PTAIF.Bits.PTAIF7

#define PTAIF_PTAIF0_MASK               1
#define PTAIF_PTAIF1_MASK               2
#define PTAIF_PTAIF2_MASK               4
#define PTAIF_PTAIF3_MASK               8
#define PTAIF_PTAIF4_MASK               16
#define PTAIF_PTAIF5_MASK               32
#define PTAIF_PTAIF6_MASK               64
#define PTAIF_PTAIF7_MASK               128


/*** PTAIES - Port A Interrupt Edge Select Register; 0xFFFF8108 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTAEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTAEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTAEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTAEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTAEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTAEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTAEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTAIESSTR;
extern volatile PTAIESSTR _PTAIES @0xFFFF8108;
#define PTAIES                          _PTAIES.Byte
#define PTAIES_PTAEDG0                  _PTAIES.Bits.PTAEDG0
#define PTAIES_PTAEDG1                  _PTAIES.Bits.PTAEDG1
#define PTAIES_PTAEDG2                  _PTAIES.Bits.PTAEDG2
#define PTAIES_PTAEDG3                  _PTAIES.Bits.PTAEDG3
#define PTAIES_PTAEDG4                  _PTAIES.Bits.PTAEDG4
#define PTAIES_PTAEDG5                  _PTAIES.Bits.PTAEDG5
#define PTAIES_PTAEDG6                  _PTAIES.Bits.PTAEDG6
#define PTAIES_PTAEDG7                  _PTAIES.Bits.PTAEDG7

#define PTAIES_PTAEDG0_MASK             1
#define PTAIES_PTAEDG1_MASK             2
#define PTAIES_PTAEDG2_MASK             4
#define PTAIES_PTAEDG3_MASK             8
#define PTAIES_PTAEDG4_MASK             16
#define PTAIES_PTAEDG5_MASK             32
#define PTAIES_PTAEDG6_MASK             64
#define PTAIES_PTAEDG7_MASK             128


/*** PTADFE - Port A Digital Filter Enable Register; 0xFFFF8109 ***/
typedef union {
  byte Byte;
  struct {
    byte PTADFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTADFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTADFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTADFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTADFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTADFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTADFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTADFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTADFESTR;
extern volatile PTADFESTR _PTADFE @0xFFFF8109;
#define PTADFE                          _PTADFE.Byte
#define PTADFE_PTADFE0                  _PTADFE.Bits.PTADFE0
#define PTADFE_PTADFE1                  _PTADFE.Bits.PTADFE1
#define PTADFE_PTADFE2                  _PTADFE.Bits.PTADFE2
#define PTADFE_PTADFE3                  _PTADFE.Bits.PTADFE3
#define PTADFE_PTADFE4                  _PTADFE.Bits.PTADFE4
#define PTADFE_PTADFE5                  _PTADFE.Bits.PTADFE5
#define PTADFE_PTADFE6                  _PTADFE.Bits.PTADFE6
#define PTADFE_PTADFE7                  _PTADFE.Bits.PTADFE7

#define PTADFE_PTADFE0_MASK             1
#define PTADFE_PTADFE1_MASK             2
#define PTADFE_PTADFE2_MASK             4
#define PTADFE_PTADFE3_MASK             8
#define PTADFE_PTADFE4_MASK             16
#define PTADFE_PTADFE5_MASK             32
#define PTADFE_PTADFE6_MASK             64
#define PTADFE_PTADFE7_MASK             128


/*** PTADFC - Port A Digital Filter Control Register; 0xFFFF810A ***/
typedef union {
  byte Byte;
  struct {
    byte PTAFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTAFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTAFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTAFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTAFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTACLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTAFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTADFCSTR;
extern volatile PTADFCSTR _PTADFC @0xFFFF810A;
#define PTADFC                          _PTADFC.Byte
#define PTADFC_PTAFF0                   _PTADFC.Bits.PTAFF0
#define PTADFC_PTAFF1                   _PTADFC.Bits.PTAFF1
#define PTADFC_PTAFF2                   _PTADFC.Bits.PTAFF2
#define PTADFC_PTAFF3                   _PTADFC.Bits.PTAFF3
#define PTADFC_PTAFF4                   _PTADFC.Bits.PTAFF4
#define PTADFC_PTACLKS                  _PTADFC.Bits.PTACLKS
#define PTADFC_PTAFF                    _PTADFC.MergedBits.grpPTAFF

#define PTADFC_PTAFF0_MASK              1
#define PTADFC_PTAFF1_MASK              2
#define PTADFC_PTAFF2_MASK              4
#define PTADFC_PTAFF3_MASK              8
#define PTADFC_PTAFF4_MASK              16
#define PTADFC_PTACLKS_MASK             128
#define PTADFC_PTAFF_MASK               31
#define PTADFC_PTAFF_BITNUM             0


/*** PTBPUE - Port B Pulling Enable Register; 0xFFFF8110 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPUE0     :1;                                       /* Internal Pulling Enable for Port B Bit 0 */
    byte PTBPUE1     :1;                                       /* Internal Pulling Enable for Port B Bit 1 */
    byte PTBPUE2     :1;                                       /* Internal Pulling Enable for Port B Bit 2 */
    byte PTBPUE3     :1;                                       /* Internal Pulling Enable for Port B Bit 3 */
    byte PTBPUE4     :1;                                       /* Internal Pulling Enable for Port B Bit 4 */
    byte PTBPUE5     :1;                                       /* Internal Pulling Enable for Port B Bit 5 */
    byte PTBPUE6     :1;                                       /* Internal Pulling Enable for Port B Bit 6 */
    byte PTBPUE7     :1;                                       /* Internal Pulling Enable for Port B Bit 7 */
  } Bits;
} PTBPUESTR;
extern volatile PTBPUESTR _PTBPUE @0xFFFF8110;
#define PTBPUE                          _PTBPUE.Byte
#define PTBPUE_PTBPUE0                  _PTBPUE.Bits.PTBPUE0
#define PTBPUE_PTBPUE1                  _PTBPUE.Bits.PTBPUE1
#define PTBPUE_PTBPUE2                  _PTBPUE.Bits.PTBPUE2
#define PTBPUE_PTBPUE3                  _PTBPUE.Bits.PTBPUE3
#define PTBPUE_PTBPUE4                  _PTBPUE.Bits.PTBPUE4
#define PTBPUE_PTBPUE5                  _PTBPUE.Bits.PTBPUE5
#define PTBPUE_PTBPUE6                  _PTBPUE.Bits.PTBPUE6
#define PTBPUE_PTBPUE7                  _PTBPUE.Bits.PTBPUE7

#define PTBPUE_PTBPUE0_MASK             1
#define PTBPUE_PTBPUE1_MASK             2
#define PTBPUE_PTBPUE2_MASK             4
#define PTBPUE_PTBPUE3_MASK             8
#define PTBPUE_PTBPUE4_MASK             16
#define PTBPUE_PTBPUE5_MASK             32
#define PTBPUE_PTBPUE6_MASK             64
#define PTBPUE_PTBPUE7_MASK             128


/*** PTBPUS - Port B Pullup/Pulldown Select Register; 0xFFFF8111 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTBPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTBPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTBPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTBPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTBPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTBPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTBPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTBPUSSTR;
extern volatile PTBPUSSTR _PTBPUS @0xFFFF8111;
#define PTBPUS                          _PTBPUS.Byte
#define PTBPUS_PTBPUS0                  _PTBPUS.Bits.PTBPUS0
#define PTBPUS_PTBPUS1                  _PTBPUS.Bits.PTBPUS1
#define PTBPUS_PTBPUS2                  _PTBPUS.Bits.PTBPUS2
#define PTBPUS_PTBPUS3                  _PTBPUS.Bits.PTBPUS3
#define PTBPUS_PTBPUS4                  _PTBPUS.Bits.PTBPUS4
#define PTBPUS_PTBPUS5                  _PTBPUS.Bits.PTBPUS5
#define PTBPUS_PTBPUS6                  _PTBPUS.Bits.PTBPUS6
#define PTBPUS_PTBPUS7                  _PTBPUS.Bits.PTBPUS7

#define PTBPUS_PTBPUS0_MASK             1
#define PTBPUS_PTBPUS1_MASK             2
#define PTBPUS_PTBPUS2_MASK             4
#define PTBPUS_PTBPUS3_MASK             8
#define PTBPUS_PTBPUS4_MASK             16
#define PTBPUS_PTBPUS5_MASK             32
#define PTBPUS_PTBPUS6_MASK             64
#define PTBPUS_PTBPUS7_MASK             128


/*** PTBDS - Port B Drive Strength Selection Register; 0xFFFF8112 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBDS0      :1;                                       /* Output Drive Strength Selection for Port B Bit 0 */
    byte PTBDS1      :1;                                       /* Output Drive Strength Selection for Port B Bit 1 */
    byte PTBDS2      :1;                                       /* Output Drive Strength Selection for Port B Bit 2 */
    byte PTBDS3      :1;                                       /* Output Drive Strength Selection for Port B Bit 3 */
    byte PTBDS4      :1;                                       /* Output Drive Strength Selection for Port B Bit 4 */
    byte PTBDS5      :1;                                       /* Output Drive Strength Selection for Port B Bit 5 */
    byte PTBDS6      :1;                                       /* Output Drive Strength Selection for Port B Bit 6 */
    byte PTBDS7      :1;                                       /* Output Drive Strength Selection for Port B Bit 7 */
  } Bits;
} PTBDSSTR;
extern volatile PTBDSSTR _PTBDS @0xFFFF8112;
#define PTBDS                           _PTBDS.Byte
#define PTBDS_PTBDS0                    _PTBDS.Bits.PTBDS0
#define PTBDS_PTBDS1                    _PTBDS.Bits.PTBDS1
#define PTBDS_PTBDS2                    _PTBDS.Bits.PTBDS2
#define PTBDS_PTBDS3                    _PTBDS.Bits.PTBDS3
#define PTBDS_PTBDS4                    _PTBDS.Bits.PTBDS4
#define PTBDS_PTBDS5                    _PTBDS.Bits.PTBDS5
#define PTBDS_PTBDS6                    _PTBDS.Bits.PTBDS6
#define PTBDS_PTBDS7                    _PTBDS.Bits.PTBDS7

#define PTBDS_PTBDS0_MASK               1
#define PTBDS_PTBDS1_MASK               2
#define PTBDS_PTBDS2_MASK               4
#define PTBDS_PTBDS3_MASK               8
#define PTBDS_PTBDS4_MASK               16
#define PTBDS_PTBDS5_MASK               32
#define PTBDS_PTBDS6_MASK               64
#define PTBDS_PTBDS7_MASK               128


/*** PTBSRE - Port B Slew Rate Enable Register; 0xFFFF8113 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBSRE0     :1;                                       /* Output Slew Rate Enable for Port B Bit 0 */
    byte PTBSRE1     :1;                                       /* Output Slew Rate Enable for Port B Bit 1 */
    byte PTBSRE2     :1;                                       /* Output Slew Rate Enable for Port B Bit 2 */
    byte PTBSRE3     :1;                                       /* Output Slew Rate Enable for Port B Bit 3 */
    byte PTBSRE4     :1;                                       /* Output Slew Rate Enable for Port B Bit 4 */
    byte PTBSRE5     :1;                                       /* Output Slew Rate Enable for Port B Bit 5 */
    byte PTBSRE6     :1;                                       /* Output Slew Rate Enable for Port B Bit 6 */
    byte PTBSRE7     :1;                                       /* Output Slew Rate Enable for Port B Bit 7 */
  } Bits;
} PTBSRESTR;
extern volatile PTBSRESTR _PTBSRE @0xFFFF8113;
#define PTBSRE                          _PTBSRE.Byte
#define PTBSRE_PTBSRE0                  _PTBSRE.Bits.PTBSRE0
#define PTBSRE_PTBSRE1                  _PTBSRE.Bits.PTBSRE1
#define PTBSRE_PTBSRE2                  _PTBSRE.Bits.PTBSRE2
#define PTBSRE_PTBSRE3                  _PTBSRE.Bits.PTBSRE3
#define PTBSRE_PTBSRE4                  _PTBSRE.Bits.PTBSRE4
#define PTBSRE_PTBSRE5                  _PTBSRE.Bits.PTBSRE5
#define PTBSRE_PTBSRE6                  _PTBSRE.Bits.PTBSRE6
#define PTBSRE_PTBSRE7                  _PTBSRE.Bits.PTBSRE7

#define PTBSRE_PTBSRE0_MASK             1
#define PTBSRE_PTBSRE1_MASK             2
#define PTBSRE_PTBSRE2_MASK             4
#define PTBSRE_PTBSRE3_MASK             8
#define PTBSRE_PTBSRE4_MASK             16
#define PTBSRE_PTBSRE5_MASK             32
#define PTBSRE_PTBSRE6_MASK             64
#define PTBSRE_PTBSRE7_MASK             128


/*** PTBPFE - Port B Passive Filter Enable Register; 0xFFFF8114 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTBPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTBPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTBPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTBPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTBPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTBPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTBPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTBPFESTR;
extern volatile PTBPFESTR _PTBPFE @0xFFFF8114;
#define PTBPFE                          _PTBPFE.Byte
#define PTBPFE_PTBPFE0                  _PTBPFE.Bits.PTBPFE0
#define PTBPFE_PTBPFE1                  _PTBPFE.Bits.PTBPFE1
#define PTBPFE_PTBPFE2                  _PTBPFE.Bits.PTBPFE2
#define PTBPFE_PTBPFE3                  _PTBPFE.Bits.PTBPFE3
#define PTBPFE_PTBPFE4                  _PTBPFE.Bits.PTBPFE4
#define PTBPFE_PTBPFE5                  _PTBPFE.Bits.PTBPFE5
#define PTBPFE_PTBPFE6                  _PTBPFE.Bits.PTBPFE6
#define PTBPFE_PTBPFE7                  _PTBPFE.Bits.PTBPFE7

#define PTBPFE_PTBPFE0_MASK             1
#define PTBPFE_PTBPFE1_MASK             2
#define PTBPFE_PTBPFE2_MASK             4
#define PTBPFE_PTBPFE3_MASK             8
#define PTBPFE_PTBPFE4_MASK             16
#define PTBPFE_PTBPFE5_MASK             32
#define PTBPFE_PTBPFE6_MASK             64
#define PTBPFE_PTBPFE7_MASK             128


