AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTBIC - Port B Interrupt Control Register; 0xFFFF8115 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTBIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTBDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTBICSTR;
extern volatile PTBICSTR _PTBIC @0xFFFF8115;
#define PTBIC                           _PTBIC.Byte
#define PTBIC_PTBMOD                    _PTBIC.Bits.PTBMOD
#define PTBIC_PTBIE                     _PTBIC.Bits.PTBIE
#define PTBIC_PTBDMAEN                  _PTBIC.Bits.PTBDMAEN

#define PTBIC_PTBMOD_MASK               1
#define PTBIC_PTBIE_MASK                2
#define PTBIC_PTBDMAEN_MASK             128


/*** PTBIPE - Port B Interrupt Pin Enable Register; 0xFFFF8116 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTBIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTBIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTBIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTBIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTBIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTBIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTBIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTBIPESTR;
extern volatile PTBIPESTR _PTBIPE @0xFFFF8116;
#define PTBIPE                          _PTBIPE.Byte
#define PTBIPE_PTBIPE0                  _PTBIPE.Bits.PTBIPE0
#define PTBIPE_PTBIPE1                  _PTBIPE.Bits.PTBIPE1
#define PTBIPE_PTBIPE2                  _PTBIPE.Bits.PTBIPE2
#define PTBIPE_PTBIPE3                  _PTBIPE.Bits.PTBIPE3
#define PTBIPE_PTBIPE4                  _PTBIPE.Bits.PTBIPE4
#define PTBIPE_PTBIPE5                  _PTBIPE.Bits.PTBIPE5
#define PTBIPE_PTBIPE6                  _PTBIPE.Bits.PTBIPE6
#define PTBIPE_PTBIPE7                  _PTBIPE.Bits.PTBIPE7

#define PTBIPE_PTBIPE0_MASK             1
#define PTBIPE_PTBIPE1_MASK             2
#define PTBIPE_PTBIPE2_MASK             4
#define PTBIPE_PTBIPE3_MASK             8
#define PTBIPE_PTBIPE4_MASK             16
#define PTBIPE_PTBIPE5_MASK             32
#define PTBIPE_PTBIPE6_MASK             64
#define PTBIPE_PTBIPE7_MASK             128


/*** PTBIF - Port B Interrupt Flag Register; 0xFFFF8117 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTBIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTBIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTBIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTBIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTBIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTBIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTBIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTBIFSTR;
extern volatile PTBIFSTR _PTBIF @0xFFFF8117;
#define PTBIF                           _PTBIF.Byte
#define PTBIF_PTBIF0                    _PTBIF.Bits.PTBIF0
#define PTBIF_PTBIF1                    _PTBIF.Bits.PTBIF1
#define PTBIF_PTBIF2                    _PTBIF.Bits.PTBIF2
#define PTBIF_PTBIF3                    _PTBIF.Bits.PTBIF3
#define PTBIF_PTBIF4                    _PTBIF.Bits.PTBIF4
#define PTBIF_PTBIF5                    _PTBIF.Bits.PTBIF5
#define PTBIF_PTBIF6                    _PTBIF.Bits.PTBIF6
#define PTBIF_PTBIF7                    _PTBIF.Bits.PTBIF7

#define PTBIF_PTBIF0_MASK               1
#define PTBIF_PTBIF1_MASK               2
#define PTBIF_PTBIF2_MASK               4
#define PTBIF_PTBIF3_MASK               8
#define PTBIF_PTBIF4_MASK               16
#define PTBIF_PTBIF5_MASK               32
#define PTBIF_PTBIF6_MASK               64
#define PTBIF_PTBIF7_MASK               128


/*** PTBIES - Port B Interrupt Edge Select Register; 0xFFFF8118 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTBEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTBEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTBEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTBEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTBEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTBEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTBEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTBIESSTR;
extern volatile PTBIESSTR _PTBIES @0xFFFF8118;
#define PTBIES                          _PTBIES.Byte
#define PTBIES_PTBEDG0                  _PTBIES.Bits.PTBEDG0
#define PTBIES_PTBEDG1                  _PTBIES.Bits.PTBEDG1
#define PTBIES_PTBEDG2                  _PTBIES.Bits.PTBEDG2
#define PTBIES_PTBEDG3                  _PTBIES.Bits.PTBEDG3
#define PTBIES_PTBEDG4                  _PTBIES.Bits.PTBEDG4
#define PTBIES_PTBEDG5                  _PTBIES.Bits.PTBEDG5
#define PTBIES_PTBEDG6                  _PTBIES.Bits.PTBEDG6
#define PTBIES_PTBEDG7                  _PTBIES.Bits.PTBEDG7

