AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTBIES_PTBEDG0_MASK             1
#define PTBIES_PTBEDG1_MASK             2
#define PTBIES_PTBEDG2_MASK             4
#define PTBIES_PTBEDG3_MASK             8
#define PTBIES_PTBEDG4_MASK             16
#define PTBIES_PTBEDG5_MASK             32
#define PTBIES_PTBEDG6_MASK             64
#define PTBIES_PTBEDG7_MASK             128


/*** PTBDFE - Port B Digital Filter Enable Register; 0xFFFF8119 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTBDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTBDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTBDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTBDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTBDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTBDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTBDFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTBDFESTR;
extern volatile PTBDFESTR _PTBDFE @0xFFFF8119;
#define PTBDFE                          _PTBDFE.Byte
#define PTBDFE_PTBDFE0                  _PTBDFE.Bits.PTBDFE0
#define PTBDFE_PTBDFE1                  _PTBDFE.Bits.PTBDFE1
#define PTBDFE_PTBDFE2                  _PTBDFE.Bits.PTBDFE2
#define PTBDFE_PTBDFE3                  _PTBDFE.Bits.PTBDFE3
#define PTBDFE_PTBDFE4                  _PTBDFE.Bits.PTBDFE4
#define PTBDFE_PTBDFE5                  _PTBDFE.Bits.PTBDFE5
#define PTBDFE_PTBDFE6                  _PTBDFE.Bits.PTBDFE6
#define PTBDFE_PTBDFE7                  _PTBDFE.Bits.PTBDFE7

#define PTBDFE_PTBDFE0_MASK             1
#define PTBDFE_PTBDFE1_MASK             2
#define PTBDFE_PTBDFE2_MASK             4
#define PTBDFE_PTBDFE3_MASK             8
#define PTBDFE_PTBDFE4_MASK             16
#define PTBDFE_PTBDFE5_MASK             32
#define PTBDFE_PTBDFE6_MASK             64
#define PTBDFE_PTBDFE7_MASK             128


/*** PTBDFC - Port B Digital Filter Control Register; 0xFFFF811A ***/
typedef union {
  byte Byte;
  struct {
    byte PTBFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTBFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTBFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTBFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTBFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTBCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTBFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTBDFCSTR;
extern volatile PTBDFCSTR _PTBDFC @0xFFFF811A;
#define PTBDFC                          _PTBDFC.Byte
#define PTBDFC_PTBFF0                   _PTBDFC.Bits.PTBFF0
#define PTBDFC_PTBFF1                   _PTBDFC.Bits.PTBFF1
#define PTBDFC_PTBFF2                   _PTBDFC.Bits.PTBFF2
#define PTBDFC_PTBFF3                   _PTBDFC.Bits.PTBFF3
#define PTBDFC_PTBFF4                   _PTBDFC.Bits.PTBFF4
#define PTBDFC_PTBCLKS                  _PTBDFC.Bits.PTBCLKS
#define PTBDFC_PTBFF                    _PTBDFC.MergedBits.grpPTBFF

#define PTBDFC_PTBFF0_MASK              1
#define PTBDFC_PTBFF1_MASK              2
#define PTBDFC_PTBFF2_MASK              4
#define PTBDFC_PTBFF3_MASK              8
#define PTBDFC_PTBFF4_MASK              16
#define PTBDFC_PTBCLKS_MASK             128
#define PTBDFC_PTBFF_MASK               31
#define PTBDFC_PTBFF_BITNUM             0


/*** PTCPUE - Port C Pulling Enable Register; 0xFFFF8120 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPUE0     :1;                                       /* Internal Pulling Enable for Port C Bit 0 */
    byte PTCPUE1     :1;                                       /* Internal Pulling Enable for Port C Bit 1 */
    byte PTCPUE2     :1;                                       /* Internal Pulling Enable for Port C Bit 2 */
    byte PTCPUE3     :1;                                       /* Internal Pulling Enable for Port C Bit 3 */
    byte PTCPUE4     :1;                                       /* Internal Pulling Enable for Port C Bit 4 */
    byte PTCPUE5     :1;                                       /* Internal Pulling Enable for Port C Bit 5 */
    byte PTCPUE6     :1;                                       /* Internal Pulling Enable for Port C Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCPUE :7;
    byte         :1;
  } MergedBits;
} PTCPUESTR;
extern volatile PTCPUESTR _PTCPUE @0xFFFF8120;
#define PTCPUE                          _PTCPUE.Byte
#define PTCPUE_PTCPUE0                  _PTCPUE.Bits.PTCPUE0
#define PTCPUE_PTCPUE1                  _PTCPUE.Bits.PTCPUE1
#define PTCPUE_PTCPUE2                  _PTCPUE.Bits.PTCPUE2
#define PTCPUE_PTCPUE3                  _PTCPUE.Bits.PTCPUE3
#define PTCPUE_PTCPUE4                  _PTCPUE.Bits.PTCPUE4
#define PTCPUE_PTCPUE5                  _PTCPUE.Bits.PTCPUE5
#define PTCPUE_PTCPUE6                  _PTCPUE.Bits.PTCPUE6
#define PTCPUE_PTCPUE                   _PTCPUE.MergedBits.grpPTCPUE

#define PTCPUE_PTCPUE0_MASK             1
#define PTCPUE_PTCPUE1_MASK             2
#define PTCPUE_PTCPUE2_MASK             4
#define PTCPUE_PTCPUE3_MASK             8
#define PTCPUE_PTCPUE4_MASK             16
#define PTCPUE_PTCPUE5_MASK             32
#define PTCPUE_PTCPUE6_MASK             64
#define PTCPUE_PTCPUE_MASK              127
#define PTCPUE_PTCPUE_BITNUM            0


/*** PTCPUS - Port C Pullup/Pulldown Select Register; 0xFFFF8121 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTCPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTCPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTCPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTCPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTCPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTCPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCPUS :7;
    byte         :1;
  } MergedBits;
} PTCPUSSTR;
extern volatile PTCPUSSTR _PTCPUS @0xFFFF8121;
#define PTCPUS                          _PTCPUS.Byte
#define PTCPUS_PTCPUS0                  _PTCPUS.Bits.PTCPUS0
#define PTCPUS_PTCPUS1                  _PTCPUS.Bits.PTCPUS1
#define PTCPUS_PTCPUS2                  _PTCPUS.Bits.PTCPUS2
#define PTCPUS_PTCPUS3                  _PTCPUS.Bits.PTCPUS3
#define PTCPUS_PTCPUS4                  _PTCPUS.Bits.PTCPUS4
#define PTCPUS_PTCPUS5                  _PTCPUS.Bits.PTCPUS5
#define PTCPUS_PTCPUS6                  _PTCPUS.Bits.PTCPUS6
#define PTCPUS_PTCPUS                   _PTCPUS.MergedBits.grpPTCPUS

#define PTCPUS_PTCPUS0_MASK             1
#define PTCPUS_PTCPUS1_MASK             2
#define PTCPUS_PTCPUS2_MASK             4
#define PTCPUS_PTCPUS3_MASK             8
#define PTCPUS_PTCPUS4_MASK             16
#define PTCPUS_PTCPUS5_MASK             32
#define PTCPUS_PTCPUS6_MASK             64
#define PTCPUS_PTCPUS_MASK              127
#define PTCPUS_PTCPUS_BITNUM            0


/*** PTCDS - Port C Drive Strength Selection Register; 0xFFFF8122 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCDS0      :1;                                       /* Output Drive Strength Selection for Port C Bit 0 */
    byte PTCDS1      :1;                                       /* Output Drive Strength Selection for Port C Bit 1 */
    byte PTCDS2      :1;                                       /* Output Drive Strength Selection for Port C Bit 2 */
    byte PTCDS3      :1;                                       /* Output Drive Strength Selection for Port C Bit 3 */
    byte PTCDS4      :1;                                       /* Output Drive Strength Selection for Port C Bit 4 */
    byte PTCDS5      :1;                                       /* Output Drive Strength Selection for Port C Bit 5 */
    byte PTCDS6      :1;                                       /* Output Drive Strength Selection for Port C Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCDS :7;
    byte         :1;
  } MergedBits;
} PTCDSSTR;
extern volatile PTCDSSTR _PTCDS @0xFFFF8122;
#define PTCDS                           _PTCDS.Byte
#define PTCDS_PTCDS0                    _PTCDS.Bits.PTCDS0
#define PTCDS_PTCDS1                    _PTCDS.Bits.PTCDS1
#define PTCDS_PTCDS2                    _PTCDS.Bits.PTCDS2
#define PTCDS_PTCDS3                    _PTCDS.Bits.PTCDS3
#define PTCDS_PTCDS4                    _PTCDS.Bits.PTCDS4
#define PTCDS_PTCDS5                    _PTCDS.Bits.PTCDS5
#define PTCDS_PTCDS6                    _PTCDS.Bits.PTCDS6
#define PTCDS_PTCDS                     _PTCDS.MergedBits.grpPTCDS

#define PTCDS_PTCDS0_MASK               1
#define PTCDS_PTCDS1_MASK               2
#define PTCDS_PTCDS2_MASK               4
#define PTCDS_PTCDS3_MASK               8
#define PTCDS_PTCDS4_MASK               16
#define PTCDS_PTCDS5_MASK               32
#define PTCDS_PTCDS6_MASK               64
#define PTCDS_PTCDS_MASK                127
#define PTCDS_PTCDS_BITNUM              0


/*** PTCSRE - Port C Slew Rate Enable Register; 0xFFFF8123 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCSRE0     :1;                                       /* Output Slew Rate Enable for Port C Bit 0 */
    byte PTCSRE1     :1;                                       /* Output Slew Rate Enable for Port C Bit 1 */
    byte PTCSRE2     :1;                                       /* Output Slew Rate Enable for Port C Bit 2 */
    byte PTCSRE3     :1;                                       /* Output Slew Rate Enable for Port C Bit 3 */
    byte PTCSRE4     :1;                                       /* Output Slew Rate Enable for Port C Bit 4 */
    byte PTCSRE5     :1;                                       /* Output Slew Rate Enable for Port C Bit 5 */
    byte PTCSRE6     :1;                                       /* Output Slew Rate Enable for Port C Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCSRE :7;
    byte         :1;
  } MergedBits;
} PTCSRESTR;
