AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTCSRESTR _PTCSRE @0xFFFF8123;
#define PTCSRE                          _PTCSRE.Byte
#define PTCSRE_PTCSRE0                  _PTCSRE.Bits.PTCSRE0
#define PTCSRE_PTCSRE1                  _PTCSRE.Bits.PTCSRE1
#define PTCSRE_PTCSRE2                  _PTCSRE.Bits.PTCSRE2
#define PTCSRE_PTCSRE3                  _PTCSRE.Bits.PTCSRE3
#define PTCSRE_PTCSRE4                  _PTCSRE.Bits.PTCSRE4
#define PTCSRE_PTCSRE5                  _PTCSRE.Bits.PTCSRE5
#define PTCSRE_PTCSRE6                  _PTCSRE.Bits.PTCSRE6
#define PTCSRE_PTCSRE                   _PTCSRE.MergedBits.grpPTCSRE

#define PTCSRE_PTCSRE0_MASK             1
#define PTCSRE_PTCSRE1_MASK             2
#define PTCSRE_PTCSRE2_MASK             4
#define PTCSRE_PTCSRE3_MASK             8
#define PTCSRE_PTCSRE4_MASK             16
#define PTCSRE_PTCSRE5_MASK             32
#define PTCSRE_PTCSRE6_MASK             64
#define PTCSRE_PTCSRE_MASK              127
#define PTCSRE_PTCSRE_BITNUM            0


/*** PTCPFE - Port C Passive Filter Enable Register; 0xFFFF8124 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTCPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTCPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTCPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTCPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTCPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTCPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCPFE :7;
    byte         :1;
  } MergedBits;
} PTCPFESTR;
extern volatile PTCPFESTR _PTCPFE @0xFFFF8124;
#define PTCPFE                          _PTCPFE.Byte
#define PTCPFE_PTCPFE0                  _PTCPFE.Bits.PTCPFE0
#define PTCPFE_PTCPFE1                  _PTCPFE.Bits.PTCPFE1
#define PTCPFE_PTCPFE2                  _PTCPFE.Bits.PTCPFE2
#define PTCPFE_PTCPFE3                  _PTCPFE.Bits.PTCPFE3
#define PTCPFE_PTCPFE4                  _PTCPFE.Bits.PTCPFE4
#define PTCPFE_PTCPFE5                  _PTCPFE.Bits.PTCPFE5
#define PTCPFE_PTCPFE6                  _PTCPFE.Bits.PTCPFE6
#define PTCPFE_PTCPFE                   _PTCPFE.MergedBits.grpPTCPFE

#define PTCPFE_PTCPFE0_MASK             1
#define PTCPFE_PTCPFE1_MASK             2
#define PTCPFE_PTCPFE2_MASK             4
#define PTCPFE_PTCPFE3_MASK             8
#define PTCPFE_PTCPFE4_MASK             16
#define PTCPFE_PTCPFE5_MASK             32
#define PTCPFE_PTCPFE6_MASK             64
#define PTCPFE_PTCPFE_MASK              127
#define PTCPFE_PTCPFE_BITNUM            0


/*** PTCIC - Port C Interrupt Control Register; 0xFFFF8125 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTCIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTCDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTCICSTR;
extern volatile PTCICSTR _PTCIC @0xFFFF8125;
#define PTCIC                           _PTCIC.Byte
#define PTCIC_PTCMOD                    _PTCIC.Bits.PTCMOD
#define PTCIC_PTCIE                     _PTCIC.Bits.PTCIE
#define PTCIC_PTCDMAEN                  _PTCIC.Bits.PTCDMAEN

#define PTCIC_PTCMOD_MASK               1
#define PTCIC_PTCIE_MASK                2
#define PTCIC_PTCDMAEN_MASK             128


/*** PTCIPE - Port C Interrupt Pin Enable Register; 0xFFFF8126 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTCIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTCIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTCIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTCIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTCIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTCIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCIPE :7;
    byte         :1;
  } MergedBits;
} PTCIPESTR;
extern volatile PTCIPESTR _PTCIPE @0xFFFF8126;
#define PTCIPE                          _PTCIPE.Byte
#define PTCIPE_PTCIPE0                  _PTCIPE.Bits.PTCIPE0
#define PTCIPE_PTCIPE1                  _PTCIPE.Bits.PTCIPE1
#define PTCIPE_PTCIPE2                  _PTCIPE.Bits.PTCIPE2
#define PTCIPE_PTCIPE3                  _PTCIPE.Bits.PTCIPE3
#define PTCIPE_PTCIPE4                  _PTCIPE.Bits.PTCIPE4
#define PTCIPE_PTCIPE5                  _PTCIPE.Bits.PTCIPE5
#define PTCIPE_PTCIPE6                  _PTCIPE.Bits.PTCIPE6
#define PTCIPE_PTCIPE                   _PTCIPE.MergedBits.grpPTCIPE

#define PTCIPE_PTCIPE0_MASK             1
#define PTCIPE_PTCIPE1_MASK             2
#define PTCIPE_PTCIPE2_MASK             4
#define PTCIPE_PTCIPE3_MASK             8
#define PTCIPE_PTCIPE4_MASK             16
#define PTCIPE_PTCIPE5_MASK             32
#define PTCIPE_PTCIPE6_MASK             64
#define PTCIPE_PTCIPE_MASK              127
#define PTCIPE_PTCIPE_BITNUM            0


/*** PTCIF - Port C Interrupt Flag Register; 0xFFFF8127 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTCIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTCIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTCIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTCIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTCIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTCIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCIF :7;
    byte         :1;
  } MergedBits;
} PTCIFSTR;
extern volatile PTCIFSTR _PTCIF @0xFFFF8127;
#define PTCIF                           _PTCIF.Byte
#define PTCIF_PTCIF0                    _PTCIF.Bits.PTCIF0
#define PTCIF_PTCIF1                    _PTCIF.Bits.PTCIF1
#define PTCIF_PTCIF2                    _PTCIF.Bits.PTCIF2
#define PTCIF_PTCIF3                    _PTCIF.Bits.PTCIF3
#define PTCIF_PTCIF4                    _PTCIF.Bits.PTCIF4
#define PTCIF_PTCIF5                    _PTCIF.Bits.PTCIF5
#define PTCIF_PTCIF6                    _PTCIF.Bits.PTCIF6
#define PTCIF_PTCIF                     _PTCIF.MergedBits.grpPTCIF

#define PTCIF_PTCIF0_MASK               1
#define PTCIF_PTCIF1_MASK               2
#define PTCIF_PTCIF2_MASK               4
#define PTCIF_PTCIF3_MASK               8
#define PTCIF_PTCIF4_MASK               16
#define PTCIF_PTCIF5_MASK               32
#define PTCIF_PTCIF6_MASK               64
#define PTCIF_PTCIF_MASK                127
#define PTCIF_PTCIF_BITNUM              0


/*** PTCIES - Port C Interrupt Edge Select Register; 0xFFFF8128 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTCEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTCEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTCEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTCEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTCEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTCEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCEDG :7;
    byte         :1;
  } MergedBits;
} PTCIESSTR;
extern volatile PTCIESSTR _PTCIES @0xFFFF8128;
#define PTCIES                          _PTCIES.Byte
#define PTCIES_PTCEDG0                  _PTCIES.Bits.PTCEDG0
#define PTCIES_PTCEDG1                  _PTCIES.Bits.PTCEDG1
#define PTCIES_PTCEDG2                  _PTCIES.Bits.PTCEDG2
#define PTCIES_PTCEDG3                  _PTCIES.Bits.PTCEDG3
#define PTCIES_PTCEDG4                  _PTCIES.Bits.PTCEDG4
#define PTCIES_PTCEDG5                  _PTCIES.Bits.PTCEDG5
#define PTCIES_PTCEDG6                  _PTCIES.Bits.PTCEDG6
#define PTCIES_PTCEDG                   _PTCIES.MergedBits.grpPTCEDG

#define PTCIES_PTCEDG0_MASK             1
#define PTCIES_PTCEDG1_MASK             2
#define PTCIES_PTCEDG2_MASK             4
#define PTCIES_PTCEDG3_MASK             8
#define PTCIES_PTCEDG4_MASK             16
#define PTCIES_PTCEDG5_MASK             32
#define PTCIES_PTCEDG6_MASK             64
#define PTCIES_PTCEDG_MASK              127
#define PTCIES_PTCEDG_BITNUM            0


/*** PTCDFE - Port C Digital Filter Enable Register; 0xFFFF8129 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTCDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTCDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTCDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTCDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTCDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTCDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTCDFE :7;
    byte         :1;
  } MergedBits;
} PTCDFESTR;
