AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTCDFESTR _PTCDFE @0xFFFF8129;
#define PTCDFE                          _PTCDFE.Byte
#define PTCDFE_PTCDFE0                  _PTCDFE.Bits.PTCDFE0
#define PTCDFE_PTCDFE1                  _PTCDFE.Bits.PTCDFE1
#define PTCDFE_PTCDFE2                  _PTCDFE.Bits.PTCDFE2
#define PTCDFE_PTCDFE3                  _PTCDFE.Bits.PTCDFE3
#define PTCDFE_PTCDFE4                  _PTCDFE.Bits.PTCDFE4
#define PTCDFE_PTCDFE5                  _PTCDFE.Bits.PTCDFE5
#define PTCDFE_PTCDFE6                  _PTCDFE.Bits.PTCDFE6
#define PTCDFE_PTCDFE                   _PTCDFE.MergedBits.grpPTCDFE

#define PTCDFE_PTCDFE0_MASK             1
#define PTCDFE_PTCDFE1_MASK             2
#define PTCDFE_PTCDFE2_MASK             4
#define PTCDFE_PTCDFE3_MASK             8
#define PTCDFE_PTCDFE4_MASK             16
#define PTCDFE_PTCDFE5_MASK             32
#define PTCDFE_PTCDFE6_MASK             64
#define PTCDFE_PTCDFE_MASK              127
#define PTCDFE_PTCDFE_BITNUM            0


/*** PTCDFC - Port C Digital Filter Control Register; 0xFFFF812A ***/
typedef union {
  byte Byte;
  struct {
    byte PTCFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTCFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTCFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTCFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTCFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTCCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTCFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTCDFCSTR;
extern volatile PTCDFCSTR _PTCDFC @0xFFFF812A;
#define PTCDFC                          _PTCDFC.Byte
#define PTCDFC_PTCFF0                   _PTCDFC.Bits.PTCFF0
#define PTCDFC_PTCFF1                   _PTCDFC.Bits.PTCFF1
#define PTCDFC_PTCFF2                   _PTCDFC.Bits.PTCFF2
#define PTCDFC_PTCFF3                   _PTCDFC.Bits.PTCFF3
#define PTCDFC_PTCFF4                   _PTCDFC.Bits.PTCFF4
#define PTCDFC_PTCCLKS                  _PTCDFC.Bits.PTCCLKS
#define PTCDFC_PTCFF                    _PTCDFC.MergedBits.grpPTCFF

#define PTCDFC_PTCFF0_MASK              1
#define PTCDFC_PTCFF1_MASK              2
#define PTCDFC_PTCFF2_MASK              4
#define PTCDFC_PTCFF3_MASK              8
#define PTCDFC_PTCFF4_MASK              16
#define PTCDFC_PTCCLKS_MASK             128
#define PTCDFC_PTCFF_MASK               31
#define PTCDFC_PTCFF_BITNUM             0


/*** PTDPUE - Port D Pulling Enable Register; 0xFFFF8130 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPUE0     :1;                                       /* Internal Pulling Enable for Port D Bit 0 */
    byte PTDPUE1     :1;                                       /* Internal Pulling Enable for Port D Bit 1 */
    byte PTDPUE2     :1;                                       /* Internal Pulling Enable for Port D Bit 2 */
    byte PTDPUE3     :1;                                       /* Internal Pulling Enable for Port D Bit 3 */
    byte PTDPUE4     :1;                                       /* Internal Pulling Enable for Port D Bit 4 */
    byte PTDPUE5     :1;                                       /* Internal Pulling Enable for Port D Bit 5 */
    byte PTDPUE6     :1;                                       /* Internal Pulling Enable for Port D Bit 6 */
    byte PTDPUE7     :1;                                       /* Internal Pulling Enable for Port D Bit 7 */
  } Bits;
} PTDPUESTR;
extern volatile PTDPUESTR _PTDPUE @0xFFFF8130;
#define PTDPUE                          _PTDPUE.Byte
#define PTDPUE_PTDPUE0                  _PTDPUE.Bits.PTDPUE0
#define PTDPUE_PTDPUE1                  _PTDPUE.Bits.PTDPUE1
#define PTDPUE_PTDPUE2                  _PTDPUE.Bits.PTDPUE2
#define PTDPUE_PTDPUE3                  _PTDPUE.Bits.PTDPUE3
#define PTDPUE_PTDPUE4                  _PTDPUE.Bits.PTDPUE4
#define PTDPUE_PTDPUE5                  _PTDPUE.Bits.PTDPUE5
#define PTDPUE_PTDPUE6                  _PTDPUE.Bits.PTDPUE6
#define PTDPUE_PTDPUE7                  _PTDPUE.Bits.PTDPUE7

#define PTDPUE_PTDPUE0_MASK             1
#define PTDPUE_PTDPUE1_MASK             2
#define PTDPUE_PTDPUE2_MASK             4
#define PTDPUE_PTDPUE3_MASK             8
#define PTDPUE_PTDPUE4_MASK             16
#define PTDPUE_PTDPUE5_MASK             32
#define PTDPUE_PTDPUE6_MASK             64
#define PTDPUE_PTDPUE7_MASK             128


/*** PTDPUS - Port D Pullup/Pulldown Select Register; 0xFFFF8131 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTDPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTDPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTDPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTDPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTDPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTDPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTDPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTDPUSSTR;
extern volatile PTDPUSSTR _PTDPUS @0xFFFF8131;
#define PTDPUS                          _PTDPUS.Byte
#define PTDPUS_PTDPUS0                  _PTDPUS.Bits.PTDPUS0
#define PTDPUS_PTDPUS1                  _PTDPUS.Bits.PTDPUS1
#define PTDPUS_PTDPUS2                  _PTDPUS.Bits.PTDPUS2
#define PTDPUS_PTDPUS3                  _PTDPUS.Bits.PTDPUS3
#define PTDPUS_PTDPUS4                  _PTDPUS.Bits.PTDPUS4
#define PTDPUS_PTDPUS5                  _PTDPUS.Bits.PTDPUS5
#define PTDPUS_PTDPUS6                  _PTDPUS.Bits.PTDPUS6
#define PTDPUS_PTDPUS7                  _PTDPUS.Bits.PTDPUS7

#define PTDPUS_PTDPUS0_MASK             1
#define PTDPUS_PTDPUS1_MASK             2
#define PTDPUS_PTDPUS2_MASK             4
#define PTDPUS_PTDPUS3_MASK             8
#define PTDPUS_PTDPUS4_MASK             16
#define PTDPUS_PTDPUS5_MASK             32
#define PTDPUS_PTDPUS6_MASK             64
#define PTDPUS_PTDPUS7_MASK             128


