AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTDDS - Port D Drive Strength Selection Register; 0xFFFF8132 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDDS0      :1;                                       /* Output Drive Strength Selection for Port D Bit 0 */
    byte PTDDS1      :1;                                       /* Output Drive Strength Selection for Port D Bit 1 */
    byte PTDDS2      :1;                                       /* Output Drive Strength Selection for Port D Bit 2 */
    byte PTDDS3      :1;                                       /* Output Drive Strength Selection for Port D Bit 3 */
    byte PTDDS4      :1;                                       /* Output Drive Strength Selection for Port D Bit 4 */
    byte PTDDS5      :1;                                       /* Output Drive Strength Selection for Port D Bit 5 */
    byte PTDDS6      :1;                                       /* Output Drive Strength Selection for Port D Bit 6 */
    byte PTDDS7      :1;                                       /* Output Drive Strength Selection for Port D Bit 7 */
  } Bits;
} PTDDSSTR;
extern volatile PTDDSSTR _PTDDS @0xFFFF8132;
#define PTDDS                           _PTDDS.Byte
#define PTDDS_PTDDS0                    _PTDDS.Bits.PTDDS0
#define PTDDS_PTDDS1                    _PTDDS.Bits.PTDDS1
#define PTDDS_PTDDS2                    _PTDDS.Bits.PTDDS2
#define PTDDS_PTDDS3                    _PTDDS.Bits.PTDDS3
#define PTDDS_PTDDS4                    _PTDDS.Bits.PTDDS4
#define PTDDS_PTDDS5                    _PTDDS.Bits.PTDDS5
#define PTDDS_PTDDS6                    _PTDDS.Bits.PTDDS6
#define PTDDS_PTDDS7                    _PTDDS.Bits.PTDDS7

#define PTDDS_PTDDS0_MASK               1
#define PTDDS_PTDDS1_MASK               2
#define PTDDS_PTDDS2_MASK               4
#define PTDDS_PTDDS3_MASK               8
#define PTDDS_PTDDS4_MASK               16
#define PTDDS_PTDDS5_MASK               32
#define PTDDS_PTDDS6_MASK               64
#define PTDDS_PTDDS7_MASK               128


/*** PTDSRE - Port D Slew Rate Enable Register; 0xFFFF8133 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDSRE0     :1;                                       /* Output Slew Rate Enable for Port D Bit 0 */
    byte PTDSRE1     :1;                                       /* Output Slew Rate Enable for Port D Bit 1 */
    byte PTDSRE2     :1;                                       /* Output Slew Rate Enable for Port D Bit 2 */
    byte PTDSRE3     :1;                                       /* Output Slew Rate Enable for Port D Bit 3 */
    byte PTDSRE4     :1;                                       /* Output Slew Rate Enable for Port D Bit 4 */
    byte PTDSRE5     :1;                                       /* Output Slew Rate Enable for Port D Bit 5 */
    byte PTDSRE6     :1;                                       /* Output Slew Rate Enable for Port D Bit 6 */
    byte PTDSRE7     :1;                                       /* Output Slew Rate Enable for Port D Bit 7 */
  } Bits;
} PTDSRESTR;
extern volatile PTDSRESTR _PTDSRE @0xFFFF8133;
#define PTDSRE                          _PTDSRE.Byte
#define PTDSRE_PTDSRE0                  _PTDSRE.Bits.PTDSRE0
#define PTDSRE_PTDSRE1                  _PTDSRE.Bits.PTDSRE1
#define PTDSRE_PTDSRE2                  _PTDSRE.Bits.PTDSRE2
#define PTDSRE_PTDSRE3                  _PTDSRE.Bits.PTDSRE3
#define PTDSRE_PTDSRE4                  _PTDSRE.Bits.PTDSRE4
#define PTDSRE_PTDSRE5                  _PTDSRE.Bits.PTDSRE5
#define PTDSRE_PTDSRE6                  _PTDSRE.Bits.PTDSRE6
#define PTDSRE_PTDSRE7                  _PTDSRE.Bits.PTDSRE7

#define PTDSRE_PTDSRE0_MASK             1
#define PTDSRE_PTDSRE1_MASK             2
#define PTDSRE_PTDSRE2_MASK             4
#define PTDSRE_PTDSRE3_MASK             8
#define PTDSRE_PTDSRE4_MASK             16
#define PTDSRE_PTDSRE5_MASK             32
#define PTDSRE_PTDSRE6_MASK             64
#define PTDSRE_PTDSRE7_MASK             128


/*** PTDPFE - Port D Passive Filter Enable Register; 0xFFFF8134 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTDPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTDPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTDPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTDPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTDPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTDPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTDPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTDPFESTR;
extern volatile PTDPFESTR _PTDPFE @0xFFFF8134;
#define PTDPFE                          _PTDPFE.Byte
#define PTDPFE_PTDPFE0                  _PTDPFE.Bits.PTDPFE0
#define PTDPFE_PTDPFE1                  _PTDPFE.Bits.PTDPFE1
#define PTDPFE_PTDPFE2                  _PTDPFE.Bits.PTDPFE2
#define PTDPFE_PTDPFE3                  _PTDPFE.Bits.PTDPFE3
#define PTDPFE_PTDPFE4                  _PTDPFE.Bits.PTDPFE4
#define PTDPFE_PTDPFE5                  _PTDPFE.Bits.PTDPFE5
#define PTDPFE_PTDPFE6                  _PTDPFE.Bits.PTDPFE6
#define PTDPFE_PTDPFE7                  _PTDPFE.Bits.PTDPFE7

#define PTDPFE_PTDPFE0_MASK             1
#define PTDPFE_PTDPFE1_MASK             2
#define PTDPFE_PTDPFE2_MASK             4
#define PTDPFE_PTDPFE3_MASK             8
#define PTDPFE_PTDPFE4_MASK             16
#define PTDPFE_PTDPFE5_MASK             32
#define PTDPFE_PTDPFE6_MASK             64
#define PTDPFE_PTDPFE7_MASK             128


/*** PTDIC - Port D Interrupt Control Register; 0xFFFF8135 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTDIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTDDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTDICSTR;
extern volatile PTDICSTR _PTDIC @0xFFFF8135;
#define PTDIC                           _PTDIC.Byte
#define PTDIC_PTDMOD                    _PTDIC.Bits.PTDMOD
#define PTDIC_PTDIE                     _PTDIC.Bits.PTDIE
#define PTDIC_PTDDMAEN                  _PTDIC.Bits.PTDDMAEN

