AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTDIC_PTDMOD_MASK               1
#define PTDIC_PTDIE_MASK                2
#define PTDIC_PTDDMAEN_MASK             128


/*** PTDIPE - Port D Interrupt Pin Enable Register; 0xFFFF8136 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTDIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTDIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTDIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTDIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTDIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTDIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTDIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTDIPESTR;
extern volatile PTDIPESTR _PTDIPE @0xFFFF8136;
#define PTDIPE                          _PTDIPE.Byte
#define PTDIPE_PTDIPE0                  _PTDIPE.Bits.PTDIPE0
#define PTDIPE_PTDIPE1                  _PTDIPE.Bits.PTDIPE1
#define PTDIPE_PTDIPE2                  _PTDIPE.Bits.PTDIPE2
#define PTDIPE_PTDIPE3                  _PTDIPE.Bits.PTDIPE3
#define PTDIPE_PTDIPE4                  _PTDIPE.Bits.PTDIPE4
#define PTDIPE_PTDIPE5                  _PTDIPE.Bits.PTDIPE5
#define PTDIPE_PTDIPE6                  _PTDIPE.Bits.PTDIPE6
#define PTDIPE_PTDIPE7                  _PTDIPE.Bits.PTDIPE7

#define PTDIPE_PTDIPE0_MASK             1
#define PTDIPE_PTDIPE1_MASK             2
#define PTDIPE_PTDIPE2_MASK             4
#define PTDIPE_PTDIPE3_MASK             8
#define PTDIPE_PTDIPE4_MASK             16
#define PTDIPE_PTDIPE5_MASK             32
#define PTDIPE_PTDIPE6_MASK             64
#define PTDIPE_PTDIPE7_MASK             128


/*** PTDIF - Port D Interrupt Flag Register; 0xFFFF8137 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTDIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTDIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTDIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTDIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTDIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTDIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTDIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTDIFSTR;
extern volatile PTDIFSTR _PTDIF @0xFFFF8137;
#define PTDIF                           _PTDIF.Byte
#define PTDIF_PTDIF0                    _PTDIF.Bits.PTDIF0
#define PTDIF_PTDIF1                    _PTDIF.Bits.PTDIF1
#define PTDIF_PTDIF2                    _PTDIF.Bits.PTDIF2
#define PTDIF_PTDIF3                    _PTDIF.Bits.PTDIF3
#define PTDIF_PTDIF4                    _PTDIF.Bits.PTDIF4
#define PTDIF_PTDIF5                    _PTDIF.Bits.PTDIF5
#define PTDIF_PTDIF6                    _PTDIF.Bits.PTDIF6
#define PTDIF_PTDIF7                    _PTDIF.Bits.PTDIF7

#define PTDIF_PTDIF0_MASK               1
#define PTDIF_PTDIF1_MASK               2
#define PTDIF_PTDIF2_MASK               4
#define PTDIF_PTDIF3_MASK               8
#define PTDIF_PTDIF4_MASK               16
#define PTDIF_PTDIF5_MASK               32
#define PTDIF_PTDIF6_MASK               64
#define PTDIF_PTDIF7_MASK               128


/*** PTDIES - Port D Interrupt Edge Select Register; 0xFFFF8138 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTDEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTDEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTDEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTDEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTDEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTDEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTDEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTDIESSTR;
extern volatile PTDIESSTR _PTDIES @0xFFFF8138;
#define PTDIES                          _PTDIES.Byte
#define PTDIES_PTDEDG0                  _PTDIES.Bits.PTDEDG0
#define PTDIES_PTDEDG1                  _PTDIES.Bits.PTDEDG1
#define PTDIES_PTDEDG2                  _PTDIES.Bits.PTDEDG2
#define PTDIES_PTDEDG3                  _PTDIES.Bits.PTDEDG3
#define PTDIES_PTDEDG4                  _PTDIES.Bits.PTDEDG4
#define PTDIES_PTDEDG5                  _PTDIES.Bits.PTDEDG5
#define PTDIES_PTDEDG6                  _PTDIES.Bits.PTDEDG6
#define PTDIES_PTDEDG7                  _PTDIES.Bits.PTDEDG7

#define PTDIES_PTDEDG0_MASK             1
#define PTDIES_PTDEDG1_MASK             2
#define PTDIES_PTDEDG2_MASK             4
#define PTDIES_PTDEDG3_MASK             8
#define PTDIES_PTDEDG4_MASK             16
#define PTDIES_PTDEDG5_MASK             32
#define PTDIES_PTDEDG6_MASK             64
#define PTDIES_PTDEDG7_MASK             128


/*** PTDDFE - Port D Digital Filter Enable Register; 0xFFFF8139 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTDDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTDDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTDDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTDDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTDDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTDDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTDDFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTDDFESTR;
extern volatile PTDDFESTR _PTDDFE @0xFFFF8139;
#define PTDDFE                          _PTDDFE.Byte
#define PTDDFE_PTDDFE0                  _PTDDFE.Bits.PTDDFE0
#define PTDDFE_PTDDFE1                  _PTDDFE.Bits.PTDDFE1
#define PTDDFE_PTDDFE2                  _PTDDFE.Bits.PTDDFE2
#define PTDDFE_PTDDFE3                  _PTDDFE.Bits.PTDDFE3
#define PTDDFE_PTDDFE4                  _PTDDFE.Bits.PTDDFE4
#define PTDDFE_PTDDFE5                  _PTDDFE.Bits.PTDDFE5
#define PTDDFE_PTDDFE6                  _PTDDFE.Bits.PTDDFE6
#define PTDDFE_PTDDFE7                  _PTDDFE.Bits.PTDDFE7

