AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTDDFE_PTDDFE0_MASK             1
#define PTDDFE_PTDDFE1_MASK             2
#define PTDDFE_PTDDFE2_MASK             4
#define PTDDFE_PTDDFE3_MASK             8
#define PTDDFE_PTDDFE4_MASK             16
#define PTDDFE_PTDDFE5_MASK             32
#define PTDDFE_PTDDFE6_MASK             64
#define PTDDFE_PTDDFE7_MASK             128


/*** PTDDFC - Port D Digital Filter Control Register; 0xFFFF813A ***/
typedef union {
  byte Byte;
  struct {
    byte PTDFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTDFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTDFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTDFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTDFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTDCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTDFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTDDFCSTR;
extern volatile PTDDFCSTR _PTDDFC @0xFFFF813A;
#define PTDDFC                          _PTDDFC.Byte
#define PTDDFC_PTDFF0                   _PTDDFC.Bits.PTDFF0
#define PTDDFC_PTDFF1                   _PTDDFC.Bits.PTDFF1
#define PTDDFC_PTDFF2                   _PTDDFC.Bits.PTDFF2
#define PTDDFC_PTDFF3                   _PTDDFC.Bits.PTDFF3
#define PTDDFC_PTDFF4                   _PTDDFC.Bits.PTDFF4
#define PTDDFC_PTDCLKS                  _PTDDFC.Bits.PTDCLKS
#define PTDDFC_PTDFF                    _PTDDFC.MergedBits.grpPTDFF

#define PTDDFC_PTDFF0_MASK              1
#define PTDDFC_PTDFF1_MASK              2
#define PTDDFC_PTDFF2_MASK              4
#define PTDDFC_PTDFF3_MASK              8
#define PTDDFC_PTDFF4_MASK              16
#define PTDDFC_PTDCLKS_MASK             128
#define PTDDFC_PTDFF_MASK               31
#define PTDDFC_PTDFF_BITNUM             0


/*** PTEPUE - Port E Pulling Enable Register; 0xFFFF8140 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPUE0     :1;                                       /* Internal Pulling Enable for Port E Bit 0 */
    byte PTEPUE1     :1;                                       /* Internal Pulling Enable for Port E Bit 1 */
    byte PTEPUE2     :1;                                       /* Internal Pulling Enable for Port E Bit 2 */
    byte PTEPUE3     :1;                                       /* Internal Pulling Enable for Port E Bit 3 */
    byte PTEPUE4     :1;                                       /* Internal Pulling Enable for Port E Bit 4 */
    byte PTEPUE5     :1;                                       /* Internal Pulling Enable for Port E Bit 5 */
    byte PTEPUE6     :1;                                       /* Internal Pulling Enable for Port E Bit 6 */
    byte PTEPUE7     :1;                                       /* Internal Pulling Enable for Port E Bit 7 */
  } Bits;
} PTEPUESTR;
extern volatile PTEPUESTR _PTEPUE @0xFFFF8140;
#define PTEPUE                          _PTEPUE.Byte
#define PTEPUE_PTEPUE0                  _PTEPUE.Bits.PTEPUE0
#define PTEPUE_PTEPUE1                  _PTEPUE.Bits.PTEPUE1
#define PTEPUE_PTEPUE2                  _PTEPUE.Bits.PTEPUE2
#define PTEPUE_PTEPUE3                  _PTEPUE.Bits.PTEPUE3
#define PTEPUE_PTEPUE4                  _PTEPUE.Bits.PTEPUE4
#define PTEPUE_PTEPUE5                  _PTEPUE.Bits.PTEPUE5
#define PTEPUE_PTEPUE6                  _PTEPUE.Bits.PTEPUE6
#define PTEPUE_PTEPUE7                  _PTEPUE.Bits.PTEPUE7

#define PTEPUE_PTEPUE0_MASK             1
#define PTEPUE_PTEPUE1_MASK             2
#define PTEPUE_PTEPUE2_MASK             4
#define PTEPUE_PTEPUE3_MASK             8
#define PTEPUE_PTEPUE4_MASK             16
#define PTEPUE_PTEPUE5_MASK             32
#define PTEPUE_PTEPUE6_MASK             64
#define PTEPUE_PTEPUE7_MASK             128


/*** PTEPUS - Port E Pullup/Pulldown Select Register; 0xFFFF8141 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTEPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTEPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTEPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTEPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTEPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTEPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTEPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTEPUSSTR;
extern volatile PTEPUSSTR _PTEPUS @0xFFFF8141;
#define PTEPUS                          _PTEPUS.Byte
#define PTEPUS_PTEPUS0                  _PTEPUS.Bits.PTEPUS0
#define PTEPUS_PTEPUS1                  _PTEPUS.Bits.PTEPUS1
#define PTEPUS_PTEPUS2                  _PTEPUS.Bits.PTEPUS2
#define PTEPUS_PTEPUS3                  _PTEPUS.Bits.PTEPUS3
#define PTEPUS_PTEPUS4                  _PTEPUS.Bits.PTEPUS4
#define PTEPUS_PTEPUS5                  _PTEPUS.Bits.PTEPUS5
#define PTEPUS_PTEPUS6                  _PTEPUS.Bits.PTEPUS6
#define PTEPUS_PTEPUS7                  _PTEPUS.Bits.PTEPUS7

#define PTEPUS_PTEPUS0_MASK             1
#define PTEPUS_PTEPUS1_MASK             2
#define PTEPUS_PTEPUS2_MASK             4
#define PTEPUS_PTEPUS3_MASK             8
#define PTEPUS_PTEPUS4_MASK             16
#define PTEPUS_PTEPUS5_MASK             32
#define PTEPUS_PTEPUS6_MASK             64
#define PTEPUS_PTEPUS7_MASK             128


/*** PTEDS - Port E Drive Strength Selection Register; 0xFFFF8142 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEDS0      :1;                                       /* Output Drive Strength Selection for Port E Bit 0 */
    byte PTEDS1      :1;                                       /* Output Drive Strength Selection for Port E Bit 1 */
    byte PTEDS2      :1;                                       /* Output Drive Strength Selection for Port E Bit 2 */
    byte PTEDS3      :1;                                       /* Output Drive Strength Selection for Port E Bit 3 */
    byte PTEDS4      :1;                                       /* Output Drive Strength Selection for Port E Bit 4 */
    byte PTEDS5      :1;                                       /* Output Drive Strength Selection for Port E Bit 5 */
    byte PTEDS6      :1;                                       /* Output Drive Strength Selection for Port E Bit 6 */
    byte PTEDS7      :1;                                       /* Output Drive Strength Selection for Port E Bit 7 */
  } Bits;
} PTEDSSTR;
extern volatile PTEDSSTR _PTEDS @0xFFFF8142;
#define PTEDS                           _PTEDS.Byte
#define PTEDS_PTEDS0                    _PTEDS.Bits.PTEDS0
#define PTEDS_PTEDS1                    _PTEDS.Bits.PTEDS1
#define PTEDS_PTEDS2                    _PTEDS.Bits.PTEDS2
#define PTEDS_PTEDS3                    _PTEDS.Bits.PTEDS3
#define PTEDS_PTEDS4                    _PTEDS.Bits.PTEDS4
#define PTEDS_PTEDS5                    _PTEDS.Bits.PTEDS5
#define PTEDS_PTEDS6                    _PTEDS.Bits.PTEDS6
#define PTEDS_PTEDS7                    _PTEDS.Bits.PTEDS7

#define PTEDS_PTEDS0_MASK               1
#define PTEDS_PTEDS1_MASK               2
#define PTEDS_PTEDS2_MASK               4
#define PTEDS_PTEDS3_MASK               8
#define PTEDS_PTEDS4_MASK               16
#define PTEDS_PTEDS5_MASK               32
#define PTEDS_PTEDS6_MASK               64
#define PTEDS_PTEDS7_MASK               128


/*** PTESRE - Port E Slew Rate Enable Register; 0xFFFF8143 ***/
typedef union {
  byte Byte;
  struct {
    byte PTESRE0     :1;                                       /* Output Slew Rate Enable for Port E Bit 0 */
    byte PTESRE1     :1;                                       /* Output Slew Rate Enable for Port E Bit 1 */
    byte PTESRE2     :1;                                       /* Output Slew Rate Enable for Port E Bit 2 */
    byte PTESRE3     :1;                                       /* Output Slew Rate Enable for Port E Bit 3 */
    byte PTESRE4     :1;                                       /* Output Slew Rate Enable for Port E Bit 4 */
    byte PTESRE5     :1;                                       /* Output Slew Rate Enable for Port E Bit 5 */
    byte PTESRE6     :1;                                       /* Output Slew Rate Enable for Port E Bit 6 */
    byte PTESRE7     :1;                                       /* Output Slew Rate Enable for Port E Bit 7 */
  } Bits;
} PTESRESTR;
