AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTESRESTR _PTESRE @0xFFFF8143;
#define PTESRE                          _PTESRE.Byte
#define PTESRE_PTESRE0                  _PTESRE.Bits.PTESRE0
#define PTESRE_PTESRE1                  _PTESRE.Bits.PTESRE1
#define PTESRE_PTESRE2                  _PTESRE.Bits.PTESRE2
#define PTESRE_PTESRE3                  _PTESRE.Bits.PTESRE3
#define PTESRE_PTESRE4                  _PTESRE.Bits.PTESRE4
#define PTESRE_PTESRE5                  _PTESRE.Bits.PTESRE5
#define PTESRE_PTESRE6                  _PTESRE.Bits.PTESRE6
#define PTESRE_PTESRE7                  _PTESRE.Bits.PTESRE7

#define PTESRE_PTESRE0_MASK             1
#define PTESRE_PTESRE1_MASK             2
#define PTESRE_PTESRE2_MASK             4
#define PTESRE_PTESRE3_MASK             8
#define PTESRE_PTESRE4_MASK             16
#define PTESRE_PTESRE5_MASK             32
#define PTESRE_PTESRE6_MASK             64
#define PTESRE_PTESRE7_MASK             128


/*** PTEPFE - Port E Passive Filter Enable Register; 0xFFFF8144 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTEPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTEPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTEPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTEPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTEPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTEPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTEPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTEPFESTR;
extern volatile PTEPFESTR _PTEPFE @0xFFFF8144;
#define PTEPFE                          _PTEPFE.Byte
#define PTEPFE_PTEPFE0                  _PTEPFE.Bits.PTEPFE0
#define PTEPFE_PTEPFE1                  _PTEPFE.Bits.PTEPFE1
#define PTEPFE_PTEPFE2                  _PTEPFE.Bits.PTEPFE2
#define PTEPFE_PTEPFE3                  _PTEPFE.Bits.PTEPFE3
#define PTEPFE_PTEPFE4                  _PTEPFE.Bits.PTEPFE4
#define PTEPFE_PTEPFE5                  _PTEPFE.Bits.PTEPFE5
#define PTEPFE_PTEPFE6                  _PTEPFE.Bits.PTEPFE6
#define PTEPFE_PTEPFE7                  _PTEPFE.Bits.PTEPFE7

#define PTEPFE_PTEPFE0_MASK             1
#define PTEPFE_PTEPFE1_MASK             2
#define PTEPFE_PTEPFE2_MASK             4
#define PTEPFE_PTEPFE3_MASK             8
#define PTEPFE_PTEPFE4_MASK             16
#define PTEPFE_PTEPFE5_MASK             32
#define PTEPFE_PTEPFE6_MASK             64
#define PTEPFE_PTEPFE7_MASK             128


/*** PTEIC - Port E Interrupt Control Register; 0xFFFF8145 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTEIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTEDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTEICSTR;
extern volatile PTEICSTR _PTEIC @0xFFFF8145;
#define PTEIC                           _PTEIC.Byte
#define PTEIC_PTEMOD                    _PTEIC.Bits.PTEMOD
#define PTEIC_PTEIE                     _PTEIC.Bits.PTEIE
#define PTEIC_PTEDMAEN                  _PTEIC.Bits.PTEDMAEN

#define PTEIC_PTEMOD_MASK               1
#define PTEIC_PTEIE_MASK                2
#define PTEIC_PTEDMAEN_MASK             128


/*** PTEIPE - Port E Interrupt Pin Enable Register; 0xFFFF8146 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTEIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTEIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTEIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTEIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTEIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTEIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTEIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTEIPESTR;
extern volatile PTEIPESTR _PTEIPE @0xFFFF8146;
#define PTEIPE                          _PTEIPE.Byte
#define PTEIPE_PTEIPE0                  _PTEIPE.Bits.PTEIPE0
#define PTEIPE_PTEIPE1                  _PTEIPE.Bits.PTEIPE1
#define PTEIPE_PTEIPE2                  _PTEIPE.Bits.PTEIPE2
#define PTEIPE_PTEIPE3                  _PTEIPE.Bits.PTEIPE3
#define PTEIPE_PTEIPE4                  _PTEIPE.Bits.PTEIPE4
#define PTEIPE_PTEIPE5                  _PTEIPE.Bits.PTEIPE5
#define PTEIPE_PTEIPE6                  _PTEIPE.Bits.PTEIPE6
#define PTEIPE_PTEIPE7                  _PTEIPE.Bits.PTEIPE7

#define PTEIPE_PTEIPE0_MASK             1
#define PTEIPE_PTEIPE1_MASK             2
#define PTEIPE_PTEIPE2_MASK             4
#define PTEIPE_PTEIPE3_MASK             8
#define PTEIPE_PTEIPE4_MASK             16
#define PTEIPE_PTEIPE5_MASK             32
#define PTEIPE_PTEIPE6_MASK             64
#define PTEIPE_PTEIPE7_MASK             128


/*** PTEIF - Port E Interrupt Flag Register; 0xFFFF8147 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTEIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTEIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTEIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTEIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTEIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTEIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTEIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTEIFSTR;
extern volatile PTEIFSTR _PTEIF @0xFFFF8147;
#define PTEIF                           _PTEIF.Byte
#define PTEIF_PTEIF0                    _PTEIF.Bits.PTEIF0
#define PTEIF_PTEIF1                    _PTEIF.Bits.PTEIF1
#define PTEIF_PTEIF2                    _PTEIF.Bits.PTEIF2
#define PTEIF_PTEIF3                    _PTEIF.Bits.PTEIF3
#define PTEIF_PTEIF4                    _PTEIF.Bits.PTEIF4
#define PTEIF_PTEIF5                    _PTEIF.Bits.PTEIF5
#define PTEIF_PTEIF6                    _PTEIF.Bits.PTEIF6
#define PTEIF_PTEIF7                    _PTEIF.Bits.PTEIF7

#define PTEIF_PTEIF0_MASK               1
#define PTEIF_PTEIF1_MASK               2
#define PTEIF_PTEIF2_MASK               4
#define PTEIF_PTEIF3_MASK               8
#define PTEIF_PTEIF4_MASK               16
#define PTEIF_PTEIF5_MASK               32
#define PTEIF_PTEIF6_MASK               64
#define PTEIF_PTEIF7_MASK               128


/*** PTEIES - Port E Interrupt Edge Select Register; 0xFFFF8148 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTEEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTEEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTEEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTEEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTEEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTEEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTEEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTEIESSTR;
extern volatile PTEIESSTR _PTEIES @0xFFFF8148;
#define PTEIES                          _PTEIES.Byte
#define PTEIES_PTEEDG0                  _PTEIES.Bits.PTEEDG0
#define PTEIES_PTEEDG1                  _PTEIES.Bits.PTEEDG1
#define PTEIES_PTEEDG2                  _PTEIES.Bits.PTEEDG2
#define PTEIES_PTEEDG3                  _PTEIES.Bits.PTEEDG3
#define PTEIES_PTEEDG4                  _PTEIES.Bits.PTEEDG4
#define PTEIES_PTEEDG5                  _PTEIES.Bits.PTEEDG5
#define PTEIES_PTEEDG6                  _PTEIES.Bits.PTEEDG6
#define PTEIES_PTEEDG7                  _PTEIES.Bits.PTEEDG7

