AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTEIES_PTEEDG0_MASK             1
#define PTEIES_PTEEDG1_MASK             2
#define PTEIES_PTEEDG2_MASK             4
#define PTEIES_PTEEDG3_MASK             8
#define PTEIES_PTEEDG4_MASK             16
#define PTEIES_PTEEDG5_MASK             32
#define PTEIES_PTEEDG6_MASK             64
#define PTEIES_PTEEDG7_MASK             128


/*** PTEDFE - Port E Digital Filter Enable Register; 0xFFFF8149 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTEDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTEDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTEDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTEDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTEDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTEDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTEDFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTEDFESTR;
extern volatile PTEDFESTR _PTEDFE @0xFFFF8149;
#define PTEDFE                          _PTEDFE.Byte
#define PTEDFE_PTEDFE0                  _PTEDFE.Bits.PTEDFE0
#define PTEDFE_PTEDFE1                  _PTEDFE.Bits.PTEDFE1
#define PTEDFE_PTEDFE2                  _PTEDFE.Bits.PTEDFE2
#define PTEDFE_PTEDFE3                  _PTEDFE.Bits.PTEDFE3
#define PTEDFE_PTEDFE4                  _PTEDFE.Bits.PTEDFE4
#define PTEDFE_PTEDFE5                  _PTEDFE.Bits.PTEDFE5
#define PTEDFE_PTEDFE6                  _PTEDFE.Bits.PTEDFE6
#define PTEDFE_PTEDFE7                  _PTEDFE.Bits.PTEDFE7

#define PTEDFE_PTEDFE0_MASK             1
#define PTEDFE_PTEDFE1_MASK             2
#define PTEDFE_PTEDFE2_MASK             4
#define PTEDFE_PTEDFE3_MASK             8
#define PTEDFE_PTEDFE4_MASK             16
#define PTEDFE_PTEDFE5_MASK             32
#define PTEDFE_PTEDFE6_MASK             64
#define PTEDFE_PTEDFE7_MASK             128


/*** PTEDFC - Port E Digital Filter Control Register; 0xFFFF814A ***/
typedef union {
  byte Byte;
  struct {
    byte PTEFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTEFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTEFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTEFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTEFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTECLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTEFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTEDFCSTR;
extern volatile PTEDFCSTR _PTEDFC @0xFFFF814A;
#define PTEDFC                          _PTEDFC.Byte
#define PTEDFC_PTEFF0                   _PTEDFC.Bits.PTEFF0
#define PTEDFC_PTEFF1                   _PTEDFC.Bits.PTEFF1
#define PTEDFC_PTEFF2                   _PTEDFC.Bits.PTEFF2
#define PTEDFC_PTEFF3                   _PTEDFC.Bits.PTEFF3
#define PTEDFC_PTEFF4                   _PTEDFC.Bits.PTEFF4
#define PTEDFC_PTECLKS                  _PTEDFC.Bits.PTECLKS
#define PTEDFC_PTEFF                    _PTEDFC.MergedBits.grpPTEFF

#define PTEDFC_PTEFF0_MASK              1
#define PTEDFC_PTEFF1_MASK              2
#define PTEDFC_PTEFF2_MASK              4
#define PTEDFC_PTEFF3_MASK              8
#define PTEDFC_PTEFF4_MASK              16
#define PTEDFC_PTECLKS_MASK             128
#define PTEDFC_PTEFF_MASK               31
#define PTEDFC_PTEFF_BITNUM             0


/*** PTFPUE - Port F Pulling Enable Register; 0xFFFF8150 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPUE0     :1;                                       /* Internal Pulling Enable for Port F Bit 0 */
    byte PTFPUE1     :1;                                       /* Internal Pulling Enable for Port F Bit 1 */
    byte PTFPUE2     :1;                                       /* Internal Pulling Enable for Port F Bit 2 */
    byte PTFPUE3     :1;                                       /* Internal Pulling Enable for Port F Bit 3 */
    byte PTFPUE4     :1;                                       /* Internal Pulling Enable for Port F Bit 4 */
    byte PTFPUE5     :1;                                       /* Internal Pulling Enable for Port F Bit 5 */
    byte PTFPUE6     :1;                                       /* Internal Pulling Enable for Port F Bit 6 */
    byte PTFPUE7     :1;                                       /* Internal Pulling Enable for Port F Bit 7 */
  } Bits;
} PTFPUESTR;
extern volatile PTFPUESTR _PTFPUE @0xFFFF8150;
#define PTFPUE                          _PTFPUE.Byte
#define PTFPUE_PTFPUE0                  _PTFPUE.Bits.PTFPUE0
#define PTFPUE_PTFPUE1                  _PTFPUE.Bits.PTFPUE1
#define PTFPUE_PTFPUE2                  _PTFPUE.Bits.PTFPUE2
#define PTFPUE_PTFPUE3                  _PTFPUE.Bits.PTFPUE3
#define PTFPUE_PTFPUE4                  _PTFPUE.Bits.PTFPUE4
#define PTFPUE_PTFPUE5                  _PTFPUE.Bits.PTFPUE5
#define PTFPUE_PTFPUE6                  _PTFPUE.Bits.PTFPUE6
#define PTFPUE_PTFPUE7                  _PTFPUE.Bits.PTFPUE7

#define PTFPUE_PTFPUE0_MASK             1
#define PTFPUE_PTFPUE1_MASK             2
#define PTFPUE_PTFPUE2_MASK             4
#define PTFPUE_PTFPUE3_MASK             8
#define PTFPUE_PTFPUE4_MASK             16
#define PTFPUE_PTFPUE5_MASK             32
#define PTFPUE_PTFPUE6_MASK             64
#define PTFPUE_PTFPUE7_MASK             128


/*** PTFPUS - Port F Pullup/Pulldown Select Register; 0xFFFF8151 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTFPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTFPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTFPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTFPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTFPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTFPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTFPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTFPUSSTR;
extern volatile PTFPUSSTR _PTFPUS @0xFFFF8151;
#define PTFPUS                          _PTFPUS.Byte
#define PTFPUS_PTFPUS0                  _PTFPUS.Bits.PTFPUS0
#define PTFPUS_PTFPUS1                  _PTFPUS.Bits.PTFPUS1
#define PTFPUS_PTFPUS2                  _PTFPUS.Bits.PTFPUS2
#define PTFPUS_PTFPUS3                  _PTFPUS.Bits.PTFPUS3
#define PTFPUS_PTFPUS4                  _PTFPUS.Bits.PTFPUS4
#define PTFPUS_PTFPUS5                  _PTFPUS.Bits.PTFPUS5
#define PTFPUS_PTFPUS6                  _PTFPUS.Bits.PTFPUS6
#define PTFPUS_PTFPUS7                  _PTFPUS.Bits.PTFPUS7

