AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTFPUS_PTFPUS0_MASK             1
#define PTFPUS_PTFPUS1_MASK             2
#define PTFPUS_PTFPUS2_MASK             4
#define PTFPUS_PTFPUS3_MASK             8
#define PTFPUS_PTFPUS4_MASK             16
#define PTFPUS_PTFPUS5_MASK             32
#define PTFPUS_PTFPUS6_MASK             64
#define PTFPUS_PTFPUS7_MASK             128


/*** PTFDS - Port F Drive Strength Selection Register; 0xFFFF8152 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFDS0      :1;                                       /* Output Drive Strength Selection for Port F Bit 0 */
    byte PTFDS1      :1;                                       /* Output Drive Strength Selection for Port F Bit 1 */
    byte PTFDS2      :1;                                       /* Output Drive Strength Selection for Port F Bit 2 */
    byte PTFDS3      :1;                                       /* Output Drive Strength Selection for Port F Bit 3 */
    byte PTFDS4      :1;                                       /* Output Drive Strength Selection for Port F Bit 4 */
    byte PTFDS5      :1;                                       /* Output Drive Strength Selection for Port F Bit 5 */
    byte PTFDS6      :1;                                       /* Output Drive Strength Selection for Port F Bit 6 */
    byte PTFDS7      :1;                                       /* Output Drive Strength Selection for Port F Bit 7 */
  } Bits;
} PTFDSSTR;
extern volatile PTFDSSTR _PTFDS @0xFFFF8152;
#define PTFDS                           _PTFDS.Byte
#define PTFDS_PTFDS0                    _PTFDS.Bits.PTFDS0
#define PTFDS_PTFDS1                    _PTFDS.Bits.PTFDS1
#define PTFDS_PTFDS2                    _PTFDS.Bits.PTFDS2
#define PTFDS_PTFDS3                    _PTFDS.Bits.PTFDS3
#define PTFDS_PTFDS4                    _PTFDS.Bits.PTFDS4
#define PTFDS_PTFDS5                    _PTFDS.Bits.PTFDS5
#define PTFDS_PTFDS6                    _PTFDS.Bits.PTFDS6
#define PTFDS_PTFDS7                    _PTFDS.Bits.PTFDS7

#define PTFDS_PTFDS0_MASK               1
#define PTFDS_PTFDS1_MASK               2
#define PTFDS_PTFDS2_MASK               4
#define PTFDS_PTFDS3_MASK               8
#define PTFDS_PTFDS4_MASK               16
#define PTFDS_PTFDS5_MASK               32
#define PTFDS_PTFDS6_MASK               64
#define PTFDS_PTFDS7_MASK               128


/*** PTFSRE - Port F Slew Rate Enable Register; 0xFFFF8153 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFSRE0     :1;                                       /* Output Slew Rate Enable for Port F Bit 0 */
    byte PTFSRE1     :1;                                       /* Output Slew Rate Enable for Port F Bit 1 */
    byte PTFSRE2     :1;                                       /* Output Slew Rate Enable for Port F Bit 2 */
    byte PTFSRE3     :1;                                       /* Output Slew Rate Enable for Port F Bit 3 */
    byte PTFSRE4     :1;                                       /* Output Slew Rate Enable for Port F Bit 4 */
    byte PTFSRE5     :1;                                       /* Output Slew Rate Enable for Port F Bit 5 */
    byte PTFSRE6     :1;                                       /* Output Slew Rate Enable for Port F Bit 6 */
    byte PTFSRE7     :1;                                       /* Output Slew Rate Enable for Port F Bit 7 */
  } Bits;
} PTFSRESTR;
extern volatile PTFSRESTR _PTFSRE @0xFFFF8153;
#define PTFSRE                          _PTFSRE.Byte
#define PTFSRE_PTFSRE0                  _PTFSRE.Bits.PTFSRE0
#define PTFSRE_PTFSRE1                  _PTFSRE.Bits.PTFSRE1
#define PTFSRE_PTFSRE2                  _PTFSRE.Bits.PTFSRE2
#define PTFSRE_PTFSRE3                  _PTFSRE.Bits.PTFSRE3
#define PTFSRE_PTFSRE4                  _PTFSRE.Bits.PTFSRE4
#define PTFSRE_PTFSRE5                  _PTFSRE.Bits.PTFSRE5
#define PTFSRE_PTFSRE6                  _PTFSRE.Bits.PTFSRE6
#define PTFSRE_PTFSRE7                  _PTFSRE.Bits.PTFSRE7

#define PTFSRE_PTFSRE0_MASK             1
#define PTFSRE_PTFSRE1_MASK             2
#define PTFSRE_PTFSRE2_MASK             4
#define PTFSRE_PTFSRE3_MASK             8
#define PTFSRE_PTFSRE4_MASK             16
#define PTFSRE_PTFSRE5_MASK             32
#define PTFSRE_PTFSRE6_MASK             64
#define PTFSRE_PTFSRE7_MASK             128


/*** PTFPFE - Port F Passive Filter Enable Register; 0xFFFF8154 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTFPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTFPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTFPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTFPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTFPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTFPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTFPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTFPFESTR;
extern volatile PTFPFESTR _PTFPFE @0xFFFF8154;
#define PTFPFE                          _PTFPFE.Byte
#define PTFPFE_PTFPFE0                  _PTFPFE.Bits.PTFPFE0
#define PTFPFE_PTFPFE1                  _PTFPFE.Bits.PTFPFE1
#define PTFPFE_PTFPFE2                  _PTFPFE.Bits.PTFPFE2
#define PTFPFE_PTFPFE3                  _PTFPFE.Bits.PTFPFE3
#define PTFPFE_PTFPFE4                  _PTFPFE.Bits.PTFPFE4
#define PTFPFE_PTFPFE5                  _PTFPFE.Bits.PTFPFE5
#define PTFPFE_PTFPFE6                  _PTFPFE.Bits.PTFPFE6
#define PTFPFE_PTFPFE7                  _PTFPFE.Bits.PTFPFE7

#define PTFPFE_PTFPFE0_MASK             1
#define PTFPFE_PTFPFE1_MASK             2
#define PTFPFE_PTFPFE2_MASK             4
#define PTFPFE_PTFPFE3_MASK             8
#define PTFPFE_PTFPFE4_MASK             16
#define PTFPFE_PTFPFE5_MASK             32
#define PTFPFE_PTFPFE6_MASK             64
#define PTFPFE_PTFPFE7_MASK             128


