AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTFIC - Port F Interrupt Control Register; 0xFFFF8155 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTFIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTFDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTFICSTR;
extern volatile PTFICSTR _PTFIC @0xFFFF8155;
#define PTFIC                           _PTFIC.Byte
#define PTFIC_PTFMOD                    _PTFIC.Bits.PTFMOD
#define PTFIC_PTFIE                     _PTFIC.Bits.PTFIE
#define PTFIC_PTFDMAEN                  _PTFIC.Bits.PTFDMAEN

#define PTFIC_PTFMOD_MASK               1
#define PTFIC_PTFIE_MASK                2
#define PTFIC_PTFDMAEN_MASK             128


/*** PTFIPE - Port F Interrupt Pin Enable Register; 0xFFFF8156 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTFIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTFIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTFIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTFIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTFIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTFIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTFIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTFIPESTR;
extern volatile PTFIPESTR _PTFIPE @0xFFFF8156;
#define PTFIPE                          _PTFIPE.Byte
#define PTFIPE_PTFIPE0                  _PTFIPE.Bits.PTFIPE0
#define PTFIPE_PTFIPE1                  _PTFIPE.Bits.PTFIPE1
#define PTFIPE_PTFIPE2                  _PTFIPE.Bits.PTFIPE2
#define PTFIPE_PTFIPE3                  _PTFIPE.Bits.PTFIPE3
#define PTFIPE_PTFIPE4                  _PTFIPE.Bits.PTFIPE4
#define PTFIPE_PTFIPE5                  _PTFIPE.Bits.PTFIPE5
#define PTFIPE_PTFIPE6                  _PTFIPE.Bits.PTFIPE6
#define PTFIPE_PTFIPE7                  _PTFIPE.Bits.PTFIPE7

#define PTFIPE_PTFIPE0_MASK             1
#define PTFIPE_PTFIPE1_MASK             2
#define PTFIPE_PTFIPE2_MASK             4
#define PTFIPE_PTFIPE3_MASK             8
#define PTFIPE_PTFIPE4_MASK             16
#define PTFIPE_PTFIPE5_MASK             32
#define PTFIPE_PTFIPE6_MASK             64
#define PTFIPE_PTFIPE7_MASK             128


/*** PTFIF - Port F Interrupt Flag Register; 0xFFFF8157 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTFIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTFIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTFIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTFIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTFIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTFIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTFIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTFIFSTR;
extern volatile PTFIFSTR _PTFIF @0xFFFF8157;
#define PTFIF                           _PTFIF.Byte
#define PTFIF_PTFIF0                    _PTFIF.Bits.PTFIF0
#define PTFIF_PTFIF1                    _PTFIF.Bits.PTFIF1
#define PTFIF_PTFIF2                    _PTFIF.Bits.PTFIF2
#define PTFIF_PTFIF3                    _PTFIF.Bits.PTFIF3
#define PTFIF_PTFIF4                    _PTFIF.Bits.PTFIF4
#define PTFIF_PTFIF5                    _PTFIF.Bits.PTFIF5
#define PTFIF_PTFIF6                    _PTFIF.Bits.PTFIF6
#define PTFIF_PTFIF7                    _PTFIF.Bits.PTFIF7

#define PTFIF_PTFIF0_MASK               1
#define PTFIF_PTFIF1_MASK               2
#define PTFIF_PTFIF2_MASK               4
#define PTFIF_PTFIF3_MASK               8
#define PTFIF_PTFIF4_MASK               16
#define PTFIF_PTFIF5_MASK               32
#define PTFIF_PTFIF6_MASK               64
#define PTFIF_PTFIF7_MASK               128


/*** PTFIES - Port F Interrupt Edge Select Register; 0xFFFF8158 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTFEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTFEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTFEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTFEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTFEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTFEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTFEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTFIESSTR;
extern volatile PTFIESSTR _PTFIES @0xFFFF8158;
#define PTFIES                          _PTFIES.Byte
#define PTFIES_PTFEDG0                  _PTFIES.Bits.PTFEDG0
#define PTFIES_PTFEDG1                  _PTFIES.Bits.PTFEDG1
#define PTFIES_PTFEDG2                  _PTFIES.Bits.PTFEDG2
#define PTFIES_PTFEDG3                  _PTFIES.Bits.PTFEDG3
#define PTFIES_PTFEDG4                  _PTFIES.Bits.PTFEDG4
#define PTFIES_PTFEDG5                  _PTFIES.Bits.PTFEDG5
#define PTFIES_PTFEDG6                  _PTFIES.Bits.PTFEDG6
#define PTFIES_PTFEDG7                  _PTFIES.Bits.PTFEDG7

#define PTFIES_PTFEDG0_MASK             1
#define PTFIES_PTFEDG1_MASK             2
#define PTFIES_PTFEDG2_MASK             4
#define PTFIES_PTFEDG3_MASK             8
#define PTFIES_PTFEDG4_MASK             16
#define PTFIES_PTFEDG5_MASK             32
#define PTFIES_PTFEDG6_MASK             64
#define PTFIES_PTFEDG7_MASK             128


/*** PTFDFE - Port F Digital Filter Enable Register; 0xFFFF8159 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTFDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTFDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTFDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTFDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTFDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTFDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTFDFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTFDFESTR;
