AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTFDFESTR _PTFDFE @0xFFFF8159;
#define PTFDFE                          _PTFDFE.Byte
#define PTFDFE_PTFDFE0                  _PTFDFE.Bits.PTFDFE0
#define PTFDFE_PTFDFE1                  _PTFDFE.Bits.PTFDFE1
#define PTFDFE_PTFDFE2                  _PTFDFE.Bits.PTFDFE2
#define PTFDFE_PTFDFE3                  _PTFDFE.Bits.PTFDFE3
#define PTFDFE_PTFDFE4                  _PTFDFE.Bits.PTFDFE4
#define PTFDFE_PTFDFE5                  _PTFDFE.Bits.PTFDFE5
#define PTFDFE_PTFDFE6                  _PTFDFE.Bits.PTFDFE6
#define PTFDFE_PTFDFE7                  _PTFDFE.Bits.PTFDFE7

#define PTFDFE_PTFDFE0_MASK             1
#define PTFDFE_PTFDFE1_MASK             2
#define PTFDFE_PTFDFE2_MASK             4
#define PTFDFE_PTFDFE3_MASK             8
#define PTFDFE_PTFDFE4_MASK             16
#define PTFDFE_PTFDFE5_MASK             32
#define PTFDFE_PTFDFE6_MASK             64
#define PTFDFE_PTFDFE7_MASK             128


/*** PTFDFC - Port F Digital Filter Control Register; 0xFFFF815A ***/
typedef union {
  byte Byte;
  struct {
    byte PTFFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTFFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTFFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTFFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTFFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTFCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTFFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTFDFCSTR;
extern volatile PTFDFCSTR _PTFDFC @0xFFFF815A;
#define PTFDFC                          _PTFDFC.Byte
#define PTFDFC_PTFFF0                   _PTFDFC.Bits.PTFFF0
#define PTFDFC_PTFFF1                   _PTFDFC.Bits.PTFFF1
#define PTFDFC_PTFFF2                   _PTFDFC.Bits.PTFFF2
#define PTFDFC_PTFFF3                   _PTFDFC.Bits.PTFFF3
#define PTFDFC_PTFFF4                   _PTFDFC.Bits.PTFFF4
#define PTFDFC_PTFCLKS                  _PTFDFC.Bits.PTFCLKS
#define PTFDFC_PTFFF                    _PTFDFC.MergedBits.grpPTFFF

#define PTFDFC_PTFFF0_MASK              1
#define PTFDFC_PTFFF1_MASK              2
#define PTFDFC_PTFFF2_MASK              4
#define PTFDFC_PTFFF3_MASK              8
#define PTFDFC_PTFFF4_MASK              16
#define PTFDFC_PTFCLKS_MASK             128
#define PTFDFC_PTFFF_MASK               31
#define PTFDFC_PTFFF_BITNUM             0


/*** PTGPUE - Port G Pulling Enable Register; 0xFFFF8160 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPUE0     :1;                                       /* Internal Pulling Enable for Port G Bit 0 */
    byte PTGPUE1     :1;                                       /* Internal Pulling Enable for Port G Bit 1 */
    byte PTGPUE2     :1;                                       /* Internal Pulling Enable for Port G Bit 2 */
    byte PTGPUE3     :1;                                       /* Internal Pulling Enable for Port G Bit 3 */
    byte PTGPUE4     :1;                                       /* Internal Pulling Enable for Port G Bit 4 */
    byte PTGPUE5     :1;                                       /* Internal Pulling Enable for Port G Bit 5 */
    byte PTGPUE6     :1;                                       /* Internal Pulling Enable for Port G Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGPUE :7;
    byte         :1;
  } MergedBits;
} PTGPUESTR;
extern volatile PTGPUESTR _PTGPUE @0xFFFF8160;
#define PTGPUE                          _PTGPUE.Byte
#define PTGPUE_PTGPUE0                  _PTGPUE.Bits.PTGPUE0
#define PTGPUE_PTGPUE1                  _PTGPUE.Bits.PTGPUE1
#define PTGPUE_PTGPUE2                  _PTGPUE.Bits.PTGPUE2
#define PTGPUE_PTGPUE3                  _PTGPUE.Bits.PTGPUE3
#define PTGPUE_PTGPUE4                  _PTGPUE.Bits.PTGPUE4
#define PTGPUE_PTGPUE5                  _PTGPUE.Bits.PTGPUE5
#define PTGPUE_PTGPUE6                  _PTGPUE.Bits.PTGPUE6
#define PTGPUE_PTGPUE                   _PTGPUE.MergedBits.grpPTGPUE

#define PTGPUE_PTGPUE0_MASK             1
#define PTGPUE_PTGPUE1_MASK             2
#define PTGPUE_PTGPUE2_MASK             4
#define PTGPUE_PTGPUE3_MASK             8
#define PTGPUE_PTGPUE4_MASK             16
#define PTGPUE_PTGPUE5_MASK             32
#define PTGPUE_PTGPUE6_MASK             64
#define PTGPUE_PTGPUE_MASK              127
#define PTGPUE_PTGPUE_BITNUM            0


/*** PTGPUS - Port G Pullup/Pulldown Select Register; 0xFFFF8161 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTGPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTGPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTGPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTGPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTGPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTGPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGPUS :7;
    byte         :1;
  } MergedBits;
} PTGPUSSTR;
extern volatile PTGPUSSTR _PTGPUS @0xFFFF8161;
#define PTGPUS                          _PTGPUS.Byte
#define PTGPUS_PTGPUS0                  _PTGPUS.Bits.PTGPUS0
#define PTGPUS_PTGPUS1                  _PTGPUS.Bits.PTGPUS1
#define PTGPUS_PTGPUS2                  _PTGPUS.Bits.PTGPUS2
#define PTGPUS_PTGPUS3                  _PTGPUS.Bits.PTGPUS3
#define PTGPUS_PTGPUS4                  _PTGPUS.Bits.PTGPUS4
#define PTGPUS_PTGPUS5                  _PTGPUS.Bits.PTGPUS5
#define PTGPUS_PTGPUS6                  _PTGPUS.Bits.PTGPUS6
#define PTGPUS_PTGPUS                   _PTGPUS.MergedBits.grpPTGPUS

#define PTGPUS_PTGPUS0_MASK             1
#define PTGPUS_PTGPUS1_MASK             2
#define PTGPUS_PTGPUS2_MASK             4
#define PTGPUS_PTGPUS3_MASK             8
#define PTGPUS_PTGPUS4_MASK             16
#define PTGPUS_PTGPUS5_MASK             32
#define PTGPUS_PTGPUS6_MASK             64
#define PTGPUS_PTGPUS_MASK              127
#define PTGPUS_PTGPUS_BITNUM            0


