AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTGDS - Port G Drive Strength Selection Register; 0xFFFF8162 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGDS0      :1;                                       /* Output Drive Strength Selection for Port G Bit 0 */
    byte PTGDS1      :1;                                       /* Output Drive Strength Selection for Port G Bit 1 */
    byte PTGDS2      :1;                                       /* Output Drive Strength Selection for Port G Bit 2 */
    byte PTGDS3      :1;                                       /* Output Drive Strength Selection for Port G Bit 3 */
    byte PTGDS4      :1;                                       /* Output Drive Strength Selection for Port G Bit 4 */
    byte PTGDS5      :1;                                       /* Output Drive Strength Selection for Port G Bit 5 */
    byte PTGDS6      :1;                                       /* Output Drive Strength Selection for Port G Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGDS :7;
    byte         :1;
  } MergedBits;
} PTGDSSTR;
extern volatile PTGDSSTR _PTGDS @0xFFFF8162;
#define PTGDS                           _PTGDS.Byte
#define PTGDS_PTGDS0                    _PTGDS.Bits.PTGDS0
#define PTGDS_PTGDS1                    _PTGDS.Bits.PTGDS1
#define PTGDS_PTGDS2                    _PTGDS.Bits.PTGDS2
#define PTGDS_PTGDS3                    _PTGDS.Bits.PTGDS3
#define PTGDS_PTGDS4                    _PTGDS.Bits.PTGDS4
#define PTGDS_PTGDS5                    _PTGDS.Bits.PTGDS5
#define PTGDS_PTGDS6                    _PTGDS.Bits.PTGDS6
#define PTGDS_PTGDS                     _PTGDS.MergedBits.grpPTGDS

#define PTGDS_PTGDS0_MASK               1
#define PTGDS_PTGDS1_MASK               2
#define PTGDS_PTGDS2_MASK               4
#define PTGDS_PTGDS3_MASK               8
#define PTGDS_PTGDS4_MASK               16
#define PTGDS_PTGDS5_MASK               32
#define PTGDS_PTGDS6_MASK               64
#define PTGDS_PTGDS_MASK                127
#define PTGDS_PTGDS_BITNUM              0


/*** PTGSRE - Port G Slew Rate Enable Register; 0xFFFF8163 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGSRE0     :1;                                       /* Output Slew Rate Enable for Port G Bit 0 */
    byte PTGSRE1     :1;                                       /* Output Slew Rate Enable for Port G Bit 1 */
    byte PTGSRE2     :1;                                       /* Output Slew Rate Enable for Port G Bit 2 */
    byte PTGSRE3     :1;                                       /* Output Slew Rate Enable for Port G Bit 3 */
    byte PTGSRE4     :1;                                       /* Output Slew Rate Enable for Port G Bit 4 */
    byte PTGSRE5     :1;                                       /* Output Slew Rate Enable for Port G Bit 5 */
    byte PTGSRE6     :1;                                       /* Output Slew Rate Enable for Port G Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGSRE :7;
    byte         :1;
  } MergedBits;
} PTGSRESTR;
extern volatile PTGSRESTR _PTGSRE @0xFFFF8163;
#define PTGSRE                          _PTGSRE.Byte
#define PTGSRE_PTGSRE0                  _PTGSRE.Bits.PTGSRE0
#define PTGSRE_PTGSRE1                  _PTGSRE.Bits.PTGSRE1
#define PTGSRE_PTGSRE2                  _PTGSRE.Bits.PTGSRE2
#define PTGSRE_PTGSRE3                  _PTGSRE.Bits.PTGSRE3
#define PTGSRE_PTGSRE4                  _PTGSRE.Bits.PTGSRE4
#define PTGSRE_PTGSRE5                  _PTGSRE.Bits.PTGSRE5
#define PTGSRE_PTGSRE6                  _PTGSRE.Bits.PTGSRE6
#define PTGSRE_PTGSRE                   _PTGSRE.MergedBits.grpPTGSRE

#define PTGSRE_PTGSRE0_MASK             1
#define PTGSRE_PTGSRE1_MASK             2
#define PTGSRE_PTGSRE2_MASK             4
#define PTGSRE_PTGSRE3_MASK             8
#define PTGSRE_PTGSRE4_MASK             16
#define PTGSRE_PTGSRE5_MASK             32
#define PTGSRE_PTGSRE6_MASK             64
#define PTGSRE_PTGSRE_MASK              127
#define PTGSRE_PTGSRE_BITNUM            0


/*** PTGPFE - Port G Passive Filter Enable Register; 0xFFFF8164 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTGPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTGPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTGPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTGPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTGPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTGPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGPFE :7;
    byte         :1;
  } MergedBits;
} PTGPFESTR;
extern volatile PTGPFESTR _PTGPFE @0xFFFF8164;
#define PTGPFE                          _PTGPFE.Byte
#define PTGPFE_PTGPFE0                  _PTGPFE.Bits.PTGPFE0
#define PTGPFE_PTGPFE1                  _PTGPFE.Bits.PTGPFE1
#define PTGPFE_PTGPFE2                  _PTGPFE.Bits.PTGPFE2
#define PTGPFE_PTGPFE3                  _PTGPFE.Bits.PTGPFE3
#define PTGPFE_PTGPFE4                  _PTGPFE.Bits.PTGPFE4
#define PTGPFE_PTGPFE5                  _PTGPFE.Bits.PTGPFE5
#define PTGPFE_PTGPFE6                  _PTGPFE.Bits.PTGPFE6
#define PTGPFE_PTGPFE                   _PTGPFE.MergedBits.grpPTGPFE

#define PTGPFE_PTGPFE0_MASK             1
#define PTGPFE_PTGPFE1_MASK             2
#define PTGPFE_PTGPFE2_MASK             4
#define PTGPFE_PTGPFE3_MASK             8
#define PTGPFE_PTGPFE4_MASK             16
#define PTGPFE_PTGPFE5_MASK             32
#define PTGPFE_PTGPFE6_MASK             64
#define PTGPFE_PTGPFE_MASK              127
#define PTGPFE_PTGPFE_BITNUM            0


/*** PTGIC - Port G Interrupt Control Register; 0xFFFF8165 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTGIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTGDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTGICSTR;
extern volatile PTGICSTR _PTGIC @0xFFFF8165;
#define PTGIC                           _PTGIC.Byte
#define PTGIC_PTGMOD                    _PTGIC.Bits.PTGMOD
#define PTGIC_PTGIE                     _PTGIC.Bits.PTGIE
#define PTGIC_PTGDMAEN                  _PTGIC.Bits.PTGDMAEN

