AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTGIC_PTGMOD_MASK               1
#define PTGIC_PTGIE_MASK                2
#define PTGIC_PTGDMAEN_MASK             128


/*** PTGIPE - Port G Interrupt Pin Enable Register; 0xFFFF8166 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTGIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTGIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTGIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTGIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTGIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTGIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGIPE :7;
    byte         :1;
  } MergedBits;
} PTGIPESTR;
extern volatile PTGIPESTR _PTGIPE @0xFFFF8166;
#define PTGIPE                          _PTGIPE.Byte
#define PTGIPE_PTGIPE0                  _PTGIPE.Bits.PTGIPE0
#define PTGIPE_PTGIPE1                  _PTGIPE.Bits.PTGIPE1
#define PTGIPE_PTGIPE2                  _PTGIPE.Bits.PTGIPE2
#define PTGIPE_PTGIPE3                  _PTGIPE.Bits.PTGIPE3
#define PTGIPE_PTGIPE4                  _PTGIPE.Bits.PTGIPE4
#define PTGIPE_PTGIPE5                  _PTGIPE.Bits.PTGIPE5
#define PTGIPE_PTGIPE6                  _PTGIPE.Bits.PTGIPE6
#define PTGIPE_PTGIPE                   _PTGIPE.MergedBits.grpPTGIPE

#define PTGIPE_PTGIPE0_MASK             1
#define PTGIPE_PTGIPE1_MASK             2
#define PTGIPE_PTGIPE2_MASK             4
#define PTGIPE_PTGIPE3_MASK             8
#define PTGIPE_PTGIPE4_MASK             16
#define PTGIPE_PTGIPE5_MASK             32
#define PTGIPE_PTGIPE6_MASK             64
#define PTGIPE_PTGIPE_MASK              127
#define PTGIPE_PTGIPE_BITNUM            0


/*** PTGIF - Port G Interrupt Flag Register; 0xFFFF8167 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTGIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTGIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTGIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTGIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTGIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTGIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGIF :7;
    byte         :1;
  } MergedBits;
} PTGIFSTR;
extern volatile PTGIFSTR _PTGIF @0xFFFF8167;
#define PTGIF                           _PTGIF.Byte
#define PTGIF_PTGIF0                    _PTGIF.Bits.PTGIF0
#define PTGIF_PTGIF1                    _PTGIF.Bits.PTGIF1
#define PTGIF_PTGIF2                    _PTGIF.Bits.PTGIF2
#define PTGIF_PTGIF3                    _PTGIF.Bits.PTGIF3
#define PTGIF_PTGIF4                    _PTGIF.Bits.PTGIF4
#define PTGIF_PTGIF5                    _PTGIF.Bits.PTGIF5
#define PTGIF_PTGIF6                    _PTGIF.Bits.PTGIF6
#define PTGIF_PTGIF                     _PTGIF.MergedBits.grpPTGIF

#define PTGIF_PTGIF0_MASK               1
#define PTGIF_PTGIF1_MASK               2
#define PTGIF_PTGIF2_MASK               4
#define PTGIF_PTGIF3_MASK               8
#define PTGIF_PTGIF4_MASK               16
#define PTGIF_PTGIF5_MASK               32
#define PTGIF_PTGIF6_MASK               64
#define PTGIF_PTGIF_MASK                127
#define PTGIF_PTGIF_BITNUM              0


/*** PTGIES - Port G Interrupt Edge Select Register; 0xFFFF8168 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTGEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTGEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTGEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTGEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTGEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTGEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGEDG :7;
    byte         :1;
  } MergedBits;
} PTGIESSTR;
extern volatile PTGIESSTR _PTGIES @0xFFFF8168;
#define PTGIES                          _PTGIES.Byte
#define PTGIES_PTGEDG0                  _PTGIES.Bits.PTGEDG0
#define PTGIES_PTGEDG1                  _PTGIES.Bits.PTGEDG1
#define PTGIES_PTGEDG2                  _PTGIES.Bits.PTGEDG2
#define PTGIES_PTGEDG3                  _PTGIES.Bits.PTGEDG3
#define PTGIES_PTGEDG4                  _PTGIES.Bits.PTGEDG4
#define PTGIES_PTGEDG5                  _PTGIES.Bits.PTGEDG5
#define PTGIES_PTGEDG6                  _PTGIES.Bits.PTGEDG6
#define PTGIES_PTGEDG                   _PTGIES.MergedBits.grpPTGEDG

#define PTGIES_PTGEDG0_MASK             1
#define PTGIES_PTGEDG1_MASK             2
#define PTGIES_PTGEDG2_MASK             4
#define PTGIES_PTGEDG3_MASK             8
#define PTGIES_PTGEDG4_MASK             16
#define PTGIES_PTGEDG5_MASK             32
#define PTGIES_PTGEDG6_MASK             64
#define PTGIES_PTGEDG_MASK              127
#define PTGIES_PTGEDG_BITNUM            0


/*** PTGDFE - Port G Digital Filter Enable Register; 0xFFFF8169 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTGDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTGDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTGDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTGDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTGDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTGDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGDFE :7;
    byte         :1;
  } MergedBits;
} PTGDFESTR;
extern volatile PTGDFESTR _PTGDFE @0xFFFF8169;
#define PTGDFE                          _PTGDFE.Byte
#define PTGDFE_PTGDFE0                  _PTGDFE.Bits.PTGDFE0
#define PTGDFE_PTGDFE1                  _PTGDFE.Bits.PTGDFE1
#define PTGDFE_PTGDFE2                  _PTGDFE.Bits.PTGDFE2
#define PTGDFE_PTGDFE3                  _PTGDFE.Bits.PTGDFE3
#define PTGDFE_PTGDFE4                  _PTGDFE.Bits.PTGDFE4
#define PTGDFE_PTGDFE5                  _PTGDFE.Bits.PTGDFE5
#define PTGDFE_PTGDFE6                  _PTGDFE.Bits.PTGDFE6
#define PTGDFE_PTGDFE                   _PTGDFE.MergedBits.grpPTGDFE

#define PTGDFE_PTGDFE0_MASK             1
#define PTGDFE_PTGDFE1_MASK             2
#define PTGDFE_PTGDFE2_MASK             4
#define PTGDFE_PTGDFE3_MASK             8
#define PTGDFE_PTGDFE4_MASK             16
#define PTGDFE_PTGDFE5_MASK             32
#define PTGDFE_PTGDFE6_MASK             64
#define PTGDFE_PTGDFE_MASK              127
#define PTGDFE_PTGDFE_BITNUM            0


/*** PTGDFC - Port G Digital Filter Control Register; 0xFFFF816A ***/
typedef union {
  byte Byte;
  struct {
    byte PTGFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTGFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTGFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTGFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTGFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTGCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTGFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTGDFCSTR;
extern volatile PTGDFCSTR _PTGDFC @0xFFFF816A;
#define PTGDFC                          _PTGDFC.Byte
#define PTGDFC_PTGFF0                   _PTGDFC.Bits.PTGFF0
#define PTGDFC_PTGFF1                   _PTGDFC.Bits.PTGFF1
#define PTGDFC_PTGFF2                   _PTGDFC.Bits.PTGFF2
#define PTGDFC_PTGFF3                   _PTGDFC.Bits.PTGFF3
#define PTGDFC_PTGFF4                   _PTGDFC.Bits.PTGFF4
#define PTGDFC_PTGCLKS                  _PTGDFC.Bits.PTGCLKS
#define PTGDFC_PTGFF                    _PTGDFC.MergedBits.grpPTGFF

#define PTGDFC_PTGFF0_MASK              1
#define PTGDFC_PTGFF1_MASK              2
#define PTGDFC_PTGFF2_MASK              4
#define PTGDFC_PTGFF3_MASK              8
#define PTGDFC_PTGFF4_MASK              16
#define PTGDFC_PTGCLKS_MASK             128
#define PTGDFC_PTGFF_MASK               31
#define PTGDFC_PTGFF_BITNUM             0


/*** PTHPUE - Port H Pulling Enable Register; 0xFFFF8170 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHPUE0     :1;                                       /* Internal Pulling Enable for Port H Bit 0 */
    byte PTHPUE1     :1;                                       /* Internal Pulling Enable for Port H Bit 1 */
    byte PTHPUE2     :1;                                       /* Internal Pulling Enable for Port H Bit 2 */
    byte PTHPUE3     :1;                                       /* Internal Pulling Enable for Port H Bit 3 */
    byte PTHPUE4     :1;                                       /* Internal Pulling Enable for Port H Bit 4 */
    byte PTHPUE5     :1;                                       /* Internal Pulling Enable for Port H Bit 5 */
    byte PTHPUE6     :1;                                       /* Internal Pulling Enable for Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHPUE :7;
    byte         :1;
  } MergedBits;
} PTHPUESTR;
