AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTHPUESTR _PTHPUE @0xFFFF8170;
#define PTHPUE                          _PTHPUE.Byte
#define PTHPUE_PTHPUE0                  _PTHPUE.Bits.PTHPUE0
#define PTHPUE_PTHPUE1                  _PTHPUE.Bits.PTHPUE1
#define PTHPUE_PTHPUE2                  _PTHPUE.Bits.PTHPUE2
#define PTHPUE_PTHPUE3                  _PTHPUE.Bits.PTHPUE3
#define PTHPUE_PTHPUE4                  _PTHPUE.Bits.PTHPUE4
#define PTHPUE_PTHPUE5                  _PTHPUE.Bits.PTHPUE5
#define PTHPUE_PTHPUE6                  _PTHPUE.Bits.PTHPUE6
#define PTHPUE_PTHPUE                   _PTHPUE.MergedBits.grpPTHPUE

#define PTHPUE_PTHPUE0_MASK             1
#define PTHPUE_PTHPUE1_MASK             2
#define PTHPUE_PTHPUE2_MASK             4
#define PTHPUE_PTHPUE3_MASK             8
#define PTHPUE_PTHPUE4_MASK             16
#define PTHPUE_PTHPUE5_MASK             32
#define PTHPUE_PTHPUE6_MASK             64
#define PTHPUE_PTHPUE_MASK              127
#define PTHPUE_PTHPUE_BITNUM            0


/*** PTHPUS - Port H Pullup/Pulldown Select Register; 0xFFFF8171 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTHPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTHPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTHPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTHPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTHPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTHPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHPUS :7;
    byte         :1;
  } MergedBits;
} PTHPUSSTR;
extern volatile PTHPUSSTR _PTHPUS @0xFFFF8171;
#define PTHPUS                          _PTHPUS.Byte
#define PTHPUS_PTHPUS0                  _PTHPUS.Bits.PTHPUS0
#define PTHPUS_PTHPUS1                  _PTHPUS.Bits.PTHPUS1
#define PTHPUS_PTHPUS2                  _PTHPUS.Bits.PTHPUS2
#define PTHPUS_PTHPUS3                  _PTHPUS.Bits.PTHPUS3
#define PTHPUS_PTHPUS4                  _PTHPUS.Bits.PTHPUS4
#define PTHPUS_PTHPUS5                  _PTHPUS.Bits.PTHPUS5
#define PTHPUS_PTHPUS6                  _PTHPUS.Bits.PTHPUS6
#define PTHPUS_PTHPUS                   _PTHPUS.MergedBits.grpPTHPUS

#define PTHPUS_PTHPUS0_MASK             1
#define PTHPUS_PTHPUS1_MASK             2
#define PTHPUS_PTHPUS2_MASK             4
#define PTHPUS_PTHPUS3_MASK             8
#define PTHPUS_PTHPUS4_MASK             16
#define PTHPUS_PTHPUS5_MASK             32
#define PTHPUS_PTHPUS6_MASK             64
#define PTHPUS_PTHPUS_MASK              127
#define PTHPUS_PTHPUS_BITNUM            0


/*** PTHDS - Port H Drive Strength Selection Register; 0xFFFF8172 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHDS0      :1;                                       /* Output Drive Strength Selection for Port H Bit 0 */
    byte PTHDS1      :1;                                       /* Output Drive Strength Selection for Port H Bit 1 */
    byte PTHDS2      :1;                                       /* Output Drive Strength Selection for Port H Bit 2 */
    byte PTHDS3      :1;                                       /* Output Drive Strength Selection for Port H Bit 3 */
    byte PTHDS4      :1;                                       /* Output Drive Strength Selection for Port H Bit 4 */
    byte PTHDS5      :1;                                       /* Output Drive Strength Selection for Port H Bit 5 */
    byte PTHDS6      :1;                                       /* Output Drive Strength Selection for Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHDS :7;
    byte         :1;
  } MergedBits;
} PTHDSSTR;
extern volatile PTHDSSTR _PTHDS @0xFFFF8172;
#define PTHDS                           _PTHDS.Byte
#define PTHDS_PTHDS0                    _PTHDS.Bits.PTHDS0
#define PTHDS_PTHDS1                    _PTHDS.Bits.PTHDS1
#define PTHDS_PTHDS2                    _PTHDS.Bits.PTHDS2
#define PTHDS_PTHDS3                    _PTHDS.Bits.PTHDS3
#define PTHDS_PTHDS4                    _PTHDS.Bits.PTHDS4
#define PTHDS_PTHDS5                    _PTHDS.Bits.PTHDS5
#define PTHDS_PTHDS6                    _PTHDS.Bits.PTHDS6
#define PTHDS_PTHDS                     _PTHDS.MergedBits.grpPTHDS

#define PTHDS_PTHDS0_MASK               1
#define PTHDS_PTHDS1_MASK               2
#define PTHDS_PTHDS2_MASK               4
#define PTHDS_PTHDS3_MASK               8
#define PTHDS_PTHDS4_MASK               16
#define PTHDS_PTHDS5_MASK               32
#define PTHDS_PTHDS6_MASK               64
#define PTHDS_PTHDS_MASK                127
#define PTHDS_PTHDS_BITNUM              0


/*** PTHSRE - Port H Slew Rate Enable Register; 0xFFFF8173 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHSRE0     :1;                                       /* Output Slew Rate Enable for Port H Bit 0 */
    byte PTHSRE1     :1;                                       /* Output Slew Rate Enable for Port H Bit 1 */
    byte PTHSRE2     :1;                                       /* Output Slew Rate Enable for Port H Bit 2 */
    byte PTHSRE3     :1;                                       /* Output Slew Rate Enable for Port H Bit 3 */
    byte PTHSRE4     :1;                                       /* Output Slew Rate Enable for Port H Bit 4 */
    byte PTHSRE5     :1;                                       /* Output Slew Rate Enable for Port H Bit 5 */
    byte PTHSRE6     :1;                                       /* Output Slew Rate Enable for Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHSRE :7;
    byte         :1;
  } MergedBits;
} PTHSRESTR;
extern volatile PTHSRESTR _PTHSRE @0xFFFF8173;
#define PTHSRE                          _PTHSRE.Byte
#define PTHSRE_PTHSRE0                  _PTHSRE.Bits.PTHSRE0
#define PTHSRE_PTHSRE1                  _PTHSRE.Bits.PTHSRE1
#define PTHSRE_PTHSRE2                  _PTHSRE.Bits.PTHSRE2
#define PTHSRE_PTHSRE3                  _PTHSRE.Bits.PTHSRE3
#define PTHSRE_PTHSRE4                  _PTHSRE.Bits.PTHSRE4
#define PTHSRE_PTHSRE5                  _PTHSRE.Bits.PTHSRE5
#define PTHSRE_PTHSRE6                  _PTHSRE.Bits.PTHSRE6
#define PTHSRE_PTHSRE                   _PTHSRE.MergedBits.grpPTHSRE

