AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define PTHSRE_PTHSRE0_MASK             1
#define PTHSRE_PTHSRE1_MASK             2
#define PTHSRE_PTHSRE2_MASK             4
#define PTHSRE_PTHSRE3_MASK             8
#define PTHSRE_PTHSRE4_MASK             16
#define PTHSRE_PTHSRE5_MASK             32
#define PTHSRE_PTHSRE6_MASK             64
#define PTHSRE_PTHSRE_MASK              127
#define PTHSRE_PTHSRE_BITNUM            0


/*** PTHPFE - Port H Passive Filter Enable Register; 0xFFFF8174 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTHPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTHPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTHPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTHPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTHPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTHPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHPFE :7;
    byte         :1;
  } MergedBits;
} PTHPFESTR;
extern volatile PTHPFESTR _PTHPFE @0xFFFF8174;
#define PTHPFE                          _PTHPFE.Byte
#define PTHPFE_PTHPFE0                  _PTHPFE.Bits.PTHPFE0
#define PTHPFE_PTHPFE1                  _PTHPFE.Bits.PTHPFE1
#define PTHPFE_PTHPFE2                  _PTHPFE.Bits.PTHPFE2
#define PTHPFE_PTHPFE3                  _PTHPFE.Bits.PTHPFE3
#define PTHPFE_PTHPFE4                  _PTHPFE.Bits.PTHPFE4
#define PTHPFE_PTHPFE5                  _PTHPFE.Bits.PTHPFE5
#define PTHPFE_PTHPFE6                  _PTHPFE.Bits.PTHPFE6
#define PTHPFE_PTHPFE                   _PTHPFE.MergedBits.grpPTHPFE

#define PTHPFE_PTHPFE0_MASK             1
#define PTHPFE_PTHPFE1_MASK             2
#define PTHPFE_PTHPFE2_MASK             4
#define PTHPFE_PTHPFE3_MASK             8
#define PTHPFE_PTHPFE4_MASK             16
#define PTHPFE_PTHPFE5_MASK             32
#define PTHPFE_PTHPFE6_MASK             64
#define PTHPFE_PTHPFE_MASK              127
#define PTHPFE_PTHPFE_BITNUM            0


/*** PTHIC - Port H Interrupt Control Register; 0xFFFF8175 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTHIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTHICSTR;
extern volatile PTHICSTR _PTHIC @0xFFFF8175;
#define PTHIC                           _PTHIC.Byte
#define PTHIC_PTHMOD                    _PTHIC.Bits.PTHMOD
#define PTHIC_PTHIE                     _PTHIC.Bits.PTHIE
#define PTHIC_PTHDMAEN                  _PTHIC.Bits.PTHDMAEN

#define PTHIC_PTHMOD_MASK               1
#define PTHIC_PTHIE_MASK                2
#define PTHIC_PTHDMAEN_MASK             128


/*** PTHIPE - Port H Interrupt Pin Enable Register; 0xFFFF8176 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTHIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTHIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTHIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTHIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTHIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTHIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHIPE :7;
    byte         :1;
  } MergedBits;
} PTHIPESTR;
extern volatile PTHIPESTR _PTHIPE @0xFFFF8176;
#define PTHIPE                          _PTHIPE.Byte
#define PTHIPE_PTHIPE0                  _PTHIPE.Bits.PTHIPE0
#define PTHIPE_PTHIPE1                  _PTHIPE.Bits.PTHIPE1
#define PTHIPE_PTHIPE2                  _PTHIPE.Bits.PTHIPE2
#define PTHIPE_PTHIPE3                  _PTHIPE.Bits.PTHIPE3
#define PTHIPE_PTHIPE4                  _PTHIPE.Bits.PTHIPE4
#define PTHIPE_PTHIPE5                  _PTHIPE.Bits.PTHIPE5
#define PTHIPE_PTHIPE6                  _PTHIPE.Bits.PTHIPE6
#define PTHIPE_PTHIPE                   _PTHIPE.MergedBits.grpPTHIPE

#define PTHIPE_PTHIPE0_MASK             1
#define PTHIPE_PTHIPE1_MASK             2
#define PTHIPE_PTHIPE2_MASK             4
#define PTHIPE_PTHIPE3_MASK             8
#define PTHIPE_PTHIPE4_MASK             16
#define PTHIPE_PTHIPE5_MASK             32
#define PTHIPE_PTHIPE6_MASK             64
#define PTHIPE_PTHIPE_MASK              127
#define PTHIPE_PTHIPE_BITNUM            0


/*** PTHIF - Port H Interrupt Flag Register; 0xFFFF8177 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTHIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTHIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTHIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTHIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTHIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTHIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHIF :7;
    byte         :1;
  } MergedBits;
} PTHIFSTR;
extern volatile PTHIFSTR _PTHIF @0xFFFF8177;
#define PTHIF                           _PTHIF.Byte
#define PTHIF_PTHIF0                    _PTHIF.Bits.PTHIF0
#define PTHIF_PTHIF1                    _PTHIF.Bits.PTHIF1
#define PTHIF_PTHIF2                    _PTHIF.Bits.PTHIF2
#define PTHIF_PTHIF3                    _PTHIF.Bits.PTHIF3
#define PTHIF_PTHIF4                    _PTHIF.Bits.PTHIF4
#define PTHIF_PTHIF5                    _PTHIF.Bits.PTHIF5
#define PTHIF_PTHIF6                    _PTHIF.Bits.PTHIF6
#define PTHIF_PTHIF                     _PTHIF.MergedBits.grpPTHIF

#define PTHIF_PTHIF0_MASK               1
#define PTHIF_PTHIF1_MASK               2
#define PTHIF_PTHIF2_MASK               4
#define PTHIF_PTHIF3_MASK               8
#define PTHIF_PTHIF4_MASK               16
#define PTHIF_PTHIF5_MASK               32
#define PTHIF_PTHIF6_MASK               64
#define PTHIF_PTHIF_MASK                127
#define PTHIF_PTHIF_BITNUM              0


/*** PTHIES - Port H Interrupt Edge Select Register; 0xFFFF8178 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTHEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTHEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTHEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTHEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTHEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTHEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHEDG :7;
    byte         :1;
  } MergedBits;
} PTHIESSTR;
extern volatile PTHIESSTR _PTHIES @0xFFFF8178;
#define PTHIES                          _PTHIES.Byte
#define PTHIES_PTHEDG0                  _PTHIES.Bits.PTHEDG0
#define PTHIES_PTHEDG1                  _PTHIES.Bits.PTHEDG1
#define PTHIES_PTHEDG2                  _PTHIES.Bits.PTHEDG2
#define PTHIES_PTHEDG3                  _PTHIES.Bits.PTHEDG3
#define PTHIES_PTHEDG4                  _PTHIES.Bits.PTHEDG4
#define PTHIES_PTHEDG5                  _PTHIES.Bits.PTHEDG5
#define PTHIES_PTHEDG6                  _PTHIES.Bits.PTHEDG6
#define PTHIES_PTHEDG                   _PTHIES.MergedBits.grpPTHEDG

#define PTHIES_PTHEDG0_MASK             1
#define PTHIES_PTHEDG1_MASK             2
#define PTHIES_PTHEDG2_MASK             4
#define PTHIES_PTHEDG3_MASK             8
#define PTHIES_PTHEDG4_MASK             16
#define PTHIES_PTHEDG5_MASK             32
#define PTHIES_PTHEDG6_MASK             64
#define PTHIES_PTHEDG_MASK              127
#define PTHIES_PTHEDG_BITNUM            0


/*** PTHDFE - Port H Digital Filter Enable Register; 0xFFFF8179 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTHDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTHDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTHDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTHDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTHDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTHDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTHDFE :7;
    byte         :1;
  } MergedBits;
} PTHDFESTR;
extern volatile PTHDFESTR _PTHDFE @0xFFFF8179;
#define PTHDFE                          _PTHDFE.Byte
#define PTHDFE_PTHDFE0                  _PTHDFE.Bits.PTHDFE0
#define PTHDFE_PTHDFE1                  _PTHDFE.Bits.PTHDFE1
#define PTHDFE_PTHDFE2                  _PTHDFE.Bits.PTHDFE2
#define PTHDFE_PTHDFE3                  _PTHDFE.Bits.PTHDFE3
#define PTHDFE_PTHDFE4                  _PTHDFE.Bits.PTHDFE4
#define PTHDFE_PTHDFE5                  _PTHDFE.Bits.PTHDFE5
#define PTHDFE_PTHDFE6                  _PTHDFE.Bits.PTHDFE6
#define PTHDFE_PTHDFE                   _PTHDFE.MergedBits.grpPTHDFE

#define PTHDFE_PTHDFE0_MASK             1
#define PTHDFE_PTHDFE1_MASK             2
#define PTHDFE_PTHDFE2_MASK             4
#define PTHDFE_PTHDFE3_MASK             8
#define PTHDFE_PTHDFE4_MASK             16
#define PTHDFE_PTHDFE5_MASK             32
#define PTHDFE_PTHDFE6_MASK             64
#define PTHDFE_PTHDFE_MASK              127
#define PTHDFE_PTHDFE_BITNUM            0


/*** PTHDFC - Port H Digital Filter Control Register; 0xFFFF817A ***/
typedef union {
  byte Byte;
  struct {
    byte PTHFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTHFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTHFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTHFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTHFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTHCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTHFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTHDFCSTR;
