AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile PTHDFCSTR _PTHDFC @0xFFFF817A;
#define PTHDFC                          _PTHDFC.Byte
#define PTHDFC_PTHFF0                   _PTHDFC.Bits.PTHFF0
#define PTHDFC_PTHFF1                   _PTHDFC.Bits.PTHFF1
#define PTHDFC_PTHFF2                   _PTHDFC.Bits.PTHFF2
#define PTHDFC_PTHFF3                   _PTHDFC.Bits.PTHFF3
#define PTHDFC_PTHFF4                   _PTHDFC.Bits.PTHFF4
#define PTHDFC_PTHCLKS                  _PTHDFC.Bits.PTHCLKS
#define PTHDFC_PTHFF                    _PTHDFC.MergedBits.grpPTHFF

#define PTHDFC_PTHFF0_MASK              1
#define PTHDFC_PTHFF1_MASK              2
#define PTHDFC_PTHFF2_MASK              4
#define PTHDFC_PTHFF3_MASK              8
#define PTHDFC_PTHFF4_MASK              16
#define PTHDFC_PTHCLKS_MASK             128
#define PTHDFC_PTHFF_MASK               31
#define PTHDFC_PTHFF_BITNUM             0


/*** PTJPUE - Port J Pulling Enable Register; 0xFFFF8180 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJPUE0     :1;                                       /* Internal Pulling Enable for Port J Bit 0 */
    byte PTJPUE1     :1;                                       /* Internal Pulling Enable for Port J Bit 1 */
    byte PTJPUE2     :1;                                       /* Internal Pulling Enable for Port J Bit 2 */
    byte PTJPUE3     :1;                                       /* Internal Pulling Enable for Port J Bit 3 */
    byte PTJPUE4     :1;                                       /* Internal Pulling Enable for Port J Bit 4 */
    byte PTJPUE5     :1;                                       /* Internal Pulling Enable for Port J Bit 5 */
    byte PTJPUE6     :1;                                       /* Internal Pulling Enable for Port J Bit 6 */
    byte PTJPUE7     :1;                                       /* Internal Pulling Enable for Port J Bit 7 */
  } Bits;
} PTJPUESTR;
extern volatile PTJPUESTR _PTJPUE @0xFFFF8180;
#define PTJPUE                          _PTJPUE.Byte
#define PTJPUE_PTJPUE0                  _PTJPUE.Bits.PTJPUE0
#define PTJPUE_PTJPUE1                  _PTJPUE.Bits.PTJPUE1
#define PTJPUE_PTJPUE2                  _PTJPUE.Bits.PTJPUE2
#define PTJPUE_PTJPUE3                  _PTJPUE.Bits.PTJPUE3
#define PTJPUE_PTJPUE4                  _PTJPUE.Bits.PTJPUE4
#define PTJPUE_PTJPUE5                  _PTJPUE.Bits.PTJPUE5
#define PTJPUE_PTJPUE6                  _PTJPUE.Bits.PTJPUE6
#define PTJPUE_PTJPUE7                  _PTJPUE.Bits.PTJPUE7

#define PTJPUE_PTJPUE0_MASK             1
#define PTJPUE_PTJPUE1_MASK             2
#define PTJPUE_PTJPUE2_MASK             4
#define PTJPUE_PTJPUE3_MASK             8
#define PTJPUE_PTJPUE4_MASK             16
#define PTJPUE_PTJPUE5_MASK             32
#define PTJPUE_PTJPUE6_MASK             64
#define PTJPUE_PTJPUE7_MASK             128


/*** PTJPUS - Port J Pullup/Pulldown Select Register; 0xFFFF8181 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJPUS0     :1;                                       /* Pullup/Pulldown Select Bit 0 */
    byte PTJPUS1     :1;                                       /* Pullup/Pulldown Select Bit 1 */
    byte PTJPUS2     :1;                                       /* Pullup/Pulldown Select Bit 2 */
    byte PTJPUS3     :1;                                       /* Pullup/Pulldown Select Bit 3 */
    byte PTJPUS4     :1;                                       /* Pullup/Pulldown Select Bit 4 */
    byte PTJPUS5     :1;                                       /* Pullup/Pulldown Select Bit 5 */
    byte PTJPUS6     :1;                                       /* Pullup/Pulldown Select Bit 6 */
    byte PTJPUS7     :1;                                       /* Pullup/Pulldown Select Bit 7 */
  } Bits;
} PTJPUSSTR;
extern volatile PTJPUSSTR _PTJPUS @0xFFFF8181;
#define PTJPUS                          _PTJPUS.Byte
#define PTJPUS_PTJPUS0                  _PTJPUS.Bits.PTJPUS0
#define PTJPUS_PTJPUS1                  _PTJPUS.Bits.PTJPUS1
#define PTJPUS_PTJPUS2                  _PTJPUS.Bits.PTJPUS2
#define PTJPUS_PTJPUS3                  _PTJPUS.Bits.PTJPUS3
#define PTJPUS_PTJPUS4                  _PTJPUS.Bits.PTJPUS4
#define PTJPUS_PTJPUS5                  _PTJPUS.Bits.PTJPUS5
#define PTJPUS_PTJPUS6                  _PTJPUS.Bits.PTJPUS6
#define PTJPUS_PTJPUS7                  _PTJPUS.Bits.PTJPUS7

#define PTJPUS_PTJPUS0_MASK             1
#define PTJPUS_PTJPUS1_MASK             2
#define PTJPUS_PTJPUS2_MASK             4
#define PTJPUS_PTJPUS3_MASK             8
#define PTJPUS_PTJPUS4_MASK             16
#define PTJPUS_PTJPUS5_MASK             32
#define PTJPUS_PTJPUS6_MASK             64
#define PTJPUS_PTJPUS7_MASK             128


/*** PTJDS - Port J Drive Strength Selection Register; 0xFFFF8182 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJDS0      :1;                                       /* Output Drive Strength Selection for Port J Bit 0 */
    byte PTJDS1      :1;                                       /* Output Drive Strength Selection for Port J Bit 1 */
    byte PTJDS2      :1;                                       /* Output Drive Strength Selection for Port J Bit 2 */
    byte PTJDS3      :1;                                       /* Output Drive Strength Selection for Port J Bit 3 */
    byte PTJDS4      :1;                                       /* Output Drive Strength Selection for Port J Bit 4 */
    byte PTJDS5      :1;                                       /* Output Drive Strength Selection for Port J Bit 5 */
    byte PTJDS6      :1;                                       /* Output Drive Strength Selection for Port J Bit 6 */
    byte PTJDS7      :1;                                       /* Output Drive Strength Selection for Port J Bit 7 */
  } Bits;
} PTJDSSTR;
extern volatile PTJDSSTR _PTJDS @0xFFFF8182;
#define PTJDS                           _PTJDS.Byte
#define PTJDS_PTJDS0                    _PTJDS.Bits.PTJDS0
#define PTJDS_PTJDS1                    _PTJDS.Bits.PTJDS1
#define PTJDS_PTJDS2                    _PTJDS.Bits.PTJDS2
#define PTJDS_PTJDS3                    _PTJDS.Bits.PTJDS3
#define PTJDS_PTJDS4                    _PTJDS.Bits.PTJDS4
#define PTJDS_PTJDS5                    _PTJDS.Bits.PTJDS5
#define PTJDS_PTJDS6                    _PTJDS.Bits.PTJDS6
#define PTJDS_PTJDS7                    _PTJDS.Bits.PTJDS7

#define PTJDS_PTJDS0_MASK               1
#define PTJDS_PTJDS1_MASK               2
#define PTJDS_PTJDS2_MASK               4
#define PTJDS_PTJDS3_MASK               8
#define PTJDS_PTJDS4_MASK               16
#define PTJDS_PTJDS5_MASK               32
#define PTJDS_PTJDS6_MASK               64
#define PTJDS_PTJDS7_MASK               128


