AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTJSRE - Port J Slew Rate Enable Register; 0xFFFF8183 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJSRE0     :1;                                       /* Output Slew Rate Enable for Port J Bit 0 */
    byte PTJSRE1     :1;                                       /* Output Slew Rate Enable for Port J Bit 1 */
    byte PTJSRE2     :1;                                       /* Output Slew Rate Enable for Port J Bit 2 */
    byte PTJSRE3     :1;                                       /* Output Slew Rate Enable for Port J Bit 3 */
    byte PTJSRE4     :1;                                       /* Output Slew Rate Enable for Port J Bit 4 */
    byte PTJSRE5     :1;                                       /* Output Slew Rate Enable for Port J Bit 5 */
    byte PTJSRE6     :1;                                       /* Output Slew Rate Enable for Port J Bit 6 */
    byte PTJSRE7     :1;                                       /* Output Slew Rate Enable for Port J Bit 7 */
  } Bits;
} PTJSRESTR;
extern volatile PTJSRESTR _PTJSRE @0xFFFF8183;
#define PTJSRE                          _PTJSRE.Byte
#define PTJSRE_PTJSRE0                  _PTJSRE.Bits.PTJSRE0
#define PTJSRE_PTJSRE1                  _PTJSRE.Bits.PTJSRE1
#define PTJSRE_PTJSRE2                  _PTJSRE.Bits.PTJSRE2
#define PTJSRE_PTJSRE3                  _PTJSRE.Bits.PTJSRE3
#define PTJSRE_PTJSRE4                  _PTJSRE.Bits.PTJSRE4
#define PTJSRE_PTJSRE5                  _PTJSRE.Bits.PTJSRE5
#define PTJSRE_PTJSRE6                  _PTJSRE.Bits.PTJSRE6
#define PTJSRE_PTJSRE7                  _PTJSRE.Bits.PTJSRE7

#define PTJSRE_PTJSRE0_MASK             1
#define PTJSRE_PTJSRE1_MASK             2
#define PTJSRE_PTJSRE2_MASK             4
#define PTJSRE_PTJSRE3_MASK             8
#define PTJSRE_PTJSRE4_MASK             16
#define PTJSRE_PTJSRE5_MASK             32
#define PTJSRE_PTJSRE6_MASK             64
#define PTJSRE_PTJSRE7_MASK             128


/*** PTJPFE - Port J Passive Filter Enable Register; 0xFFFF8184 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJPFE0     :1;                                       /* Port A Input Filter Enable Bit 0 */
    byte PTJPFE1     :1;                                       /* Port A Input Filter Enable Bit 1 */
    byte PTJPFE2     :1;                                       /* Port A Input Filter Enable Bit 2 */
    byte PTJPFE3     :1;                                       /* Port A Input Filter Enable Bit 3 */
    byte PTJPFE4     :1;                                       /* Port A Input Filter Enable Bit 4 */
    byte PTJPFE5     :1;                                       /* Port A Input Filter Enable Bit 5 */
    byte PTJPFE6     :1;                                       /* Port A Input Filter Enable Bit 6 */
    byte PTJPFE7     :1;                                       /* Port A Input Filter Enable Bit 7 */
  } Bits;
} PTJPFESTR;
extern volatile PTJPFESTR _PTJPFE @0xFFFF8184;
#define PTJPFE                          _PTJPFE.Byte
#define PTJPFE_PTJPFE0                  _PTJPFE.Bits.PTJPFE0
#define PTJPFE_PTJPFE1                  _PTJPFE.Bits.PTJPFE1
#define PTJPFE_PTJPFE2                  _PTJPFE.Bits.PTJPFE2
#define PTJPFE_PTJPFE3                  _PTJPFE.Bits.PTJPFE3
#define PTJPFE_PTJPFE4                  _PTJPFE.Bits.PTJPFE4
#define PTJPFE_PTJPFE5                  _PTJPFE.Bits.PTJPFE5
#define PTJPFE_PTJPFE6                  _PTJPFE.Bits.PTJPFE6
#define PTJPFE_PTJPFE7                  _PTJPFE.Bits.PTJPFE7

#define PTJPFE_PTJPFE0_MASK             1
#define PTJPFE_PTJPFE1_MASK             2
#define PTJPFE_PTJPFE2_MASK             4
#define PTJPFE_PTJPFE3_MASK             8
#define PTJPFE_PTJPFE4_MASK             16
#define PTJPFE_PTJPFE5_MASK             32
#define PTJPFE_PTJPFE6_MASK             64
#define PTJPFE_PTJPFE7_MASK             128


/*** PTJIC - Port J Interrupt Control Register; 0xFFFF8185 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJMOD      :1;                                       /* Detection Mode for Pin Interrupt */
    byte PTJIE       :1;                                       /* Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTJDMAEN    :1;                                       /* DMA Enable bit */
  } Bits;
} PTJICSTR;
extern volatile PTJICSTR _PTJIC @0xFFFF8185;
#define PTJIC                           _PTJIC.Byte
#define PTJIC_PTJMOD                    _PTJIC.Bits.PTJMOD
#define PTJIC_PTJIE                     _PTJIC.Bits.PTJIE
#define PTJIC_PTJDMAEN                  _PTJIC.Bits.PTJDMAEN

#define PTJIC_PTJMOD_MASK               1
#define PTJIC_PTJIE_MASK                2
#define PTJIC_PTJDMAEN_MASK             128


/*** PTJIPE - Port J Interrupt Pin Enable Register; 0xFFFF8186 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJIPE0     :1;                                       /* Interrupt Pin Enable Bit 0 */
    byte PTJIPE1     :1;                                       /* Interrupt Pin Enable Bit 1 */
    byte PTJIPE2     :1;                                       /* Interrupt Pin Enable Bit 2 */
    byte PTJIPE3     :1;                                       /* Interrupt Pin Enable Bit 3 */
    byte PTJIPE4     :1;                                       /* Interrupt Pin Enable Bit 4 */
    byte PTJIPE5     :1;                                       /* Interrupt Pin Enable Bit 5 */
    byte PTJIPE6     :1;                                       /* Interrupt Pin Enable Bit 6 */
    byte PTJIPE7     :1;                                       /* Interrupt Pin Enable Bit 7 */
  } Bits;
} PTJIPESTR;
extern volatile PTJIPESTR _PTJIPE @0xFFFF8186;
#define PTJIPE                          _PTJIPE.Byte
#define PTJIPE_PTJIPE0                  _PTJIPE.Bits.PTJIPE0
#define PTJIPE_PTJIPE1                  _PTJIPE.Bits.PTJIPE1
#define PTJIPE_PTJIPE2                  _PTJIPE.Bits.PTJIPE2
#define PTJIPE_PTJIPE3                  _PTJIPE.Bits.PTJIPE3
#define PTJIPE_PTJIPE4                  _PTJIPE.Bits.PTJIPE4
#define PTJIPE_PTJIPE5                  _PTJIPE.Bits.PTJIPE5
#define PTJIPE_PTJIPE6                  _PTJIPE.Bits.PTJIPE6
#define PTJIPE_PTJIPE7                  _PTJIPE.Bits.PTJIPE7

#define PTJIPE_PTJIPE0_MASK             1
#define PTJIPE_PTJIPE1_MASK             2
#define PTJIPE_PTJIPE2_MASK             4
#define PTJIPE_PTJIPE3_MASK             8
#define PTJIPE_PTJIPE4_MASK             16
#define PTJIPE_PTJIPE5_MASK             32
#define PTJIPE_PTJIPE6_MASK             64
#define PTJIPE_PTJIPE7_MASK             128


