AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** PTJIF - Port J Interrupt Flag Register; 0xFFFF8187 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJIF0      :1;                                       /* Interrupt Flag Bit 0 */
    byte PTJIF1      :1;                                       /* Interrupt Flag Bit 1 */
    byte PTJIF2      :1;                                       /* Interrupt Flag Bit 2 */
    byte PTJIF3      :1;                                       /* Interrupt Flag Bit 3 */
    byte PTJIF4      :1;                                       /* Interrupt Flag Bit 4 */
    byte PTJIF5      :1;                                       /* Interrupt Flag Bit 5 */
    byte PTJIF6      :1;                                       /* Interrupt Flag Bit 6 */
    byte PTJIF7      :1;                                       /* Interrupt Flag Bit 7 */
  } Bits;
} PTJIFSTR;
extern volatile PTJIFSTR _PTJIF @0xFFFF8187;
#define PTJIF                           _PTJIF.Byte
#define PTJIF_PTJIF0                    _PTJIF.Bits.PTJIF0
#define PTJIF_PTJIF1                    _PTJIF.Bits.PTJIF1
#define PTJIF_PTJIF2                    _PTJIF.Bits.PTJIF2
#define PTJIF_PTJIF3                    _PTJIF.Bits.PTJIF3
#define PTJIF_PTJIF4                    _PTJIF.Bits.PTJIF4
#define PTJIF_PTJIF5                    _PTJIF.Bits.PTJIF5
#define PTJIF_PTJIF6                    _PTJIF.Bits.PTJIF6
#define PTJIF_PTJIF7                    _PTJIF.Bits.PTJIF7

#define PTJIF_PTJIF0_MASK               1
#define PTJIF_PTJIF1_MASK               2
#define PTJIF_PTJIF2_MASK               4
#define PTJIF_PTJIF3_MASK               8
#define PTJIF_PTJIF4_MASK               16
#define PTJIF_PTJIF5_MASK               32
#define PTJIF_PTJIF6_MASK               64
#define PTJIF_PTJIF7_MASK               128


/*** PTJIES - Port J Interrupt Edge Select Register; 0xFFFF8188 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJEDG0     :1;                                       /* Edge Selects of Pin Interrupt Bit 0 */
    byte PTJEDG1     :1;                                       /* Edge Selects of Pin Interrupt Bit 1 */
    byte PTJEDG2     :1;                                       /* Edge Selects of Pin Interrupt Bit 2 */
    byte PTJEDG3     :1;                                       /* Edge Selects of Pin Interrupt Bit 3 */
    byte PTJEDG4     :1;                                       /* Edge Selects of Pin Interrupt Bit 4 */
    byte PTJEDG5     :1;                                       /* Edge Selects of Pin Interrupt Bit 5 */
    byte PTJEDG6     :1;                                       /* Edge Selects of Pin Interrupt Bit 6 */
    byte PTJEDG7     :1;                                       /* Edge Selects of Pin Interrupt Bit 7 */
  } Bits;
} PTJIESSTR;
extern volatile PTJIESSTR _PTJIES @0xFFFF8188;
#define PTJIES                          _PTJIES.Byte
#define PTJIES_PTJEDG0                  _PTJIES.Bits.PTJEDG0
#define PTJIES_PTJEDG1                  _PTJIES.Bits.PTJEDG1
#define PTJIES_PTJEDG2                  _PTJIES.Bits.PTJEDG2
#define PTJIES_PTJEDG3                  _PTJIES.Bits.PTJEDG3
#define PTJIES_PTJEDG4                  _PTJIES.Bits.PTJEDG4
#define PTJIES_PTJEDG5                  _PTJIES.Bits.PTJEDG5
#define PTJIES_PTJEDG6                  _PTJIES.Bits.PTJEDG6
#define PTJIES_PTJEDG7                  _PTJIES.Bits.PTJEDG7

#define PTJIES_PTJEDG0_MASK             1
#define PTJIES_PTJEDG1_MASK             2
#define PTJIES_PTJEDG2_MASK             4
#define PTJIES_PTJEDG3_MASK             8
#define PTJIES_PTJEDG4_MASK             16
#define PTJIES_PTJEDG5_MASK             32
#define PTJIES_PTJEDG6_MASK             64
#define PTJIES_PTJEDG7_MASK             128


/*** PTJDFE - Port J Digital Filter Enable Register; 0xFFFF8189 ***/
typedef union {
  byte Byte;
  struct {
    byte PTJDFE0     :1;                                       /* Digital Filter Enable Bit 0 */
    byte PTJDFE1     :1;                                       /* Digital Filter Enable Bit 1 */
    byte PTJDFE2     :1;                                       /* Digital Filter Enable Bit 2 */
    byte PTJDFE3     :1;                                       /* Digital Filter Enable Bit 3 */
    byte PTJDFE4     :1;                                       /* Digital Filter Enable Bit 4 */
    byte PTJDFE5     :1;                                       /* Digital Filter Enable Bit 5 */
    byte PTJDFE6     :1;                                       /* Digital Filter Enable Bit 6 */
    byte PTJDFE7     :1;                                       /* Digital Filter Enable Bit 7 */
  } Bits;
} PTJDFESTR;
extern volatile PTJDFESTR _PTJDFE @0xFFFF8189;
#define PTJDFE                          _PTJDFE.Byte
#define PTJDFE_PTJDFE0                  _PTJDFE.Bits.PTJDFE0
#define PTJDFE_PTJDFE1                  _PTJDFE.Bits.PTJDFE1
#define PTJDFE_PTJDFE2                  _PTJDFE.Bits.PTJDFE2
#define PTJDFE_PTJDFE3                  _PTJDFE.Bits.PTJDFE3
#define PTJDFE_PTJDFE4                  _PTJDFE.Bits.PTJDFE4
#define PTJDFE_PTJDFE5                  _PTJDFE.Bits.PTJDFE5
#define PTJDFE_PTJDFE6                  _PTJDFE.Bits.PTJDFE6
#define PTJDFE_PTJDFE7                  _PTJDFE.Bits.PTJDFE7

#define PTJDFE_PTJDFE0_MASK             1
#define PTJDFE_PTJDFE1_MASK             2
#define PTJDFE_PTJDFE2_MASK             4
#define PTJDFE_PTJDFE3_MASK             8
#define PTJDFE_PTJDFE4_MASK             16
#define PTJDFE_PTJDFE5_MASK             32
#define PTJDFE_PTJDFE6_MASK             64
#define PTJDFE_PTJDFE7_MASK             128


/*** PTJDFC - Port J Digital Filter Control Register; 0xFFFF818A ***/
typedef union {
  byte Byte;
  struct {
    byte PTJFF0      :1;                                       /* Filter Factor Bits, bit 0 */
    byte PTJFF1      :1;                                       /* Filter Factor Bits, bit 1 */
    byte PTJFF2      :1;                                       /* Filter Factor Bits, bit 2 */
    byte PTJFF3      :1;                                       /* Filter Factor Bits, bit 3 */
    byte PTJFF4      :1;                                       /* Filter Factor Bits, bit 4 */
    byte             :1; 
    byte             :1; 
    byte PTJCLKS     :1;                                       /* Clok Select Bit */
  } Bits;
  struct {
    byte grpPTJFF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTJDFCSTR;
