AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    word SSLT0       :1;                                       /* SCL Low Time Out Bits, bit 0 */
    word SSLT1       :1;                                       /* SCL Low Time Out Bits, bit 1 */
    word SSLT2       :1;                                       /* SCL Low Time Out Bits, bit 2 */
    word SSLT3       :1;                                       /* SCL Low Time Out Bits, bit 3 */
    word SSLT4       :1;                                       /* SCL Low Time Out Bits, bit 4 */
    word SSLT5       :1;                                       /* SCL Low Time Out Bits, bit 5 */
    word SSLT6       :1;                                       /* SCL Low Time Out Bits, bit 6 */
    word SSLT7       :1;                                       /* SCL Low Time Out Bits, bit 7 */
    word SSLT8       :1;                                       /* SCL Low Time Out Bits, bit 8 */
    word SSLT9       :1;                                       /* SCL Low Time Out Bits, bit 9 */
    word SSLT10      :1;                                       /* SCL Low Time Out Bits, bit 10 */
    word SSLT11      :1;                                       /* SCL Low Time Out Bits, bit 11 */
    word SSLT12      :1;                                       /* SCL Low Time Out Bits, bit 12 */
    word SSLT13      :1;                                       /* SCL Low Time Out Bits, bit 13 */
    word SSLT14      :1;                                       /* SCL Low Time Out Bits, bit 14 */
    word SSLT15      :1;                                       /* SCL Low Time Out Bits, bit 15 */
  } Bits;
} IICSLTSTR;
extern volatile IICSLTSTR _IICSLT @0xFFFF8199;
#define IICSLT                          _IICSLT.Word
#define IICSLT_SSLT0                    _IICSLT.Bits.SSLT0
#define IICSLT_SSLT1                    _IICSLT.Bits.SSLT1
#define IICSLT_SSLT2                    _IICSLT.Bits.SSLT2
#define IICSLT_SSLT3                    _IICSLT.Bits.SSLT3
#define IICSLT_SSLT4                    _IICSLT.Bits.SSLT4
#define IICSLT_SSLT5                    _IICSLT.Bits.SSLT5
#define IICSLT_SSLT6                    _IICSLT.Bits.SSLT6
#define IICSLT_SSLT7                    _IICSLT.Bits.SSLT7
#define IICSLT_SSLT8                    _IICSLT.Bits.SSLT8
#define IICSLT_SSLT9                    _IICSLT.Bits.SSLT9
#define IICSLT_SSLT10                   _IICSLT.Bits.SSLT10
#define IICSLT_SSLT11                   _IICSLT.Bits.SSLT11
#define IICSLT_SSLT12                   _IICSLT.Bits.SSLT12
#define IICSLT_SSLT13                   _IICSLT.Bits.SSLT13
#define IICSLT_SSLT14                   _IICSLT.Bits.SSLT14
#define IICSLT_SSLT15                   _IICSLT.Bits.SSLT15

#define IICSLT_SSLT0_MASK               1
#define IICSLT_SSLT1_MASK               2
#define IICSLT_SSLT2_MASK               4
#define IICSLT_SSLT3_MASK               8
#define IICSLT_SSLT4_MASK               16
#define IICSLT_SSLT5_MASK               32
#define IICSLT_SSLT6_MASK               64
#define IICSLT_SSLT7_MASK               128
#define IICSLT_SSLT8_MASK               256
#define IICSLT_SSLT9_MASK               512
#define IICSLT_SSLT10_MASK              1024
#define IICSLT_SSLT11_MASK              2048
#define IICSLT_SSLT12_MASK              4096
#define IICSLT_SSLT13_MASK              8192
#define IICSLT_SSLT14_MASK              16384
#define IICSLT_SSLT15_MASK              32768


/*** SPI1C1 - SPI1 Control Register 1; 0xFFFF81A0 ***/
typedef union {
  byte Byte;
  struct {
    byte LSBFE       :1;                                       /* LSB First (Shifter Direction) */
    byte SSOE        :1;                                       /* Slave Select Output Enable */
    byte CPHA        :1;                                       /* Clock Phase */
    byte CPOL        :1;                                       /* Clock Polarity */
    byte MSTR        :1;                                       /* Master/Slave Mode Select */
    byte SPTIE       :1;                                       /* SPI Transmit Interrupt Enable */
    byte SPE         :1;                                       /* SPI System Enable */
    byte SPIE        :1;                                       /* SPI Interrupt Enable (for SPRF and MODF) */
  } Bits;
} SPI1C1STR;
extern volatile SPI1C1STR _SPI1C1 @0xFFFF81A0;
#define SPI1C1                          _SPI1C1.Byte
#define SPI1C1_LSBFE                    _SPI1C1.Bits.LSBFE
#define SPI1C1_SSOE                     _SPI1C1.Bits.SSOE
#define SPI1C1_CPHA                     _SPI1C1.Bits.CPHA
#define SPI1C1_CPOL                     _SPI1C1.Bits.CPOL
#define SPI1C1_MSTR                     _SPI1C1.Bits.MSTR
#define SPI1C1_SPTIE                    _SPI1C1.Bits.SPTIE
#define SPI1C1_SPE                      _SPI1C1.Bits.SPE
#define SPI1C1_SPIE                     _SPI1C1.Bits.SPIE

#define SPI1C1_LSBFE_MASK               1
#define SPI1C1_SSOE_MASK                2
#define SPI1C1_CPHA_MASK                4
#define SPI1C1_CPOL_MASK                8
#define SPI1C1_MSTR_MASK                16
#define SPI1C1_SPTIE_MASK               32
#define SPI1C1_SPE_MASK                 64
#define SPI1C1_SPIE_MASK                128


/*** SPI1C2 - SPI1 Control Register 2; 0xFFFF81A1 ***/
typedef union {
  byte Byte;
  struct {
    byte SPC0        :1;                                       /* SPI Pin Control 0 */
    byte SPISWAI     :1;                                       /* SPI Stop in Wait Mode */
    byte RXDMAE      :1;                                       /* Receive DMA Enable */
    byte BIDIROE     :1;                                       /* Bidirectional Mode Output Enable */
    byte MODFEN      :1;                                       /* Master Mode-Fault Function Enable */
    byte TXDMAE      :1;                                       /* Transmit DMA Enable */
    byte SPIMODE     :1;                                       /* SPI 8- or 16-bit Mode Select */
    byte SPMIE       :1;                                       /* SPI Match Interrupt Enable */
  } Bits;
} SPI1C2STR;
extern volatile SPI1C2STR _SPI1C2 @0xFFFF81A1;
#define SPI1C2                          _SPI1C2.Byte
#define SPI1C2_SPC0                     _SPI1C2.Bits.SPC0
#define SPI1C2_SPISWAI                  _SPI1C2.Bits.SPISWAI
#define SPI1C2_RXDMAE                   _SPI1C2.Bits.RXDMAE
#define SPI1C2_BIDIROE                  _SPI1C2.Bits.BIDIROE
#define SPI1C2_MODFEN                   _SPI1C2.Bits.MODFEN
#define SPI1C2_TXDMAE                   _SPI1C2.Bits.TXDMAE
#define SPI1C2_SPIMODE                  _SPI1C2.Bits.SPIMODE
#define SPI1C2_SPMIE                    _SPI1C2.Bits.SPMIE

