AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    word Bit0        :1;                                       /* SPI Match Value Bit 0 */
    word Bit1        :1;                                       /* SPI Match Value Bit 1 */
    word Bit2        :1;                                       /* SPI Match Value Bit 2 */
    word Bit3        :1;                                       /* SPI Match Value Bit 3 */
    word Bit4        :1;                                       /* SPI Match Value Bit 4 */
    word Bit5        :1;                                       /* SPI Match Value Bit 5 */
    word Bit6        :1;                                       /* SPI Match Value Bit 6 */
    word Bit7        :1;                                       /* SPI Match Value Bit 7 */
    word Bit8        :1;                                       /* SPI Match Value Bit 8 */
    word Bit9        :1;                                       /* SPI Match Value Bit 9 */
    word Bit10       :1;                                       /* SPI Match Value Bit 10 */
    word Bit11       :1;                                       /* SPI Match Value Bit 11 */
    word Bit12       :1;                                       /* SPI Match Value Bit 12 */
    word Bit13       :1;                                       /* SPI Match Value Bit 13 */
    word Bit14       :1;                                       /* SPI Match Value Bit 14 */
    word Bit15       :1;                                       /* SPI Match Value Bit 15 */
  } Bits;
} SPI2MSTR;
extern volatile SPI2MSTR _SPI2M @0xFFFF81AE;
#define SPI2M                           _SPI2M.Word
#define SPI2M_Bit0                      _SPI2M.Bits.Bit0
#define SPI2M_Bit1                      _SPI2M.Bits.Bit1
#define SPI2M_Bit2                      _SPI2M.Bits.Bit2
#define SPI2M_Bit3                      _SPI2M.Bits.Bit3
#define SPI2M_Bit4                      _SPI2M.Bits.Bit4
#define SPI2M_Bit5                      _SPI2M.Bits.Bit5
#define SPI2M_Bit6                      _SPI2M.Bits.Bit6
#define SPI2M_Bit7                      _SPI2M.Bits.Bit7
#define SPI2M_Bit8                      _SPI2M.Bits.Bit8
#define SPI2M_Bit9                      _SPI2M.Bits.Bit9
#define SPI2M_Bit10                     _SPI2M.Bits.Bit10
#define SPI2M_Bit11                     _SPI2M.Bits.Bit11
#define SPI2M_Bit12                     _SPI2M.Bits.Bit12
#define SPI2M_Bit13                     _SPI2M.Bits.Bit13
#define SPI2M_Bit14                     _SPI2M.Bits.Bit14
#define SPI2M_Bit15                     _SPI2M.Bits.Bit15

#define SPI2M_Bit0_MASK                 1
#define SPI2M_Bit1_MASK                 2
#define SPI2M_Bit2_MASK                 4
#define SPI2M_Bit3_MASK                 8
#define SPI2M_Bit4_MASK                 16
#define SPI2M_Bit5_MASK                 32
#define SPI2M_Bit6_MASK                 64
#define SPI2M_Bit7_MASK                 128
#define SPI2M_Bit8_MASK                 256
#define SPI2M_Bit9_MASK                 512
#define SPI2M_Bit10_MASK                1024
#define SPI2M_Bit11_MASK                2048
#define SPI2M_Bit12_MASK                4096
#define SPI2M_Bit13_MASK                8192
#define SPI2M_Bit14_MASK                16384
#define SPI2M_Bit15_MASK                32768


/*** HSCMP1CR0 - HSCMP1 Control Register 0; 0xFFFF81B0 ***/
typedef union {
  byte Byte;
  struct {
    byte MMC0        :1;                                       /* Minus Input Mux Control, bit 0 */
    byte MMC1        :1;                                       /* Minus Input Mux Control, bit 1 */
    byte PMC0        :1;                                       /* Positive Input Mux Control, bit 0 */
    byte PMC1        :1;                                       /* Positive Input Mux Control, bit 1 */
    byte FILTER_CNT0 :1;                                       /* Filter Sample Count, bit 0 */
    byte FILTER_CNT1 :1;                                       /* Filter Sample Count, bit 1 */
    byte FILTER_CNT2 :1;                                       /* Filter Sample Count, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpMMC  :2;
    byte grpPMC  :2;
    byte grpFILTER_CNT :3;
    byte         :1;
  } MergedBits;
} HSCMP1CR0STR;
extern volatile HSCMP1CR0STR _HSCMP1CR0 @0xFFFF81B0;
#define HSCMP1CR0                       _HSCMP1CR0.Byte
#define HSCMP1CR0_MMC0                  _HSCMP1CR0.Bits.MMC0
#define HSCMP1CR0_MMC1                  _HSCMP1CR0.Bits.MMC1
#define HSCMP1CR0_PMC0                  _HSCMP1CR0.Bits.PMC0
#define HSCMP1CR0_PMC1                  _HSCMP1CR0.Bits.PMC1
#define HSCMP1CR0_FILTER_CNT0           _HSCMP1CR0.Bits.FILTER_CNT0
#define HSCMP1CR0_FILTER_CNT1           _HSCMP1CR0.Bits.FILTER_CNT1
#define HSCMP1CR0_FILTER_CNT2           _HSCMP1CR0.Bits.FILTER_CNT2
/* HSCMP1CR_ARR: Access 2 HSCMP1CRx registers in an array */
#define HSCMP1CR_ARR                    ((volatile byte *) &HSCMP1CR0)
#define HSCMP1CR0_MMC                   _HSCMP1CR0.MergedBits.grpMMC
#define HSCMP1CR0_PMC                   _HSCMP1CR0.MergedBits.grpPMC
#define HSCMP1CR0_FILTER_CNT            _HSCMP1CR0.MergedBits.grpFILTER_CNT

#define HSCMP1CR0_MMC0_MASK             1
#define HSCMP1CR0_MMC1_MASK             2
#define HSCMP1CR0_PMC0_MASK             4
#define HSCMP1CR0_PMC1_MASK             8
#define HSCMP1CR0_FILTER_CNT0_MASK      16
#define HSCMP1CR0_FILTER_CNT1_MASK      32
#define HSCMP1CR0_FILTER_CNT2_MASK      64
#define HSCMP1CR0_MMC_MASK              3
#define HSCMP1CR0_MMC_BITNUM            0
#define HSCMP1CR0_PMC_MASK              12
#define HSCMP1CR0_PMC_BITNUM            2
#define HSCMP1CR0_FILTER_CNT_MASK       112
#define HSCMP1CR0_FILTER_CNT_BITNUM     4


/*** HSCMP1CR1 - HSCMP1 Control Register 1; 0xFFFF81B1 ***/
typedef union {
  byte Byte;
  struct {
    byte EN          :1;                                       /* Comparator Module Enable */
    byte OPE         :1;                                       /* Comparator Output Pin Enable */
    byte COS         :1;                                       /* Comparator Output Select */
    byte INV         :1;                                       /* Comparator INVERT */
    byte PMODE       :1;                                       /* Power Mode Select */
    byte             :1; 
    byte WE          :1;                                       /* Windowing Enable */
    byte SE          :1;                                       /* Sample Enable */
  } Bits;
} HSCMP1CR1STR;
extern volatile HSCMP1CR1STR _HSCMP1CR1 @0xFFFF81B1;
#define HSCMP1CR1                       _HSCMP1CR1.Byte
#define HSCMP1CR1_EN                    _HSCMP1CR1.Bits.EN
#define HSCMP1CR1_OPE                   _HSCMP1CR1.Bits.OPE
#define HSCMP1CR1_COS                   _HSCMP1CR1.Bits.COS
#define HSCMP1CR1_INV                   _HSCMP1CR1.Bits.INV
#define HSCMP1CR1_PMODE                 _HSCMP1CR1.Bits.PMODE
#define HSCMP1CR1_WE                    _HSCMP1CR1.Bits.WE
#define HSCMP1CR1_SE                    _HSCMP1CR1.Bits.SE

#define HSCMP1CR1_EN_MASK               1
#define HSCMP1CR1_OPE_MASK              2
#define HSCMP1CR1_COS_MASK              4
#define HSCMP1CR1_INV_MASK              8
#define HSCMP1CR1_PMODE_MASK            16
#define HSCMP1CR1_WE_MASK               64
#define HSCMP1CR1_SE_MASK               128


/*** HSCMP1FPR - HSCMP1 Filter Period Register; 0xFFFF81B2 ***/
typedef union {
  byte Byte;
  struct {
    byte FILT_PER0   :1;                                       /* Filter Period, bit 0 */
    byte FILT_PER1   :1;                                       /* Filter Period, bit 1 */
    byte FILT_PER2   :1;                                       /* Filter Period, bit 2 */
    byte FILT_PER3   :1;                                       /* Filter Period, bit 3 */
    byte FILT_PER4   :1;                                       /* Filter Period, bit 4 */
    byte FILT_PER5   :1;                                       /* Filter Period, bit 5 */
    byte FILT_PER6   :1;                                       /* Filter Period, bit 6 */
    byte FILT_PER7   :1;                                       /* Filter Period, bit 7 */
  } Bits;
} HSCMP1FPRSTR;
extern volatile HSCMP1FPRSTR _HSCMP1FPR @0xFFFF81B2;
#define HSCMP1FPR                       _HSCMP1FPR.Byte
#define HSCMP1FPR_FILT_PER0             _HSCMP1FPR.Bits.FILT_PER0
#define HSCMP1FPR_FILT_PER1             _HSCMP1FPR.Bits.FILT_PER1
#define HSCMP1FPR_FILT_PER2             _HSCMP1FPR.Bits.FILT_PER2
#define HSCMP1FPR_FILT_PER3             _HSCMP1FPR.Bits.FILT_PER3
#define HSCMP1FPR_FILT_PER4             _HSCMP1FPR.Bits.FILT_PER4
#define HSCMP1FPR_FILT_PER5             _HSCMP1FPR.Bits.FILT_PER5
#define HSCMP1FPR_FILT_PER6             _HSCMP1FPR.Bits.FILT_PER6
#define HSCMP1FPR_FILT_PER7             _HSCMP1FPR.Bits.FILT_PER7

