AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define HSCMP1FPR_FILT_PER0_MASK        1
#define HSCMP1FPR_FILT_PER1_MASK        2
#define HSCMP1FPR_FILT_PER2_MASK        4
#define HSCMP1FPR_FILT_PER3_MASK        8
#define HSCMP1FPR_FILT_PER4_MASK        16
#define HSCMP1FPR_FILT_PER5_MASK        32
#define HSCMP1FPR_FILT_PER6_MASK        64
#define HSCMP1FPR_FILT_PER7_MASK        128


/*** HSCMP1SCR - HSCMP1 Status & Control Register; 0xFFFF81B3 ***/
typedef union {
  byte Byte;
  struct {
    byte COUT        :1;                                       /* Analog Comparator Output */
    byte CFF         :1;                                       /* Analog Comparator Flag Falling */
    byte CFR         :1;                                       /* Analog Comparator Flag Rising */
    byte IEF         :1;                                       /* Comparator Interrupt Enable Falling */
    byte IER         :1;                                       /* Comparator Interrupt Enable Rising */
    byte SMLEB       :1;                                       /* Stop Mode Edge / Level Interrupt Control */
    byte DMAEN       :1;                                       /* DMA enable control */
    byte             :1; 
  } Bits;
} HSCMP1SCRSTR;
extern volatile HSCMP1SCRSTR _HSCMP1SCR @0xFFFF81B3;
#define HSCMP1SCR                       _HSCMP1SCR.Byte
#define HSCMP1SCR_COUT                  _HSCMP1SCR.Bits.COUT
#define HSCMP1SCR_CFF                   _HSCMP1SCR.Bits.CFF
#define HSCMP1SCR_CFR                   _HSCMP1SCR.Bits.CFR
#define HSCMP1SCR_IEF                   _HSCMP1SCR.Bits.IEF
#define HSCMP1SCR_IER                   _HSCMP1SCR.Bits.IER
#define HSCMP1SCR_SMLEB                 _HSCMP1SCR.Bits.SMLEB
#define HSCMP1SCR_DMAEN                 _HSCMP1SCR.Bits.DMAEN

#define HSCMP1SCR_COUT_MASK             1
#define HSCMP1SCR_CFF_MASK              2
#define HSCMP1SCR_CFR_MASK              4
#define HSCMP1SCR_IEF_MASK              8
#define HSCMP1SCR_IER_MASK              16
#define HSCMP1SCR_SMLEB_MASK            32
#define HSCMP1SCR_DMAEN_MASK            64


/*** HSCMP1PCR - Pin Control Register; 0xFFFF81B4 ***/
typedef union {
  byte Byte;
  struct {
    byte INMPE1      :1;                                       /* Minus Input Pin 1 Enable */
    byte INMPE2      :1;                                       /* Minus Input Pin 2 Enable */
    byte INMPE3      :1;                                       /* Minus Input Pin 3 Enable */
    byte INMPE4      :1;                                       /* Minus Input Pin 4 Enable */
    byte INPPE1      :1;                                       /* Positive Input Pin 1 Enable */
    byte INPPE2      :1;                                       /* Positive Input Pin 2 Enable */
    byte INPPE3      :1;                                       /* Positive Input Pin 3 Enable */
    byte INPPE4      :1;                                       /* Positive Input Pin 4 Enable */
  } Bits;
  struct {
    byte grpINMPE_1 :4;
    byte grpINPPE_1 :4;
  } MergedBits;
} HSCMP1PCRSTR;
extern volatile HSCMP1PCRSTR _HSCMP1PCR @0xFFFF81B4;
#define HSCMP1PCR                       _HSCMP1PCR.Byte
#define HSCMP1PCR_INMPE1                _HSCMP1PCR.Bits.INMPE1
#define HSCMP1PCR_INMPE2                _HSCMP1PCR.Bits.INMPE2
#define HSCMP1PCR_INMPE3                _HSCMP1PCR.Bits.INMPE3
#define HSCMP1PCR_INMPE4                _HSCMP1PCR.Bits.INMPE4
#define HSCMP1PCR_INPPE1                _HSCMP1PCR.Bits.INPPE1
#define HSCMP1PCR_INPPE2                _HSCMP1PCR.Bits.INPPE2
#define HSCMP1PCR_INPPE3                _HSCMP1PCR.Bits.INPPE3
#define HSCMP1PCR_INPPE4                _HSCMP1PCR.Bits.INPPE4
#define HSCMP1PCR_INMPE_1               _HSCMP1PCR.MergedBits.grpINMPE_1
#define HSCMP1PCR_INPPE_1               _HSCMP1PCR.MergedBits.grpINPPE_1
#define HSCMP1PCR_INMPE                 HSCMP1PCR_INMPE_1
#define HSCMP1PCR_INPPE                 HSCMP1PCR_INPPE_1

#define HSCMP1PCR_INMPE1_MASK           1
#define HSCMP1PCR_INMPE2_MASK           2
#define HSCMP1PCR_INMPE3_MASK           4
#define HSCMP1PCR_INMPE4_MASK           8
#define HSCMP1PCR_INPPE1_MASK           16
#define HSCMP1PCR_INPPE2_MASK           32
#define HSCMP1PCR_INPPE3_MASK           64
#define HSCMP1PCR_INPPE4_MASK           128
#define HSCMP1PCR_INMPE_1_MASK          15
#define HSCMP1PCR_INMPE_1_BITNUM        0
#define HSCMP1PCR_INPPE_1_MASK          240
#define HSCMP1PCR_INPPE_1_BITNUM        4


/*** HSCMP2CR0 - HSCMP2 Control Register 0; 0xFFFF81B8 ***/
typedef union {
  byte Byte;
  struct {
    byte MMC0        :1;                                       /* Minus Input Mux Control, bit 0 */
    byte MMC1        :1;                                       /* Minus Input Mux Control, bit 1 */
    byte PMC0        :1;                                       /* Positive Input Mux Control, bit 0 */
    byte PMC1        :1;                                       /* Positive Input Mux Control, bit 1 */
    byte FILTER_CNT0 :1;                                       /* Filter Sample Count, bit 0 */
    byte FILTER_CNT1 :1;                                       /* Filter Sample Count, bit 1 */
    byte FILTER_CNT2 :1;                                       /* Filter Sample Count, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpMMC  :2;
    byte grpPMC  :2;
    byte grpFILTER_CNT :3;
    byte         :1;
  } MergedBits;
} HSCMP2CR0STR;
extern volatile HSCMP2CR0STR _HSCMP2CR0 @0xFFFF81B8;
#define HSCMP2CR0                       _HSCMP2CR0.Byte
#define HSCMP2CR0_MMC0                  _HSCMP2CR0.Bits.MMC0
#define HSCMP2CR0_MMC1                  _HSCMP2CR0.Bits.MMC1
#define HSCMP2CR0_PMC0                  _HSCMP2CR0.Bits.PMC0
#define HSCMP2CR0_PMC1                  _HSCMP2CR0.Bits.PMC1
#define HSCMP2CR0_FILTER_CNT0           _HSCMP2CR0.Bits.FILTER_CNT0
#define HSCMP2CR0_FILTER_CNT1           _HSCMP2CR0.Bits.FILTER_CNT1
#define HSCMP2CR0_FILTER_CNT2           _HSCMP2CR0.Bits.FILTER_CNT2
/* HSCMP2CR_ARR: Access 2 HSCMP2CRx registers in an array */
#define HSCMP2CR_ARR                    ((volatile byte *) &HSCMP2CR0)
#define HSCMP2CR0_MMC                   _HSCMP2CR0.MergedBits.grpMMC
#define HSCMP2CR0_PMC                   _HSCMP2CR0.MergedBits.grpPMC
#define HSCMP2CR0_FILTER_CNT            _HSCMP2CR0.MergedBits.grpFILTER_CNT

#define HSCMP2CR0_MMC0_MASK             1
#define HSCMP2CR0_MMC1_MASK             2
#define HSCMP2CR0_PMC0_MASK             4
#define HSCMP2CR0_PMC1_MASK             8
#define HSCMP2CR0_FILTER_CNT0_MASK      16
#define HSCMP2CR0_FILTER_CNT1_MASK      32
#define HSCMP2CR0_FILTER_CNT2_MASK      64
#define HSCMP2CR0_MMC_MASK              3
#define HSCMP2CR0_MMC_BITNUM            0
#define HSCMP2CR0_PMC_MASK              12
#define HSCMP2CR0_PMC_BITNUM            2
#define HSCMP2CR0_FILTER_CNT_MASK       112
#define HSCMP2CR0_FILTER_CNT_BITNUM     4


