AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** HSCMP2CR1 - HSCMP2 Control Register 1; 0xFFFF81B9 ***/
typedef union {
  byte Byte;
  struct {
    byte EN          :1;                                       /* Comparator Module Enable */
    byte OPE         :1;                                       /* Comparator Output Pin Enable */
    byte COS         :1;                                       /* Comparator Output Select */
    byte INV         :1;                                       /* Comparator INVERT */
    byte PMODE       :1;                                       /* Power Mode Select */
    byte             :1; 
    byte WE          :1;                                       /* Windowing Enable */
    byte SE          :1;                                       /* Sample Enable */
  } Bits;
} HSCMP2CR1STR;
extern volatile HSCMP2CR1STR _HSCMP2CR1 @0xFFFF81B9;
#define HSCMP2CR1                       _HSCMP2CR1.Byte
#define HSCMP2CR1_EN                    _HSCMP2CR1.Bits.EN
#define HSCMP2CR1_OPE                   _HSCMP2CR1.Bits.OPE
#define HSCMP2CR1_COS                   _HSCMP2CR1.Bits.COS
#define HSCMP2CR1_INV                   _HSCMP2CR1.Bits.INV
#define HSCMP2CR1_PMODE                 _HSCMP2CR1.Bits.PMODE
#define HSCMP2CR1_WE                    _HSCMP2CR1.Bits.WE
#define HSCMP2CR1_SE                    _HSCMP2CR1.Bits.SE

#define HSCMP2CR1_EN_MASK               1
#define HSCMP2CR1_OPE_MASK              2
#define HSCMP2CR1_COS_MASK              4
#define HSCMP2CR1_INV_MASK              8
#define HSCMP2CR1_PMODE_MASK            16
#define HSCMP2CR1_WE_MASK               64
#define HSCMP2CR1_SE_MASK               128


/*** HSCMP2FPR - HSCMP2 Filter Period Register; 0xFFFF81BA ***/
typedef union {
  byte Byte;
  struct {
    byte FILT_PER0   :1;                                       /* Filter Period, bit 0 */
    byte FILT_PER1   :1;                                       /* Filter Period, bit 1 */
    byte FILT_PER2   :1;                                       /* Filter Period, bit 2 */
    byte FILT_PER3   :1;                                       /* Filter Period, bit 3 */
    byte FILT_PER4   :1;                                       /* Filter Period, bit 4 */
    byte FILT_PER5   :1;                                       /* Filter Period, bit 5 */
    byte FILT_PER6   :1;                                       /* Filter Period, bit 6 */
    byte FILT_PER7   :1;                                       /* Filter Period, bit 7 */
  } Bits;
} HSCMP2FPRSTR;
extern volatile HSCMP2FPRSTR _HSCMP2FPR @0xFFFF81BA;
#define HSCMP2FPR                       _HSCMP2FPR.Byte
#define HSCMP2FPR_FILT_PER0             _HSCMP2FPR.Bits.FILT_PER0
#define HSCMP2FPR_FILT_PER1             _HSCMP2FPR.Bits.FILT_PER1
#define HSCMP2FPR_FILT_PER2             _HSCMP2FPR.Bits.FILT_PER2
#define HSCMP2FPR_FILT_PER3             _HSCMP2FPR.Bits.FILT_PER3
#define HSCMP2FPR_FILT_PER4             _HSCMP2FPR.Bits.FILT_PER4
#define HSCMP2FPR_FILT_PER5             _HSCMP2FPR.Bits.FILT_PER5
#define HSCMP2FPR_FILT_PER6             _HSCMP2FPR.Bits.FILT_PER6
#define HSCMP2FPR_FILT_PER7             _HSCMP2FPR.Bits.FILT_PER7

#define HSCMP2FPR_FILT_PER0_MASK        1
#define HSCMP2FPR_FILT_PER1_MASK        2
#define HSCMP2FPR_FILT_PER2_MASK        4
#define HSCMP2FPR_FILT_PER3_MASK        8
#define HSCMP2FPR_FILT_PER4_MASK        16
#define HSCMP2FPR_FILT_PER5_MASK        32
#define HSCMP2FPR_FILT_PER6_MASK        64
#define HSCMP2FPR_FILT_PER7_MASK        128


/*** HSCMP2SCR - HSCMP2 Status & Control Register; 0xFFFF81BB ***/
typedef union {
  byte Byte;
  struct {
    byte COUT        :1;                                       /* Analog Comparator Output */
    byte CFF         :1;                                       /* Analog Comparator Flag Falling */
    byte CFR         :1;                                       /* Analog Comparator Flag Rising */
    byte IEF         :1;                                       /* Comparator Interrupt Enable Falling */
    byte IER         :1;                                       /* Comparator Interrupt Enable Rising */
    byte SMLEB       :1;                                       /* Stop Mode Edge / Level Interrupt Control */
    byte DMAEN       :1;                                       /* DMA enable control */
    byte             :1; 
  } Bits;
} HSCMP2SCRSTR;
extern volatile HSCMP2SCRSTR _HSCMP2SCR @0xFFFF81BB;
#define HSCMP2SCR                       _HSCMP2SCR.Byte
#define HSCMP2SCR_COUT                  _HSCMP2SCR.Bits.COUT
#define HSCMP2SCR_CFF                   _HSCMP2SCR.Bits.CFF
#define HSCMP2SCR_CFR                   _HSCMP2SCR.Bits.CFR
#define HSCMP2SCR_IEF                   _HSCMP2SCR.Bits.IEF
#define HSCMP2SCR_IER                   _HSCMP2SCR.Bits.IER
#define HSCMP2SCR_SMLEB                 _HSCMP2SCR.Bits.SMLEB
#define HSCMP2SCR_DMAEN                 _HSCMP2SCR.Bits.DMAEN

#define HSCMP2SCR_COUT_MASK             1
#define HSCMP2SCR_CFF_MASK              2
#define HSCMP2SCR_CFR_MASK              4
#define HSCMP2SCR_IEF_MASK              8
#define HSCMP2SCR_IER_MASK              16
#define HSCMP2SCR_SMLEB_MASK            32
#define HSCMP2SCR_DMAEN_MASK            64


/*** HSCMP2PCR - Pin Control Register; 0xFFFF81BC ***/
typedef union {
  byte Byte;
  struct {
    byte INMPE1      :1;                                       /* Minus Input Pin 1 Enable */
    byte INMPE2      :1;                                       /* Minus Input Pin 2 Enable */
    byte INMPE3      :1;                                       /* Minus Input Pin 3 Enable */
    byte INMPE4      :1;                                       /* Minus Input Pin 4 Enable */
    byte INPPE1      :1;                                       /* Positive Input Pin 1 Enable */
    byte INPPE2      :1;                                       /* Positive Input Pin 2 Enable */
    byte INPPE3      :1;                                       /* Positive Input Pin 3 Enable */
    byte INPPE4      :1;                                       /* Positive Input Pin 4 Enable */
  } Bits;
  struct {
    byte grpINMPE_1 :4;
    byte grpINPPE_1 :4;
  } MergedBits;
} HSCMP2PCRSTR;
