AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define SOPT2_ADHWTS0_MASK              1
#define SOPT2_ADHWTS1_MASK              2
#define SOPT2_ACIC1_MASK                4
#define SOPT2_TPMCCFG_MASK              8
#define SOPT2_ACIC2_MASK                16
#define SOPT2_FTM1SYNC_MASK             32
#define SOPT2_FTM2SYNC_MASK             64
#define SOPT2_CME_MASK                  128
#define SOPT2_ADHWTS_MASK               3
#define SOPT2_ADHWTS_BITNUM             0


/*** SCGC1 - System Clock Gating Control 1 Register; 0xFFFF980D ***/
typedef union {
  byte Byte;
  struct {
    byte SCI1        :1;                                       /* SCI1 Clock Gate Control */
    byte SCI2        :1;                                       /* SCI2 Clock Gate Control */
    byte IIC         :1;                                       /* IIC Clock Gate Control */
    byte DMA         :1;                                       /* DMA Clock Gate Control */
    byte ADC         :1;                                       /* ADC Clock Gate Control */
    byte FTM1        :1;                                       /* FTM1 Clock Gate Control */
    byte FTM2        :1;                                       /* FTM2 Clock Gate Control */
    byte TPM3        :1;                                       /* TPM3 Clock Gate Control */
  } Bits;
  struct {
    byte grpSCI_1 :2;
    byte         :1;
    byte grpDMx  :1;
    byte         :1;
    byte grpFTM_1 :2;
    byte grpTPM_3 :1;
  } MergedBits;
} SCGC1STR;
extern volatile SCGC1STR _SCGC1 @0xFFFF980D;
#define SCGC1                           _SCGC1.Byte
#define SCGC1_SCI1                      _SCGC1.Bits.SCI1
#define SCGC1_SCI2                      _SCGC1.Bits.SCI2
#define SCGC1_IIC                       _SCGC1.Bits.IIC
#define SCGC1_DMA                       _SCGC1.Bits.DMA
#define SCGC1_ADC                       _SCGC1.Bits.ADC
#define SCGC1_FTM1                      _SCGC1.Bits.FTM1
#define SCGC1_FTM2                      _SCGC1.Bits.FTM2
#define SCGC1_TPM3                      _SCGC1.Bits.TPM3
#define SCGC1_SCI_1                     _SCGC1.MergedBits.grpSCI_1
#define SCGC1_FTM_1                     _SCGC1.MergedBits.grpFTM_1
#define SCGC1_SCI                       SCGC1_SCI_1
#define SCGC1_FTM                       SCGC1_FTM_1

#define SCGC1_SCI1_MASK                 1
#define SCGC1_SCI2_MASK                 2
#define SCGC1_IIC_MASK                  4
#define SCGC1_DMA_MASK                  8
#define SCGC1_ADC_MASK                  16
#define SCGC1_FTM1_MASK                 32
#define SCGC1_FTM2_MASK                 64
#define SCGC1_TPM3_MASK                 128
#define SCGC1_SCI_1_MASK                3
#define SCGC1_SCI_1_BITNUM              0
#define SCGC1_FTM_1_MASK                96
#define SCGC1_FTM_1_BITNUM              5


/*** SCGC2 - System Clock Gating Control 2 Register; 0xFFFF980E ***/
typedef union {
  byte Byte;
  struct {
    byte SPI1        :1;                                       /* SPI1 Clock Gate Control */
    byte SPI2        :1;                                       /* SPI2 Clock Gate Control */
    byte RTC         :1;                                       /* RTC Clock Gate Control */
    byte iEVT        :1;                                       /* iEVENT Clock Gate Control */
    byte PDB         :1;                                       /* PDB Clock Gate Control */
    byte IRQ         :1;                                       /* IRQ Clock Gate Control */
    byte FLS         :1;                                       /* FTSR Clock Gate Control */
    byte CRC         :1;                                       /* CRC Clock Gate Control */
  } Bits;
  struct {
    byte grpSPI_1 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} SCGC2STR;
extern volatile SCGC2STR _SCGC2 @0xFFFF980E;
#define SCGC2                           _SCGC2.Byte
#define SCGC2_SPI1                      _SCGC2.Bits.SPI1
#define SCGC2_SPI2                      _SCGC2.Bits.SPI2
#define SCGC2_RTC                       _SCGC2.Bits.RTC
#define SCGC2_iEVT                      _SCGC2.Bits.iEVT
#define SCGC2_PDB                       _SCGC2.Bits.PDB
#define SCGC2_IRQ                       _SCGC2.Bits.IRQ
#define SCGC2_FLS                       _SCGC2.Bits.FLS
#define SCGC2_CRC                       _SCGC2.Bits.CRC
#define SCGC2_SPI_1                     _SCGC2.MergedBits.grpSPI_1
#define SCGC2_SPI                       SCGC2_SPI_1

#define SCGC2_SPI1_MASK                 1
#define SCGC2_SPI2_MASK                 2
#define SCGC2_RTC_MASK                  4
#define SCGC2_iEVT_MASK                 8
#define SCGC2_PDB_MASK                  16
#define SCGC2_IRQ_MASK                  32
#define SCGC2_FLS_MASK                  64
#define SCGC2_CRC_MASK                  128
#define SCGC2_SPI_1_MASK                3
#define SCGC2_SPI_1_BITNUM              0


/*** SCGC3 - System Clock Gating Control 3 Register; 0xFFFF980F ***/
typedef union {
  byte Byte;
  struct {
    byte EWM         :1;                                       /* EWM Clock Gate Control */
    byte DAC1        :1;                                       /* DAC1 Clock Gate Control */
    byte DAC2        :1;                                       /* DAC2 Clock Gate Control */
    byte HSCMP1      :1;                                       /* HSCMP1 Clock Gate Control */
    byte HSCMP2      :1;                                       /* HSCMP2 Clock Gate Control */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte grpDAC_1 :2;
    byte grpHSCMP_1 :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} SCGC3STR;
extern volatile SCGC3STR _SCGC3 @0xFFFF980F;
#define SCGC3                           _SCGC3.Byte
#define SCGC3_EWM                       _SCGC3.Bits.EWM
#define SCGC3_DAC1                      _SCGC3.Bits.DAC1
#define SCGC3_DAC2                      _SCGC3.Bits.DAC2
#define SCGC3_HSCMP1                    _SCGC3.Bits.HSCMP1
#define SCGC3_HSCMP2                    _SCGC3.Bits.HSCMP2
#define SCGC3_DAC_1                     _SCGC3.MergedBits.grpDAC_1
#define SCGC3_HSCMP_1                   _SCGC3.MergedBits.grpHSCMP_1
#define SCGC3_DAC                       SCGC3_DAC_1
#define SCGC3_HSCMP                     SCGC3_HSCMP_1

#define SCGC3_EWM_MASK                  1
#define SCGC3_DAC1_MASK                 2
#define SCGC3_DAC2_MASK                 4
#define SCGC3_HSCMP1_MASK               8
#define SCGC3_HSCMP2_MASK               16
#define SCGC3_DAC_1_MASK                6
#define SCGC3_DAC_1_BITNUM              1
#define SCGC3_HSCMP_1_MASK              24
#define SCGC3_HSCMP_1_BITNUM            3


/*** FCDIV - FLASH Clock Divider Register; 0xFFFF9820 ***/
typedef union {
  byte Byte;
  struct {
    byte FDIV0       :1;                                       /* Divisor for FLASH Clock Divider, bit 0 */
    byte FDIV1       :1;                                       /* Divisor for FLASH Clock Divider, bit 1 */
    byte FDIV2       :1;                                       /* Divisor for FLASH Clock Divider, bit 2 */
    byte FDIV3       :1;                                       /* Divisor for FLASH Clock Divider, bit 3 */
    byte FDIV4       :1;                                       /* Divisor for FLASH Clock Divider, bit 4 */
    byte FDIV5       :1;                                       /* Divisor for FLASH Clock Divider, bit 5 */
    byte PRDIV8      :1;                                       /* Prescale (Divide) FLASH Clock by 8 */
    byte FDIVLD      :1;                                       /* Divisor Loaded Status Flag */
  } Bits;
  struct {
    byte grpFDIV :6;
    byte grpPRDIV_8 :1;
    byte         :1;
  } MergedBits;
} FCDIVSTR;
