AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** FCMD - Flash Command Register; 0xFFFF9826 ***/
typedef union {
  byte Byte;
  struct {
    byte FCMD0       :1;                                       /* Flash Command, bit 0 */
    byte FCMD1       :1;                                       /* Flash Command, bit 1 */
    byte FCMD2       :1;                                       /* Flash Command, bit 2 */
    byte FCMD3       :1;                                       /* Flash Command, bit 3 */
    byte FCMD4       :1;                                       /* Flash Command, bit 4 */
    byte FCMD5       :1;                                       /* Flash Command, bit 5 */
    byte FCMD6       :1;                                       /* Flash Command, bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpFCMD :7;
    byte         :1;
  } MergedBits;
} FCMDSTR;
extern volatile FCMDSTR _FCMD @0xFFFF9826;
#define FCMD                            _FCMD.Byte
#define FCMD_FCMD0                      _FCMD.Bits.FCMD0
#define FCMD_FCMD1                      _FCMD.Bits.FCMD1
#define FCMD_FCMD2                      _FCMD.Bits.FCMD2
#define FCMD_FCMD3                      _FCMD.Bits.FCMD3
#define FCMD_FCMD4                      _FCMD.Bits.FCMD4
#define FCMD_FCMD5                      _FCMD.Bits.FCMD5
#define FCMD_FCMD6                      _FCMD.Bits.FCMD6
#define FCMD_FCMD                       _FCMD.MergedBits.grpFCMD

#define FCMD_FCMD0_MASK                 1
#define FCMD_FCMD1_MASK                 2
#define FCMD_FCMD2_MASK                 4
#define FCMD_FCMD3_MASK                 8
#define FCMD_FCMD4_MASK                 16
#define FCMD_FCMD5_MASK                 32
#define FCMD_FCMD6_MASK                 64
#define FCMD_FCMD_MASK                  127
#define FCMD_FCMD_BITNUM                0


/*** SAPE1 - System ADC Pin Enable 1 Register; 0xFFFF9831 ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC0       :1;                                       /* ADC Pin Control 0 */
    byte ADPC1       :1;                                       /* ADC Pin Control 1 */
    byte ADPC2       :1;                                       /* ADC Pin Control 2 */
    byte ADPC3       :1;                                       /* ADC Pin Control 3 */
    byte ADPC4       :1;                                       /* ADC Pin Control 4 */
    byte ADPC5       :1;                                       /* ADC Pin Control 5 */
    byte ADPC6       :1;                                       /* ADC Pin Control 6 */
    byte ADPC7       :1;                                       /* ADC Pin Control 7 */
  } Bits;
} SAPE1STR;
extern volatile SAPE1STR _SAPE1 @0xFFFF9831;
#define SAPE1                           _SAPE1.Byte
#define SAPE1_ADPC0                     _SAPE1.Bits.ADPC0
#define SAPE1_ADPC1                     _SAPE1.Bits.ADPC1
#define SAPE1_ADPC2                     _SAPE1.Bits.ADPC2
#define SAPE1_ADPC3                     _SAPE1.Bits.ADPC3
#define SAPE1_ADPC4                     _SAPE1.Bits.ADPC4
#define SAPE1_ADPC5                     _SAPE1.Bits.ADPC5
#define SAPE1_ADPC6                     _SAPE1.Bits.ADPC6
#define SAPE1_ADPC7                     _SAPE1.Bits.ADPC7

#define SAPE1_ADPC0_MASK                1
#define SAPE1_ADPC1_MASK                2
#define SAPE1_ADPC2_MASK                4
#define SAPE1_ADPC3_MASK                8
#define SAPE1_ADPC4_MASK                16
#define SAPE1_ADPC5_MASK                32
#define SAPE1_ADPC6_MASK                64
#define SAPE1_ADPC7_MASK                128


/*** SAPE2 - System ADC Pin Enable 2 Register; 0xFFFF9832 ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC8       :1;                                       /* ADC Pin Control 8 */
    byte ADPC9       :1;                                       /* ADC Pin Control 9 */
    byte ADPC10      :1;                                       /* ADC Pin Control 10 */
    byte ADPC11      :1;                                       /* ADC Pin Control 11 */
    byte ADPC12      :1;                                       /* ADC Pin Control 12 */
    byte ADPC13      :1;                                       /* ADC Pin Control 13 */
    byte ADPC14      :1;                                       /* ADC Pin Control 14 */
    byte ADPC15      :1;                                       /* ADC Pin Control 15 */
  } Bits;
} SAPE2STR;
extern volatile SAPE2STR _SAPE2 @0xFFFF9832;
#define SAPE2                           _SAPE2.Byte
#define SAPE2_ADPC8                     _SAPE2.Bits.ADPC8
#define SAPE2_ADPC9                     _SAPE2.Bits.ADPC9
#define SAPE2_ADPC10                    _SAPE2.Bits.ADPC10
#define SAPE2_ADPC11                    _SAPE2.Bits.ADPC11
#define SAPE2_ADPC12                    _SAPE2.Bits.ADPC12
#define SAPE2_ADPC13                    _SAPE2.Bits.ADPC13
#define SAPE2_ADPC14                    _SAPE2.Bits.ADPC14
#define SAPE2_ADPC15                    _SAPE2.Bits.ADPC15

#define SAPE2_ADPC8_MASK                1
#define SAPE2_ADPC9_MASK                2
#define SAPE2_ADPC10_MASK               4
#define SAPE2_ADPC11_MASK               8
#define SAPE2_ADPC12_MASK               16
#define SAPE2_ADPC13_MASK               32
#define SAPE2_ADPC14_MASK               64
#define SAPE2_ADPC15_MASK               128


/*** SAPE3 - System ADC Pin Enable 3 Register; 0xFFFF9833 ***/
typedef union {
  byte Byte;
  struct {
    byte ADPC16      :1;                                       /* ADC Pin Control 16 */
    byte ADPC17      :1;                                       /* ADC Pin Control 17 */
    byte ADPC18      :1;                                       /* ADC Pin Control 18 */
    byte ADPC19      :1;                                       /* ADC Pin Control 19 */
    byte ADPC20      :1;                                       /* ADC Pin Control 20 */
    byte ADPC21      :1;                                       /* ADC Pin Control 21 */
    byte ADPC22      :1;                                       /* ADC Pin Control 22 */
    byte ADPC23      :1;                                       /* ADC Pin Control 23 */
  } Bits;
} SAPE3STR;
extern volatile SAPE3STR _SAPE3 @0xFFFF9833;
#define SAPE3                           _SAPE3.Byte
#define SAPE3_ADPC16                    _SAPE3.Bits.ADPC16
#define SAPE3_ADPC17                    _SAPE3.Bits.ADPC17
#define SAPE3_ADPC18                    _SAPE3.Bits.ADPC18
#define SAPE3_ADPC19                    _SAPE3.Bits.ADPC19
#define SAPE3_ADPC20                    _SAPE3.Bits.ADPC20
#define SAPE3_ADPC21                    _SAPE3.Bits.ADPC21
#define SAPE3_ADPC22                    _SAPE3.Bits.ADPC22
#define SAPE3_ADPC23                    _SAPE3.Bits.ADPC23

#define SAPE3_ADPC16_MASK               1
#define SAPE3_ADPC17_MASK               2
#define SAPE3_ADPC18_MASK               4
#define SAPE3_ADPC19_MASK               8
#define SAPE3_ADPC20_MASK               16
#define SAPE3_ADPC21_MASK               32
#define SAPE3_ADPC22_MASK               64
#define SAPE3_ADPC23_MASK               128


/*** SEIS1 - System eGPIO Interrupt Status 1 Register; 0xFFFF9834 ***/
typedef union {
  byte Byte;
  struct {
    byte PTA         :1;                                       /* PORT A Interrupt Status */
    byte PTB         :1;                                       /* PORT B Interrupt Status */
    byte PTC         :1;                                       /* PORT C Interrupt Status */
    byte PTD         :1;                                       /* PORT D Interrupt Status */
    byte PTE         :1;                                       /* PORT E Interrupt Status */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTx  :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} SEIS1STR;
extern volatile SEIS1STR _SEIS1 @0xFFFF9834;
#define SEIS1                           _SEIS1.Byte
#define SEIS1_PTA                       _SEIS1.Bits.PTA
#define SEIS1_PTB                       _SEIS1.Bits.PTB
#define SEIS1_PTC                       _SEIS1.Bits.PTC
#define SEIS1_PTD                       _SEIS1.Bits.PTD
#define SEIS1_PTE                       _SEIS1.Bits.PTE
#define SEIS1_PTx                       _SEIS1.MergedBits.grpPTx

#define SEIS1_PTA_MASK                  1
#define SEIS1_PTB_MASK                  2
#define SEIS1_PTC_MASK                  4
#define SEIS1_PTD_MASK                  8
#define SEIS1_PTE_MASK                  16
#define SEIS1_PTx_MASK                  31
#define SEIS1_PTx_BITNUM                0


/*** SEIS2 - System eGPIO Interrupt Status 2 Register; 0xFFFF9835 ***/
typedef union {
  byte Byte;
  struct {
    byte PTF         :1;                                       /* PORTF Interrupt Status */
    byte PTG         :1;                                       /* PORTG Interrupt Status */
    byte PTH         :1;                                       /* PORTH Interrupt Status */
    byte PTJ         :1;                                       /* PORTJ Interrupt Status */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} SEIS2STR;
