AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile SEIS2STR _SEIS2 @0xFFFF9835;
#define SEIS2                           _SEIS2.Byte
#define SEIS2_PTF                       _SEIS2.Bits.PTF
#define SEIS2_PTG                       _SEIS2.Bits.PTG
#define SEIS2_PTH                       _SEIS2.Bits.PTH
#define SEIS2_PTJ                       _SEIS2.Bits.PTJ

#define SEIS2_PTF_MASK                  1
#define SEIS2_PTG_MASK                  2
#define SEIS2_PTH_MASK                  4
#define SEIS2_PTJ_MASK                  8


/*** SPINPS - System Pin Positioning Register; 0xFFFF9836 ***/
typedef union {
  byte Byte;
  struct {
    byte TPM3CH0     :1;                                       /* TPM3 Channel 0 Pin Control */
    byte TPM3CH1     :1;                                       /* TPM3 Channel 1 Pin Control */
    byte FTM2CH2     :1;                                       /* FTM2 Channel 2 Pin Control */
    byte FTM2CH3     :1;                                       /* FTM2 Channel 3 Pin Control */
    byte FTM2CH4     :1;                                       /* FTM2 Channel 4 Pin Control */
    byte FTM2CH5     :1;                                       /* FTM2 Channel 5 Pin Control */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTPM3CH :2;
    byte grpFTM2CH_2 :4;
    byte         :1;
    byte         :1;
  } MergedBits;
} SPINPSSTR;
extern volatile SPINPSSTR _SPINPS @0xFFFF9836;
#define SPINPS                          _SPINPS.Byte
#define SPINPS_TPM3CH0                  _SPINPS.Bits.TPM3CH0
#define SPINPS_TPM3CH1                  _SPINPS.Bits.TPM3CH1
#define SPINPS_FTM2CH2                  _SPINPS.Bits.FTM2CH2
#define SPINPS_FTM2CH3                  _SPINPS.Bits.FTM2CH3
#define SPINPS_FTM2CH4                  _SPINPS.Bits.FTM2CH4
#define SPINPS_FTM2CH5                  _SPINPS.Bits.FTM2CH5
#define SPINPS_TPM3CH                   _SPINPS.MergedBits.grpTPM3CH
#define SPINPS_FTM2CH_2                 _SPINPS.MergedBits.grpFTM2CH_2
#define SPINPS_FTM2CH                   SPINPS_FTM2CH_2

#define SPINPS_TPM3CH0_MASK             1
#define SPINPS_TPM3CH1_MASK             2
#define SPINPS_FTM2CH2_MASK             4
#define SPINPS_FTM2CH3_MASK             8
#define SPINPS_FTM2CH4_MASK             16
#define SPINPS_FTM2CH5_MASK             32
#define SPINPS_TPM3CH_MASK              3
#define SPINPS_TPM3CH_BITNUM            0
#define SPINPS_FTM2CH_2_MASK            60
#define SPINPS_FTM2CH_2_BITNUM          2


/*** SIMPTA - System Port A Input Buffer Enable Register; 0xFFFF9837 ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTA0     :1;                                       /* PTA0 Input Buffer Control */
    byte SIMPTA1     :1;                                       /* PTA1 Input Buffer Control */
    byte SIMPTA2     :1;                                       /* PTA2 Input Buffer Control */
    byte SIMPTA3     :1;                                       /* PTA3 Input Buffer Control */
    byte SIMPTA4     :1;                                       /* PTA4 Input Buffer Control */
    byte SIMPTA5     :1;                                       /* PTA5 Input Buffer Control */
    byte SIMPTA6     :1;                                       /* PTA6 Input Buffer Control */
    byte SIMPTA7     :1;                                       /* PTA7 Input Buffer Control */
  } Bits;
} SIMPTASTR;
extern volatile SIMPTASTR _SIMPTA @0xFFFF9837;
#define SIMPTA                          _SIMPTA.Byte
#define SIMPTA_SIMPTA0                  _SIMPTA.Bits.SIMPTA0
#define SIMPTA_SIMPTA1                  _SIMPTA.Bits.SIMPTA1
#define SIMPTA_SIMPTA2                  _SIMPTA.Bits.SIMPTA2
#define SIMPTA_SIMPTA3                  _SIMPTA.Bits.SIMPTA3
#define SIMPTA_SIMPTA4                  _SIMPTA.Bits.SIMPTA4
#define SIMPTA_SIMPTA5                  _SIMPTA.Bits.SIMPTA5
#define SIMPTA_SIMPTA6                  _SIMPTA.Bits.SIMPTA6
#define SIMPTA_SIMPTA7                  _SIMPTA.Bits.SIMPTA7

#define SIMPTA_SIMPTA0_MASK             1
#define SIMPTA_SIMPTA1_MASK             2
#define SIMPTA_SIMPTA2_MASK             4
#define SIMPTA_SIMPTA3_MASK             8
#define SIMPTA_SIMPTA4_MASK             16
#define SIMPTA_SIMPTA5_MASK             32
#define SIMPTA_SIMPTA6_MASK             64
#define SIMPTA_SIMPTA7_MASK             128


/*** SIMPTB - System Port B Input Buffer Enable Register; 0xFFFF9838 ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTB0     :1;                                       /* PTB0 Input Buffer Control */
    byte SIMPTB1     :1;                                       /* PTB1 Input Buffer Control */
    byte SIMPTB2     :1;                                       /* PTB2 Input Buffer Control */
    byte SIMPTB3     :1;                                       /* PTB3 Input Buffer Control */
    byte SIMPTB4     :1;                                       /* PTB4 Input Buffer Control */
    byte SIMPTB5     :1;                                       /* PTB5 Input Buffer Control */
    byte SIMPTB6     :1;                                       /* PTB6 Input Buffer Control */
    byte SIMPTB7     :1;                                       /* PTB7 Input Buffer Control */
  } Bits;
} SIMPTBSTR;
extern volatile SIMPTBSTR _SIMPTB @0xFFFF9838;
#define SIMPTB                          _SIMPTB.Byte
#define SIMPTB_SIMPTB0                  _SIMPTB.Bits.SIMPTB0
#define SIMPTB_SIMPTB1                  _SIMPTB.Bits.SIMPTB1
#define SIMPTB_SIMPTB2                  _SIMPTB.Bits.SIMPTB2
#define SIMPTB_SIMPTB3                  _SIMPTB.Bits.SIMPTB3
#define SIMPTB_SIMPTB4                  _SIMPTB.Bits.SIMPTB4
#define SIMPTB_SIMPTB5                  _SIMPTB.Bits.SIMPTB5
#define SIMPTB_SIMPTB6                  _SIMPTB.Bits.SIMPTB6
#define SIMPTB_SIMPTB7                  _SIMPTB.Bits.SIMPTB7

#define SIMPTB_SIMPTB0_MASK             1
#define SIMPTB_SIMPTB1_MASK             2
#define SIMPTB_SIMPTB2_MASK             4
#define SIMPTB_SIMPTB3_MASK             8
#define SIMPTB_SIMPTB4_MASK             16
#define SIMPTB_SIMPTB5_MASK             32
#define SIMPTB_SIMPTB6_MASK             64
#define SIMPTB_SIMPTB7_MASK             128


/*** SIMPTC - System Port C Input Buffer Enable Register; 0xFFFF9839 ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTC0     :1;                                       /* PTC0 Input Buffer Control */
    byte SIMPTC1     :1;                                       /* PTC1 Input Buffer Control */
    byte SIMPTC2     :1;                                       /* PTC2 Input Buffer Control */
    byte SIMPTC3     :1;                                       /* PTC3 Input Buffer Control */
    byte SIMPTC4     :1;                                       /* PTC4 Input Buffer Control */
    byte SIMPTC5     :1;                                       /* PTC5 Input Buffer Control */
    byte SIMPTC6     :1;                                       /* PTC6 Input Buffer Control */
    byte             :1; 
  } Bits;
  struct {
    byte grpSIMPTC :7;
    byte         :1;
  } MergedBits;
} SIMPTCSTR;
extern volatile SIMPTCSTR _SIMPTC @0xFFFF9839;
#define SIMPTC                          _SIMPTC.Byte
#define SIMPTC_SIMPTC0                  _SIMPTC.Bits.SIMPTC0
#define SIMPTC_SIMPTC1                  _SIMPTC.Bits.SIMPTC1
#define SIMPTC_SIMPTC2                  _SIMPTC.Bits.SIMPTC2
#define SIMPTC_SIMPTC3                  _SIMPTC.Bits.SIMPTC3
#define SIMPTC_SIMPTC4                  _SIMPTC.Bits.SIMPTC4
#define SIMPTC_SIMPTC5                  _SIMPTC.Bits.SIMPTC5
#define SIMPTC_SIMPTC6                  _SIMPTC.Bits.SIMPTC6
#define SIMPTC_SIMPTC                   _SIMPTC.MergedBits.grpSIMPTC

#define SIMPTC_SIMPTC0_MASK             1
#define SIMPTC_SIMPTC1_MASK             2
#define SIMPTC_SIMPTC2_MASK             4
#define SIMPTC_SIMPTC3_MASK             8
#define SIMPTC_SIMPTC4_MASK             16
#define SIMPTC_SIMPTC5_MASK             32
#define SIMPTC_SIMPTC6_MASK             64
#define SIMPTC_SIMPTC_MASK              127
#define SIMPTC_SIMPTC_BITNUM            0


