AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** SIMPTD - System Port D Input Buffer Enable Register; 0xFFFF983A ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTD0     :1;                                       /* PTD0 Input Buffer Control */
    byte SIMPTD1     :1;                                       /* PTD1 Input Buffer Control */
    byte SIMPTD2     :1;                                       /* PTD2 Input Buffer Control */
    byte SIMPTD3     :1;                                       /* PTD3 Input Buffer Control */
    byte SIMPTD4     :1;                                       /* PTD4 Input Buffer Control */
    byte SIMPTD5     :1;                                       /* PTD5 Input Buffer Control */
    byte SIMPTD6     :1;                                       /* PTD6 Input Buffer Control */
    byte SIMPTD7     :1;                                       /* PTD7 Input Buffer Control */
  } Bits;
} SIMPTDSTR;
extern volatile SIMPTDSTR _SIMPTD @0xFFFF983A;
#define SIMPTD                          _SIMPTD.Byte
#define SIMPTD_SIMPTD0                  _SIMPTD.Bits.SIMPTD0
#define SIMPTD_SIMPTD1                  _SIMPTD.Bits.SIMPTD1
#define SIMPTD_SIMPTD2                  _SIMPTD.Bits.SIMPTD2
#define SIMPTD_SIMPTD3                  _SIMPTD.Bits.SIMPTD3
#define SIMPTD_SIMPTD4                  _SIMPTD.Bits.SIMPTD4
#define SIMPTD_SIMPTD5                  _SIMPTD.Bits.SIMPTD5
#define SIMPTD_SIMPTD6                  _SIMPTD.Bits.SIMPTD6
#define SIMPTD_SIMPTD7                  _SIMPTD.Bits.SIMPTD7

#define SIMPTD_SIMPTD0_MASK             1
#define SIMPTD_SIMPTD1_MASK             2
#define SIMPTD_SIMPTD2_MASK             4
#define SIMPTD_SIMPTD3_MASK             8
#define SIMPTD_SIMPTD4_MASK             16
#define SIMPTD_SIMPTD5_MASK             32
#define SIMPTD_SIMPTD6_MASK             64
#define SIMPTD_SIMPTD7_MASK             128


/*** SIMPTE - System Port E Input Buffer Enable Register; 0xFFFF983B ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTE0     :1;                                       /* PTE0 Input Buffer Control */
    byte SIMPTE1     :1;                                       /* PTE1 Input Buffer Control */
    byte SIMPTE2     :1;                                       /* PTE2 Input Buffer Control */
    byte SIMPTE3     :1;                                       /* PTE3 Input Buffer Control */
    byte SIMPTE4     :1;                                       /* PTE4 Input Buffer Control */
    byte SIMPTE5     :1;                                       /* PTE5 Input Buffer Control */
    byte SIMPTE6     :1;                                       /* PTE6 Input Buffer Control */
    byte SIMPTE7     :1;                                       /* PTE7 Input Buffer Control */
  } Bits;
} SIMPTESTR;
extern volatile SIMPTESTR _SIMPTE @0xFFFF983B;
#define SIMPTE                          _SIMPTE.Byte
#define SIMPTE_SIMPTE0                  _SIMPTE.Bits.SIMPTE0
#define SIMPTE_SIMPTE1                  _SIMPTE.Bits.SIMPTE1
#define SIMPTE_SIMPTE2                  _SIMPTE.Bits.SIMPTE2
#define SIMPTE_SIMPTE3                  _SIMPTE.Bits.SIMPTE3
#define SIMPTE_SIMPTE4                  _SIMPTE.Bits.SIMPTE4
#define SIMPTE_SIMPTE5                  _SIMPTE.Bits.SIMPTE5
#define SIMPTE_SIMPTE6                  _SIMPTE.Bits.SIMPTE6
#define SIMPTE_SIMPTE7                  _SIMPTE.Bits.SIMPTE7

#define SIMPTE_SIMPTE0_MASK             1
#define SIMPTE_SIMPTE1_MASK             2
#define SIMPTE_SIMPTE2_MASK             4
#define SIMPTE_SIMPTE3_MASK             8
#define SIMPTE_SIMPTE4_MASK             16
#define SIMPTE_SIMPTE5_MASK             32
#define SIMPTE_SIMPTE6_MASK             64
#define SIMPTE_SIMPTE7_MASK             128


/*** SIMPTF - System Port F Input Buffer Enable Register; 0xFFFF983C ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTF0     :1;                                       /* PTF0 Input Buffer Control */
    byte SIMPTF1     :1;                                       /* PTF1 Input Buffer Control */
    byte SIMPTF2     :1;                                       /* PTF2 Input Buffer Control */
    byte SIMPTF3     :1;                                       /* PTF3 Input Buffer Control */
    byte SIMPTF4     :1;                                       /* PTF4 Input Buffer Control */
    byte SIMPTF5     :1;                                       /* PTF5 Input Buffer Control */
    byte SIMPTF6     :1;                                       /* PTF6 Input Buffer Control */
    byte SIMPTF7     :1;                                       /* PTF7 Input Buffer Control */
  } Bits;
} SIMPTFSTR;
extern volatile SIMPTFSTR _SIMPTF @0xFFFF983C;
#define SIMPTF                          _SIMPTF.Byte
#define SIMPTF_SIMPTF0                  _SIMPTF.Bits.SIMPTF0
#define SIMPTF_SIMPTF1                  _SIMPTF.Bits.SIMPTF1
#define SIMPTF_SIMPTF2                  _SIMPTF.Bits.SIMPTF2
#define SIMPTF_SIMPTF3                  _SIMPTF.Bits.SIMPTF3
#define SIMPTF_SIMPTF4                  _SIMPTF.Bits.SIMPTF4
#define SIMPTF_SIMPTF5                  _SIMPTF.Bits.SIMPTF5
#define SIMPTF_SIMPTF6                  _SIMPTF.Bits.SIMPTF6
#define SIMPTF_SIMPTF7                  _SIMPTF.Bits.SIMPTF7

#define SIMPTF_SIMPTF0_MASK             1
#define SIMPTF_SIMPTF1_MASK             2
#define SIMPTF_SIMPTF2_MASK             4
#define SIMPTF_SIMPTF3_MASK             8
#define SIMPTF_SIMPTF4_MASK             16
#define SIMPTF_SIMPTF5_MASK             32
#define SIMPTF_SIMPTF6_MASK             64
#define SIMPTF_SIMPTF7_MASK             128


/*** SIMPTG - System Port G Input Buffer Enable Register; 0xFFFF983D ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTG0     :1;                                       /* PTG0 Input Buffer Control */
    byte SIMPTG1     :1;                                       /* PTG1 Input Buffer Control */
    byte SIMPTG2     :1;                                       /* PTG2 Input Buffer Control */
    byte SIMPTG3     :1;                                       /* PTG3 Input Buffer Control */
    byte SIMPTG4     :1;                                       /* PTG4 Input Buffer Control */
    byte SIMPTG5     :1;                                       /* PTG5 Input Buffer Control */
    byte SIMPTG6     :1;                                       /* PTG6 Input Buffer Control */
    byte             :1; 
  } Bits;
  struct {
    byte grpSIMPTG :7;
    byte         :1;
  } MergedBits;
} SIMPTGSTR;
extern volatile SIMPTGSTR _SIMPTG @0xFFFF983D;
#define SIMPTG                          _SIMPTG.Byte
#define SIMPTG_SIMPTG0                  _SIMPTG.Bits.SIMPTG0
#define SIMPTG_SIMPTG1                  _SIMPTG.Bits.SIMPTG1
#define SIMPTG_SIMPTG2                  _SIMPTG.Bits.SIMPTG2
#define SIMPTG_SIMPTG3                  _SIMPTG.Bits.SIMPTG3
#define SIMPTG_SIMPTG4                  _SIMPTG.Bits.SIMPTG4
#define SIMPTG_SIMPTG5                  _SIMPTG.Bits.SIMPTG5
#define SIMPTG_SIMPTG6                  _SIMPTG.Bits.SIMPTG6
#define SIMPTG_SIMPTG                   _SIMPTG.MergedBits.grpSIMPTG

#define SIMPTG_SIMPTG0_MASK             1
#define SIMPTG_SIMPTG1_MASK             2
#define SIMPTG_SIMPTG2_MASK             4
#define SIMPTG_SIMPTG3_MASK             8
#define SIMPTG_SIMPTG4_MASK             16
#define SIMPTG_SIMPTG5_MASK             32
#define SIMPTG_SIMPTG6_MASK             64
#define SIMPTG_SIMPTG_MASK              127
#define SIMPTG_SIMPTG_BITNUM            0


/*** SIMPTH - System Port H Input Buffer Enable Register; 0xFFFF983E ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTH0     :1;                                       /* PTH0 Input Buffer Control */
    byte SIMPTH1     :1;                                       /* PTH1 Input Buffer Control */
    byte SIMPTH2     :1;                                       /* PTH2 Input Buffer Control */
    byte SIMPTH3     :1;                                       /* PTH3 Input Buffer Control */
    byte SIMPTH4     :1;                                       /* PTH4 Input Buffer Control */
    byte SIMPTH5     :1;                                       /* PTH5 Input Buffer Control */
    byte SIMPTH6     :1;                                       /* PTH6 Input Buffer Control */
    byte             :1; 
  } Bits;
  struct {
    byte grpSIMPTH :7;
    byte         :1;
  } MergedBits;
} SIMPTHSTR;
extern volatile SIMPTHSTR _SIMPTH @0xFFFF983E;
#define SIMPTH                          _SIMPTH.Byte
#define SIMPTH_SIMPTH0                  _SIMPTH.Bits.SIMPTH0
#define SIMPTH_SIMPTH1                  _SIMPTH.Bits.SIMPTH1
#define SIMPTH_SIMPTH2                  _SIMPTH.Bits.SIMPTH2
#define SIMPTH_SIMPTH3                  _SIMPTH.Bits.SIMPTH3
#define SIMPTH_SIMPTH4                  _SIMPTH.Bits.SIMPTH4
#define SIMPTH_SIMPTH5                  _SIMPTH.Bits.SIMPTH5
#define SIMPTH_SIMPTH6                  _SIMPTH.Bits.SIMPTH6
#define SIMPTH_SIMPTH                   _SIMPTH.MergedBits.grpSIMPTH

#define SIMPTH_SIMPTH0_MASK             1
#define SIMPTH_SIMPTH1_MASK             2
#define SIMPTH_SIMPTH2_MASK             4
#define SIMPTH_SIMPTH3_MASK             8
#define SIMPTH_SIMPTH4_MASK             16
#define SIMPTH_SIMPTH5_MASK             32
#define SIMPTH_SIMPTH6_MASK             64
#define SIMPTH_SIMPTH_MASK              127
#define SIMPTH_SIMPTH_BITNUM            0


/*** SIMPTJ - System Port J Input Buffer Enable Register; 0xFFFF983F ***/
typedef union {
  byte Byte;
  struct {
    byte SIMPTJ0     :1;                                       /* PTJ0 Input Buffer Control */
    byte SIMPTJ1     :1;                                       /* PTJ1 Input Buffer Control */
    byte SIMPTJ2     :1;                                       /* PTJ2 Input Buffer Control */
    byte SIMPTJ3     :1;                                       /* PTJ3 Input Buffer Control */
    byte SIMPTJ4     :1;                                       /* PTJ4 Input Buffer Control */
    byte SIMPTJ5     :1;                                       /* PTJ5 Input Buffer Control */
    byte SIMPTJ6     :1;                                       /* PTJ6 Input Buffer Control */
    byte SIMPTJ7     :1;                                       /* PTJ7 Input Buffer Control */
  } Bits;
} SIMPTJSTR;
extern volatile SIMPTJSTR _SIMPTJ @0xFFFF983F;
#define SIMPTJ                          _SIMPTJ.Byte
#define SIMPTJ_SIMPTJ0                  _SIMPTJ.Bits.SIMPTJ0
#define SIMPTJ_SIMPTJ1                  _SIMPTJ.Bits.SIMPTJ1
#define SIMPTJ_SIMPTJ2                  _SIMPTJ.Bits.SIMPTJ2
#define SIMPTJ_SIMPTJ3                  _SIMPTJ.Bits.SIMPTJ3
#define SIMPTJ_SIMPTJ4                  _SIMPTJ.Bits.SIMPTJ4
#define SIMPTJ_SIMPTJ5                  _SIMPTJ.Bits.SIMPTJ5
#define SIMPTJ_SIMPTJ6                  _SIMPTJ.Bits.SIMPTJ6
#define SIMPTJ_SIMPTJ7                  _SIMPTJ.Bits.SIMPTJ7

