AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define TRANSPOSE_BIT0_MASK             1
#define TRANSPOSE_BIT1_MASK             2
#define TRANSPOSE_BIT2_MASK             4
#define TRANSPOSE_BIT3_MASK             8
#define TRANSPOSE_BIT4_MASK             16
#define TRANSPOSE_BIT5_MASK             32
#define TRANSPOSE_BIT6_MASK             64
#define TRANSPOSE_BIT7_MASK             128


/*** CRCL0 - CRC Low Register 0; 0xFFFF9854 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Low byte of CRC register, bit 0 */
    byte BIT1        :1;                                       /* Low byte of CRC register, bit 1 */
    byte BIT2        :1;                                       /* Low byte of CRC register, bit 2 */
    byte BIT3        :1;                                       /* Low byte of CRC register, bit 3 */
    byte BIT4        :1;                                       /* Low byte of CRC register, bit 4 */
    byte BIT5        :1;                                       /* Low byte of CRC register, bit 5 */
    byte BIT6        :1;                                       /* Low byte of CRC register, bit 6 */
    byte BIT7        :1;                                       /* Low byte of CRC register, bit 7 */
  } Bits;
} CRCL0STR;
extern volatile CRCL0STR _CRCL0 @0xFFFF9854;
#define CRCL0                           _CRCL0.Byte
#define CRCL0_BIT0                      _CRCL0.Bits.BIT0
#define CRCL0_BIT1                      _CRCL0.Bits.BIT1
#define CRCL0_BIT2                      _CRCL0.Bits.BIT2
#define CRCL0_BIT3                      _CRCL0.Bits.BIT3
#define CRCL0_BIT4                      _CRCL0.Bits.BIT4
#define CRCL0_BIT5                      _CRCL0.Bits.BIT5
#define CRCL0_BIT6                      _CRCL0.Bits.BIT6
#define CRCL0_BIT7                      _CRCL0.Bits.BIT7
/* CRCL_ARR: Access 4 CRCLx registers in an array */
#define CRCL_ARR                        ((volatile byte *) &CRCL0)

#define CRCL0_BIT0_MASK                 1
#define CRCL0_BIT1_MASK                 2
#define CRCL0_BIT2_MASK                 4
#define CRCL0_BIT3_MASK                 8
#define CRCL0_BIT4_MASK                 16
#define CRCL0_BIT5_MASK                 32
#define CRCL0_BIT6_MASK                 64
#define CRCL0_BIT7_MASK                 128


/*** CRCL1 - CRC Low Register 1; 0xFFFF9855 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Low byte of CRC register, bit 0 */
    byte BIT1        :1;                                       /* Low byte of CRC register, bit 1 */
    byte BIT2        :1;                                       /* Low byte of CRC register, bit 2 */
    byte BIT3        :1;                                       /* Low byte of CRC register, bit 3 */
    byte BIT4        :1;                                       /* Low byte of CRC register, bit 4 */
    byte BIT5        :1;                                       /* Low byte of CRC register, bit 5 */
    byte BIT6        :1;                                       /* Low byte of CRC register, bit 6 */
    byte BIT7        :1;                                       /* Low byte of CRC register, bit 7 */
  } Bits;
} CRCL1STR;
extern volatile CRCL1STR _CRCL1 @0xFFFF9855;
#define CRCL1                           _CRCL1.Byte
#define CRCL1_BIT0                      _CRCL1.Bits.BIT0
#define CRCL1_BIT1                      _CRCL1.Bits.BIT1
#define CRCL1_BIT2                      _CRCL1.Bits.BIT2
#define CRCL1_BIT3                      _CRCL1.Bits.BIT3
#define CRCL1_BIT4                      _CRCL1.Bits.BIT4
#define CRCL1_BIT5                      _CRCL1.Bits.BIT5
#define CRCL1_BIT6                      _CRCL1.Bits.BIT6
#define CRCL1_BIT7                      _CRCL1.Bits.BIT7

#define CRCL1_BIT0_MASK                 1
#define CRCL1_BIT1_MASK                 2
#define CRCL1_BIT2_MASK                 4
#define CRCL1_BIT3_MASK                 8
#define CRCL1_BIT4_MASK                 16
#define CRCL1_BIT5_MASK                 32
#define CRCL1_BIT6_MASK                 64
#define CRCL1_BIT7_MASK                 128


/*** CRCL2 - CRC Low Register 2; 0xFFFF9856 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Low byte of CRC register, bit 0 */
    byte BIT1        :1;                                       /* Low byte of CRC register, bit 1 */
    byte BIT2        :1;                                       /* Low byte of CRC register, bit 2 */
    byte BIT3        :1;                                       /* Low byte of CRC register, bit 3 */
    byte BIT4        :1;                                       /* Low byte of CRC register, bit 4 */
    byte BIT5        :1;                                       /* Low byte of CRC register, bit 5 */
    byte BIT6        :1;                                       /* Low byte of CRC register, bit 6 */
    byte BIT7        :1;                                       /* Low byte of CRC register, bit 7 */
  } Bits;
} CRCL2STR;
extern volatile CRCL2STR _CRCL2 @0xFFFF9856;
#define CRCL2                           _CRCL2.Byte
#define CRCL2_BIT0                      _CRCL2.Bits.BIT0
#define CRCL2_BIT1                      _CRCL2.Bits.BIT1
#define CRCL2_BIT2                      _CRCL2.Bits.BIT2
#define CRCL2_BIT3                      _CRCL2.Bits.BIT3
#define CRCL2_BIT4                      _CRCL2.Bits.BIT4
#define CRCL2_BIT5                      _CRCL2.Bits.BIT5
#define CRCL2_BIT6                      _CRCL2.Bits.BIT6
#define CRCL2_BIT7                      _CRCL2.Bits.BIT7

#define CRCL2_BIT0_MASK                 1
#define CRCL2_BIT1_MASK                 2
#define CRCL2_BIT2_MASK                 4
#define CRCL2_BIT3_MASK                 8
#define CRCL2_BIT4_MASK                 16
#define CRCL2_BIT5_MASK                 32
#define CRCL2_BIT6_MASK                 64
#define CRCL2_BIT7_MASK                 128


/*** CRCL3 - CRC Low Register 3; 0xFFFF9857 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* Low byte of CRC register, bit 0 */
    byte BIT1        :1;                                       /* Low byte of CRC register, bit 1 */
    byte BIT2        :1;                                       /* Low byte of CRC register, bit 2 */
    byte BIT3        :1;                                       /* Low byte of CRC register, bit 3 */
    byte BIT4        :1;                                       /* Low byte of CRC register, bit 4 */
    byte BIT5        :1;                                       /* Low byte of CRC register, bit 5 */
    byte BIT6        :1;                                       /* Low byte of CRC register, bit 6 */
    byte BIT7        :1;                                       /* Low byte of CRC register, bit 7 */
  } Bits;
} CRCL3STR;
