AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile CRCL3STR _CRCL3 @0xFFFF9857;
#define CRCL3                           _CRCL3.Byte
#define CRCL3_BIT0                      _CRCL3.Bits.BIT0
#define CRCL3_BIT1                      _CRCL3.Bits.BIT1
#define CRCL3_BIT2                      _CRCL3.Bits.BIT2
#define CRCL3_BIT3                      _CRCL3.Bits.BIT3
#define CRCL3_BIT4                      _CRCL3.Bits.BIT4
#define CRCL3_BIT5                      _CRCL3.Bits.BIT5
#define CRCL3_BIT6                      _CRCL3.Bits.BIT6
#define CRCL3_BIT7                      _CRCL3.Bits.BIT7

#define CRCL3_BIT0_MASK                 1
#define CRCL3_BIT1_MASK                 2
#define CRCL3_BIT2_MASK                 4
#define CRCL3_BIT3_MASK                 8
#define CRCL3_BIT4_MASK                 16
#define CRCL3_BIT5_MASK                 32
#define CRCL3_BIT6_MASK                 64
#define CRCL3_BIT7_MASK                 128


/*** PDBCTRL1 - PDB Control 1 Register; 0xFFFF9860 ***/
typedef union {
  byte Byte;
  struct {
    byte LDOK        :1;                                       /* Load OK */
    byte ENA         :1;                                       /* Trigger A Enable */
    byte AOS0        :1;                                       /* Trigger A Output Select, bit 0 */
    byte AOS1        :1;                                       /* Trigger A Output Select, bit 1 */
    byte ENB         :1;                                       /* Trigger B Enable */
    byte BOS0        :1;                                       /* Trigger B Output Select, bit 0 */
    byte BOS1        :1;                                       /* Trigger B Output Select, bit 1 */
    byte LDMOD       :1;                                       /* Load mode select */
  } Bits;
  struct {
    byte         :1;
    byte grpENx  :1;
    byte grpAOS  :2;
    byte         :1;
    byte grpBOS  :2;
    byte         :1;
  } MergedBits;
} PDBCTRL1STR;
extern volatile PDBCTRL1STR _PDBCTRL1 @0xFFFF9860;
#define PDBCTRL1                        _PDBCTRL1.Byte
#define PDBCTRL1_LDOK                   _PDBCTRL1.Bits.LDOK
#define PDBCTRL1_ENA                    _PDBCTRL1.Bits.ENA
#define PDBCTRL1_AOS0                   _PDBCTRL1.Bits.AOS0
#define PDBCTRL1_AOS1                   _PDBCTRL1.Bits.AOS1
#define PDBCTRL1_ENB                    _PDBCTRL1.Bits.ENB
#define PDBCTRL1_BOS0                   _PDBCTRL1.Bits.BOS0
#define PDBCTRL1_BOS1                   _PDBCTRL1.Bits.BOS1
#define PDBCTRL1_LDMOD                  _PDBCTRL1.Bits.LDMOD
#define PDBCTRL1_AOS                    _PDBCTRL1.MergedBits.grpAOS
#define PDBCTRL1_BOS                    _PDBCTRL1.MergedBits.grpBOS

#define PDBCTRL1_LDOK_MASK              1
#define PDBCTRL1_ENA_MASK               2
#define PDBCTRL1_AOS0_MASK              4
#define PDBCTRL1_AOS1_MASK              8
#define PDBCTRL1_ENB_MASK               16
#define PDBCTRL1_BOS0_MASK              32
#define PDBCTRL1_BOS1_MASK              64
#define PDBCTRL1_LDMOD_MASK             128
#define PDBCTRL1_AOS_MASK               12
#define PDBCTRL1_AOS_BITNUM             2
#define PDBCTRL1_BOS_MASK               96
#define PDBCTRL1_BOS_BITNUM             5


/*** PDBCTRL2 - PDB Control 2 Register; 0xFFFF9861 ***/
typedef union {
  byte Byte;
  struct {
    byte SWTRIG      :1;                                       /* Software Trigger */
    byte CONT        :1;                                       /* Continuous Mode Enable */
    byte TRIGSEL0    :1;                                       /* Input Trigger, bit 0 */
    byte TRIGSEL1    :1;                                       /* Input Trigger, bit 1 */
    byte TRIGSEL2    :1;                                       /* Input Trigger, bit 2 */
    byte PRESCALER0  :1;                                       /* Clock Prescaler, bit 0 */
    byte PRESCALER1  :1;                                       /* Clock Prescaler, bit 1 */
    byte PRESCALER2  :1;                                       /* Clock Prescaler, bit 2 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTRIGSEL :3;
    byte grpPRESCALER :3;
  } MergedBits;
} PDBCTRL2STR;
extern volatile PDBCTRL2STR _PDBCTRL2 @0xFFFF9861;
#define PDBCTRL2                        _PDBCTRL2.Byte
#define PDBCTRL2_SWTRIG                 _PDBCTRL2.Bits.SWTRIG
#define PDBCTRL2_CONT                   _PDBCTRL2.Bits.CONT
#define PDBCTRL2_TRIGSEL0               _PDBCTRL2.Bits.TRIGSEL0
#define PDBCTRL2_TRIGSEL1               _PDBCTRL2.Bits.TRIGSEL1
#define PDBCTRL2_TRIGSEL2               _PDBCTRL2.Bits.TRIGSEL2
#define PDBCTRL2_PRESCALER0             _PDBCTRL2.Bits.PRESCALER0
#define PDBCTRL2_PRESCALER1             _PDBCTRL2.Bits.PRESCALER1
#define PDBCTRL2_PRESCALER2             _PDBCTRL2.Bits.PRESCALER2
#define PDBCTRL2_TRIGSEL                _PDBCTRL2.MergedBits.grpTRIGSEL
#define PDBCTRL2_PRESCALER              _PDBCTRL2.MergedBits.grpPRESCALER

#define PDBCTRL2_SWTRIG_MASK            1
#define PDBCTRL2_CONT_MASK              2
#define PDBCTRL2_TRIGSEL0_MASK          4
#define PDBCTRL2_TRIGSEL1_MASK          8
#define PDBCTRL2_TRIGSEL2_MASK          16
#define PDBCTRL2_PRESCALER0_MASK        32
#define PDBCTRL2_PRESCALER1_MASK        64
#define PDBCTRL2_PRESCALER2_MASK        128
#define PDBCTRL2_TRIGSEL_MASK           28
#define PDBCTRL2_TRIGSEL_BITNUM         2
#define PDBCTRL2_PRESCALER_MASK         224
#define PDBCTRL2_PRESCALER_BITNUM       5


/*** PDBDLYA - PDB Delay A Register; 0xFFFF9862 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYAH - PDB Delay A High Register; 0xFFFF9862 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA8     :1;                                       /* Delay A, bit 8 */
        byte DELAYA9     :1;                                       /* Delay A, bit 9 */
        byte DELAYA10    :1;                                       /* Delay A, bit 10 */
        byte DELAYA11    :1;                                       /* Delay A, bit 11 */
        byte DELAYA12    :1;                                       /* Delay A, bit 12 */
        byte DELAYA13    :1;                                       /* Delay A, bit 13 */
        byte DELAYA14    :1;                                       /* Delay A, bit 14 */
        byte DELAYA15    :1;                                       /* Delay A, bit 15 */
      } Bits;
    } PDBDLYAHSTR;
    #define PDBDLYAH                    _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Byte
    #define PDBDLYAH_DELAYA8            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA8
    #define PDBDLYAH_DELAYA9            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA9
    #define PDBDLYAH_DELAYA10           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA10
    #define PDBDLYAH_DELAYA11           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA11
    #define PDBDLYAH_DELAYA12           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA12
    #define PDBDLYAH_DELAYA13           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA13
    #define PDBDLYAH_DELAYA14           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA14
    #define PDBDLYAH_DELAYA15           _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAYA15
    
