AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
    #define PDBDLYAH_DELAYA8_MASK       1
    #define PDBDLYAH_DELAYA9_MASK       2
    #define PDBDLYAH_DELAYA10_MASK      4
    #define PDBDLYAH_DELAYA11_MASK      8
    #define PDBDLYAH_DELAYA12_MASK      16
    #define PDBDLYAH_DELAYA13_MASK      32
    #define PDBDLYAH_DELAYA14_MASK      64
    #define PDBDLYAH_DELAYA15_MASK      128
    

    /*** PDBDLYAL - PDB Delay A Low Register; 0xFFFF9863 ***/
    union {
      byte Byte;
      struct {
        byte DELAYA0     :1;                                       /* Delay A, bit 0 */
        byte DELAYA1     :1;                                       /* Delay A, bit 1 */
        byte DELAYA2     :1;                                       /* Delay A, bit 2 */
        byte DELAYA3     :1;                                       /* Delay A, bit 3 */
        byte DELAYA4     :1;                                       /* Delay A, bit 4 */
        byte DELAYA5     :1;                                       /* Delay A, bit 5 */
        byte DELAYA6     :1;                                       /* Delay A, bit 6 */
        byte DELAYA7     :1;                                       /* Delay A, bit 7 */
      } Bits;
    } PDBDLYALSTR;
    #define PDBDLYAL                    _PDBDLYA.Overlap_STR.PDBDLYALSTR.Byte
    #define PDBDLYAL_DELAYA0            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA0
    #define PDBDLYAL_DELAYA1            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA1
    #define PDBDLYAL_DELAYA2            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA2
    #define PDBDLYAL_DELAYA3            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA3
    #define PDBDLYAL_DELAYA4            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA4
    #define PDBDLYAL_DELAYA5            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA5
    #define PDBDLYAL_DELAYA6            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA6
    #define PDBDLYAL_DELAYA7            _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAYA7
    
    #define PDBDLYAL_DELAYA0_MASK       1
    #define PDBDLYAL_DELAYA1_MASK       2
    #define PDBDLYAL_DELAYA2_MASK       4
    #define PDBDLYAL_DELAYA3_MASK       8
    #define PDBDLYAL_DELAYA4_MASK       16
    #define PDBDLYAL_DELAYA5_MASK       32
    #define PDBDLYAL_DELAYA6_MASK       64
    #define PDBDLYAL_DELAYA7_MASK       128
    
  } Overlap_STR;

  struct {
    word DELAYA0     :1;                                       /* Delay A, bit 0 */
    word DELAYA1     :1;                                       /* Delay A, bit 1 */
    word DELAYA2     :1;                                       /* Delay A, bit 2 */
    word DELAYA3     :1;                                       /* Delay A, bit 3 */
    word DELAYA4     :1;                                       /* Delay A, bit 4 */
    word DELAYA5     :1;                                       /* Delay A, bit 5 */
    word DELAYA6     :1;                                       /* Delay A, bit 6 */
    word DELAYA7     :1;                                       /* Delay A, bit 7 */
    word DELAYA8     :1;                                       /* Delay A, bit 8 */
    word DELAYA9     :1;                                       /* Delay A, bit 9 */
    word DELAYA10    :1;                                       /* Delay A, bit 10 */
    word DELAYA11    :1;                                       /* Delay A, bit 11 */
    word DELAYA12    :1;                                       /* Delay A, bit 12 */
    word DELAYA13    :1;                                       /* Delay A, bit 13 */
    word DELAYA14    :1;                                       /* Delay A, bit 14 */
    word DELAYA15    :1;                                       /* Delay A, bit 15 */
  } Bits;
} PDBDLYASTR;
extern volatile PDBDLYASTR _PDBDLYA @0xFFFF9862;
#define PDBDLYA                         _PDBDLYA.Word
#define PDBDLYA_DELAYA0                 _PDBDLYA.Bits.DELAYA0
#define PDBDLYA_DELAYA1                 _PDBDLYA.Bits.DELAYA1
#define PDBDLYA_DELAYA2                 _PDBDLYA.Bits.DELAYA2
#define PDBDLYA_DELAYA3                 _PDBDLYA.Bits.DELAYA3
#define PDBDLYA_DELAYA4                 _PDBDLYA.Bits.DELAYA4
#define PDBDLYA_DELAYA5                 _PDBDLYA.Bits.DELAYA5
#define PDBDLYA_DELAYA6                 _PDBDLYA.Bits.DELAYA6
#define PDBDLYA_DELAYA7                 _PDBDLYA.Bits.DELAYA7
#define PDBDLYA_DELAYA8                 _PDBDLYA.Bits.DELAYA8
#define PDBDLYA_DELAYA9                 _PDBDLYA.Bits.DELAYA9
#define PDBDLYA_DELAYA10                _PDBDLYA.Bits.DELAYA10
#define PDBDLYA_DELAYA11                _PDBDLYA.Bits.DELAYA11
#define PDBDLYA_DELAYA12                _PDBDLYA.Bits.DELAYA12
#define PDBDLYA_DELAYA13                _PDBDLYA.Bits.DELAYA13
#define PDBDLYA_DELAYA14                _PDBDLYA.Bits.DELAYA14
#define PDBDLYA_DELAYA15                _PDBDLYA.Bits.DELAYA15

#define PDBDLYA_DELAYA0_MASK            1
#define PDBDLYA_DELAYA1_MASK            2
#define PDBDLYA_DELAYA2_MASK            4
#define PDBDLYA_DELAYA3_MASK            8
#define PDBDLYA_DELAYA4_MASK            16
#define PDBDLYA_DELAYA5_MASK            32
#define PDBDLYA_DELAYA6_MASK            64
#define PDBDLYA_DELAYA7_MASK            128
#define PDBDLYA_DELAYA8_MASK            256
#define PDBDLYA_DELAYA9_MASK            512
#define PDBDLYA_DELAYA10_MASK           1024
#define PDBDLYA_DELAYA11_MASK           2048
#define PDBDLYA_DELAYA12_MASK           4096
#define PDBDLYA_DELAYA13_MASK           8192
#define PDBDLYA_DELAYA14_MASK           16384
#define PDBDLYA_DELAYA15_MASK           32768


/*** PDBDLYB - PDB Delay B Register; 0xFFFF9864 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYBH - PDB Delay B High Register; 0xFFFF9864 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB8     :1;                                       /* Delay B, bit 8 */
        byte DELAYB9     :1;                                       /* Delay B, bit 9 */
        byte DELAYB10    :1;                                       /* Delay B, bit 10 */
        byte DELAYB11    :1;                                       /* Delay B, bit 11 */
        byte DELAYB12    :1;                                       /* Delay B, bit 12 */
        byte DELAYB13    :1;                                       /* Delay B, bit 13 */
        byte DELAYB14    :1;                                       /* Delay B, bit 14 */
        byte DELAYB15    :1;                                       /* Delay B, bit 15 */
      } Bits;
    } PDBDLYBHSTR;
    #define PDBDLYBH                    _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Byte
    #define PDBDLYBH_DELAYB8            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB8
    #define PDBDLYBH_DELAYB9            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB9
    #define PDBDLYBH_DELAYB10           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB10
    #define PDBDLYBH_DELAYB11           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB11
    #define PDBDLYBH_DELAYB12           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB12
    #define PDBDLYBH_DELAYB13           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB13
    #define PDBDLYBH_DELAYB14           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB14
    #define PDBDLYBH_DELAYB15           _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAYB15
    
