AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
    #define PDBDLYBH_DELAYB8_MASK       1
    #define PDBDLYBH_DELAYB9_MASK       2
    #define PDBDLYBH_DELAYB10_MASK      4
    #define PDBDLYBH_DELAYB11_MASK      8
    #define PDBDLYBH_DELAYB12_MASK      16
    #define PDBDLYBH_DELAYB13_MASK      32
    #define PDBDLYBH_DELAYB14_MASK      64
    #define PDBDLYBH_DELAYB15_MASK      128
    

    /*** PDBDLYBL - PDB Delay B Low Register; 0xFFFF9865 ***/
    union {
      byte Byte;
      struct {
        byte DELAYB0     :1;                                       /* Delay B, bit 0 */
        byte DELAYB1     :1;                                       /* Delay B, bit 1 */
        byte DELAYB2     :1;                                       /* Delay B, bit 2 */
        byte DELAYB3     :1;                                       /* Delay B, bit 3 */
        byte DELAYB4     :1;                                       /* Delay B, bit 4 */
        byte DELAYB5     :1;                                       /* Delay B, bit 5 */
        byte DELAYB6     :1;                                       /* Delay B, bit 6 */
        byte DELAYB7     :1;                                       /* Delay B, bit 7 */
      } Bits;
    } PDBDLYBLSTR;
    #define PDBDLYBL                    _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Byte
    #define PDBDLYBL_DELAYB0            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB0
    #define PDBDLYBL_DELAYB1            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB1
    #define PDBDLYBL_DELAYB2            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB2
    #define PDBDLYBL_DELAYB3            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB3
    #define PDBDLYBL_DELAYB4            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB4
    #define PDBDLYBL_DELAYB5            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB5
    #define PDBDLYBL_DELAYB6            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB6
    #define PDBDLYBL_DELAYB7            _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAYB7
    
    #define PDBDLYBL_DELAYB0_MASK       1
    #define PDBDLYBL_DELAYB1_MASK       2
    #define PDBDLYBL_DELAYB2_MASK       4
    #define PDBDLYBL_DELAYB3_MASK       8
    #define PDBDLYBL_DELAYB4_MASK       16
    #define PDBDLYBL_DELAYB5_MASK       32
    #define PDBDLYBL_DELAYB6_MASK       64
    #define PDBDLYBL_DELAYB7_MASK       128
    
  } Overlap_STR;

  struct {
    word DELAYB0     :1;                                       /* Delay B, bit 0 */
    word DELAYB1     :1;                                       /* Delay B, bit 1 */
    word DELAYB2     :1;                                       /* Delay B, bit 2 */
    word DELAYB3     :1;                                       /* Delay B, bit 3 */
    word DELAYB4     :1;                                       /* Delay B, bit 4 */
    word DELAYB5     :1;                                       /* Delay B, bit 5 */
    word DELAYB6     :1;                                       /* Delay B, bit 6 */
    word DELAYB7     :1;                                       /* Delay B, bit 7 */
    word DELAYB8     :1;                                       /* Delay B, bit 8 */
    word DELAYB9     :1;                                       /* Delay B, bit 9 */
    word DELAYB10    :1;                                       /* Delay B, bit 10 */
    word DELAYB11    :1;                                       /* Delay B, bit 11 */
    word DELAYB12    :1;                                       /* Delay B, bit 12 */
    word DELAYB13    :1;                                       /* Delay B, bit 13 */
    word DELAYB14    :1;                                       /* Delay B, bit 14 */
    word DELAYB15    :1;                                       /* Delay B, bit 15 */
  } Bits;
} PDBDLYBSTR;
extern volatile PDBDLYBSTR _PDBDLYB @0xFFFF9864;
#define PDBDLYB                         _PDBDLYB.Word
#define PDBDLYB_DELAYB0                 _PDBDLYB.Bits.DELAYB0
#define PDBDLYB_DELAYB1                 _PDBDLYB.Bits.DELAYB1
#define PDBDLYB_DELAYB2                 _PDBDLYB.Bits.DELAYB2
#define PDBDLYB_DELAYB3                 _PDBDLYB.Bits.DELAYB3
#define PDBDLYB_DELAYB4                 _PDBDLYB.Bits.DELAYB4
#define PDBDLYB_DELAYB5                 _PDBDLYB.Bits.DELAYB5
#define PDBDLYB_DELAYB6                 _PDBDLYB.Bits.DELAYB6
#define PDBDLYB_DELAYB7                 _PDBDLYB.Bits.DELAYB7
#define PDBDLYB_DELAYB8                 _PDBDLYB.Bits.DELAYB8
#define PDBDLYB_DELAYB9                 _PDBDLYB.Bits.DELAYB9
#define PDBDLYB_DELAYB10                _PDBDLYB.Bits.DELAYB10
#define PDBDLYB_DELAYB11                _PDBDLYB.Bits.DELAYB11
#define PDBDLYB_DELAYB12                _PDBDLYB.Bits.DELAYB12
#define PDBDLYB_DELAYB13                _PDBDLYB.Bits.DELAYB13
#define PDBDLYB_DELAYB14                _PDBDLYB.Bits.DELAYB14
#define PDBDLYB_DELAYB15                _PDBDLYB.Bits.DELAYB15

#define PDBDLYB_DELAYB0_MASK            1
#define PDBDLYB_DELAYB1_MASK            2
#define PDBDLYB_DELAYB2_MASK            4
#define PDBDLYB_DELAYB3_MASK            8
#define PDBDLYB_DELAYB4_MASK            16
#define PDBDLYB_DELAYB5_MASK            32
#define PDBDLYB_DELAYB6_MASK            64
#define PDBDLYB_DELAYB7_MASK            128
#define PDBDLYB_DELAYB8_MASK            256
#define PDBDLYB_DELAYB9_MASK            512
#define PDBDLYB_DELAYB10_MASK           1024
#define PDBDLYB_DELAYB11_MASK           2048
#define PDBDLYB_DELAYB12_MASK           4096
#define PDBDLYB_DELAYB13_MASK           8192
#define PDBDLYB_DELAYB14_MASK           16384
#define PDBDLYB_DELAYB15_MASK           32768


/*** PDBMOD - PDB Counter Modulus Register; 0xFFFF9866 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBMODH - PDB Counter Modulus High Register; 0xFFFF9866 ***/
    union {
      byte Byte;
      struct {
        byte MOD8        :1;                                       /* Counter Modulus, bit 8 */
        byte MOD9        :1;                                       /* Counter Modulus, bit 9 */
        byte MOD10       :1;                                       /* Counter Modulus, bit 10 */
        byte MOD11       :1;                                       /* Counter Modulus, bit 11 */
        byte MOD12       :1;                                       /* Counter Modulus, bit 12 */
        byte MOD13       :1;                                       /* Counter Modulus, bit 13 */
        byte MOD14       :1;                                       /* Counter Modulus, bit 14 */
        byte MOD15       :1;                                       /* Counter Modulus, bit 15 */
      } Bits;
    } PDBMODHSTR;
    #define PDBMODH                     _PDBMOD.Overlap_STR.PDBMODHSTR.Byte
    #define PDBMODH_MOD8                _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD8
    #define PDBMODH_MOD9                _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD9
    #define PDBMODH_MOD10               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD10
    #define PDBMODH_MOD11               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD11
    #define PDBMODH_MOD12               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD12
    #define PDBMODH_MOD13               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD13
    #define PDBMODH_MOD14               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD14
    #define PDBMODH_MOD15               _PDBMOD.Overlap_STR.PDBMODHSTR.Bits.MOD15
    
    #define PDBMODH_MOD8_MASK           1
    #define PDBMODH_MOD9_MASK           2
    #define PDBMODH_MOD10_MASK          4
    #define PDBMODH_MOD11_MASK          8
    #define PDBMODH_MOD12_MASK          16
    #define PDBMODH_MOD13_MASK          32
    #define PDBMODH_MOD14_MASK          64
    #define PDBMODH_MOD15_MASK          128
    

    /*** PDBMODL - PDB Counter Modulus Low Register; 0xFFFF9867 ***/
    union {
      byte Byte;
      struct {
        byte MOD0        :1;                                       /* Counter Modulus, bit 0 */
        byte MOD1        :1;                                       /* Counter Modulus, bit 1 */
        byte MOD2        :1;                                       /* Counter Modulus, bit 2 */
        byte MOD3        :1;                                       /* Counter Modulus, bit 3 */
        byte MOD4        :1;                                       /* Counter Modulus, bit 4 */
        byte MOD5        :1;                                       /* Counter Modulus, bit 5 */
        byte MOD6        :1;                                       /* Counter Modulus, bit 6 */
        byte MOD7        :1;                                       /* Counter Modulus, bit 7 */
      } Bits;
    } PDBMODLSTR;
    #define PDBMODL                     _PDBMOD.Overlap_STR.PDBMODLSTR.Byte
    #define PDBMODL_MOD0                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD0
    #define PDBMODL_MOD1                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD1
    #define PDBMODL_MOD2                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD2
    #define PDBMODL_MOD3                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD3
    #define PDBMODL_MOD4                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD4
    #define PDBMODL_MOD5                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD5
    #define PDBMODL_MOD6                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD6
    #define PDBMODL_MOD7                _PDBMOD.Overlap_STR.PDBMODLSTR.Bits.MOD7
    
    #define PDBMODL_MOD0_MASK           1
    #define PDBMODL_MOD1_MASK           2
    #define PDBMODL_MOD2_MASK           4
    #define PDBMODL_MOD3_MASK           8
    #define PDBMODL_MOD4_MASK           16
    #define PDBMODL_MOD5_MASK           32
    #define PDBMODL_MOD6_MASK           64
    #define PDBMODL_MOD7_MASK           128
    
  } Overlap_STR;

