AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    word MOD0        :1;                                       /* Counter Modulus, bit 0 */
    word MOD1        :1;                                       /* Counter Modulus, bit 1 */
    word MOD2        :1;                                       /* Counter Modulus, bit 2 */
    word MOD3        :1;                                       /* Counter Modulus, bit 3 */
    word MOD4        :1;                                       /* Counter Modulus, bit 4 */
    word MOD5        :1;                                       /* Counter Modulus, bit 5 */
    word MOD6        :1;                                       /* Counter Modulus, bit 6 */
    word MOD7        :1;                                       /* Counter Modulus, bit 7 */
    word MOD8        :1;                                       /* Counter Modulus, bit 8 */
    word MOD9        :1;                                       /* Counter Modulus, bit 9 */
    word MOD10       :1;                                       /* Counter Modulus, bit 10 */
    word MOD11       :1;                                       /* Counter Modulus, bit 11 */
    word MOD12       :1;                                       /* Counter Modulus, bit 12 */
    word MOD13       :1;                                       /* Counter Modulus, bit 13 */
    word MOD14       :1;                                       /* Counter Modulus, bit 14 */
    word MOD15       :1;                                       /* Counter Modulus, bit 15 */
  } Bits;
} PDBMODSTR;
extern volatile PDBMODSTR _PDBMOD @0xFFFF9866;
#define PDBMOD                          _PDBMOD.Word
#define PDBMOD_MOD0                     _PDBMOD.Bits.MOD0
#define PDBMOD_MOD1                     _PDBMOD.Bits.MOD1
#define PDBMOD_MOD2                     _PDBMOD.Bits.MOD2
#define PDBMOD_MOD3                     _PDBMOD.Bits.MOD3
#define PDBMOD_MOD4                     _PDBMOD.Bits.MOD4
#define PDBMOD_MOD5                     _PDBMOD.Bits.MOD5
#define PDBMOD_MOD6                     _PDBMOD.Bits.MOD6
#define PDBMOD_MOD7                     _PDBMOD.Bits.MOD7
#define PDBMOD_MOD8                     _PDBMOD.Bits.MOD8
#define PDBMOD_MOD9                     _PDBMOD.Bits.MOD9
#define PDBMOD_MOD10                    _PDBMOD.Bits.MOD10
#define PDBMOD_MOD11                    _PDBMOD.Bits.MOD11
#define PDBMOD_MOD12                    _PDBMOD.Bits.MOD12
#define PDBMOD_MOD13                    _PDBMOD.Bits.MOD13
#define PDBMOD_MOD14                    _PDBMOD.Bits.MOD14
#define PDBMOD_MOD15                    _PDBMOD.Bits.MOD15

#define PDBMOD_MOD0_MASK                1
#define PDBMOD_MOD1_MASK                2
#define PDBMOD_MOD2_MASK                4
#define PDBMOD_MOD3_MASK                8
#define PDBMOD_MOD4_MASK                16
#define PDBMOD_MOD5_MASK                32
#define PDBMOD_MOD6_MASK                64
#define PDBMOD_MOD7_MASK                128
#define PDBMOD_MOD8_MASK                256
#define PDBMOD_MOD9_MASK                512
#define PDBMOD_MOD10_MASK               1024
#define PDBMOD_MOD11_MASK               2048
#define PDBMOD_MOD12_MASK               4096
#define PDBMOD_MOD13_MASK               8192
#define PDBMOD_MOD14_MASK               16384
#define PDBMOD_MOD15_MASK               32768


/*** PDBCNT - PDB Counter Value Register; 0xFFFF9868 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBCNTH - PDB Counter Value High Register; 0xFFFF9868 ***/
    union {
      byte Byte;
      struct {
        byte COUNT8      :1;                                       /* Counter Value, bit 8 */
        byte COUNT9      :1;                                       /* Counter Value, bit 9 */
        byte COUNT10     :1;                                       /* Counter Value, bit 10 */
        byte COUNT11     :1;                                       /* Counter Value, bit 11 */
        byte COUNT12     :1;                                       /* Counter Value, bit 12 */
        byte COUNT13     :1;                                       /* Counter Value, bit 13 */
        byte COUNT14     :1;                                       /* Counter Value, bit 14 */
        byte COUNT15     :1;                                       /* Counter Value, bit 15 */
      } Bits;
    } PDBCNTHSTR;
    #define PDBCNTH                     _PDBCNT.Overlap_STR.PDBCNTHSTR.Byte
    #define PDBCNTH_COUNT8              _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT8
    #define PDBCNTH_COUNT9              _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT9
    #define PDBCNTH_COUNT10             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT10
    #define PDBCNTH_COUNT11             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT11
    #define PDBCNTH_COUNT12             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT12
    #define PDBCNTH_COUNT13             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT13
    #define PDBCNTH_COUNT14             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT14
    #define PDBCNTH_COUNT15             _PDBCNT.Overlap_STR.PDBCNTHSTR.Bits.COUNT15
    
    #define PDBCNTH_COUNT8_MASK         1
    #define PDBCNTH_COUNT9_MASK         2
    #define PDBCNTH_COUNT10_MASK        4
    #define PDBCNTH_COUNT11_MASK        8
    #define PDBCNTH_COUNT12_MASK        16
    #define PDBCNTH_COUNT13_MASK        32
    #define PDBCNTH_COUNT14_MASK        64
    #define PDBCNTH_COUNT15_MASK        128
    

    /*** PDBCNTL - PDB Counter Value Low Register; 0xFFFF9869 ***/
    union {
      byte Byte;
      struct {
        byte COUNT0      :1;                                       /* Counter Value, bit 0 */
        byte COUNT1      :1;                                       /* Counter Value, bit 1 */
        byte COUNT2      :1;                                       /* Counter Value, bit 2 */
        byte COUNT3      :1;                                       /* Counter Value, bit 3 */
        byte COUNT4      :1;                                       /* Counter Value, bit 4 */
        byte COUNT5      :1;                                       /* Counter Value, bit 5 */
        byte COUNT6      :1;                                       /* Counter Value, bit 6 */
        byte COUNT7      :1;                                       /* Counter Value, bit 7 */
      } Bits;
    } PDBCNTLSTR;
    #define PDBCNTL                     _PDBCNT.Overlap_STR.PDBCNTLSTR.Byte
    #define PDBCNTL_COUNT0              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT0
    #define PDBCNTL_COUNT1              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT1
    #define PDBCNTL_COUNT2              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT2
    #define PDBCNTL_COUNT3              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT3
    #define PDBCNTL_COUNT4              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT4
    #define PDBCNTL_COUNT5              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT5
    #define PDBCNTL_COUNT6              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT6
    #define PDBCNTL_COUNT7              _PDBCNT.Overlap_STR.PDBCNTLSTR.Bits.COUNT7
    
    #define PDBCNTL_COUNT0_MASK         1
    #define PDBCNTL_COUNT1_MASK         2
    #define PDBCNTL_COUNT2_MASK         4
    #define PDBCNTL_COUNT3_MASK         8
    #define PDBCNTL_COUNT4_MASK         16
    #define PDBCNTL_COUNT5_MASK         32
    #define PDBCNTL_COUNT6_MASK         64
    #define PDBCNTL_COUNT7_MASK         128
    
  } Overlap_STR;

