AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    word COUNT0      :1;                                       /* Counter Value, bit 0 */
    word COUNT1      :1;                                       /* Counter Value, bit 1 */
    word COUNT2      :1;                                       /* Counter Value, bit 2 */
    word COUNT3      :1;                                       /* Counter Value, bit 3 */
    word COUNT4      :1;                                       /* Counter Value, bit 4 */
    word COUNT5      :1;                                       /* Counter Value, bit 5 */
    word COUNT6      :1;                                       /* Counter Value, bit 6 */
    word COUNT7      :1;                                       /* Counter Value, bit 7 */
    word COUNT8      :1;                                       /* Counter Value, bit 8 */
    word COUNT9      :1;                                       /* Counter Value, bit 9 */
    word COUNT10     :1;                                       /* Counter Value, bit 10 */
    word COUNT11     :1;                                       /* Counter Value, bit 11 */
    word COUNT12     :1;                                       /* Counter Value, bit 12 */
    word COUNT13     :1;                                       /* Counter Value, bit 13 */
    word COUNT14     :1;                                       /* Counter Value, bit 14 */
    word COUNT15     :1;                                       /* Counter Value, bit 15 */
  } Bits;
} PDBCNTSTR;
extern volatile PDBCNTSTR _PDBCNT @0xFFFF9868;
#define PDBCNT                          _PDBCNT.Word
#define PDBCNT_COUNT0                   _PDBCNT.Bits.COUNT0
#define PDBCNT_COUNT1                   _PDBCNT.Bits.COUNT1
#define PDBCNT_COUNT2                   _PDBCNT.Bits.COUNT2
#define PDBCNT_COUNT3                   _PDBCNT.Bits.COUNT3
#define PDBCNT_COUNT4                   _PDBCNT.Bits.COUNT4
#define PDBCNT_COUNT5                   _PDBCNT.Bits.COUNT5
#define PDBCNT_COUNT6                   _PDBCNT.Bits.COUNT6
#define PDBCNT_COUNT7                   _PDBCNT.Bits.COUNT7
#define PDBCNT_COUNT8                   _PDBCNT.Bits.COUNT8
#define PDBCNT_COUNT9                   _PDBCNT.Bits.COUNT9
#define PDBCNT_COUNT10                  _PDBCNT.Bits.COUNT10
#define PDBCNT_COUNT11                  _PDBCNT.Bits.COUNT11
#define PDBCNT_COUNT12                  _PDBCNT.Bits.COUNT12
#define PDBCNT_COUNT13                  _PDBCNT.Bits.COUNT13
#define PDBCNT_COUNT14                  _PDBCNT.Bits.COUNT14
#define PDBCNT_COUNT15                  _PDBCNT.Bits.COUNT15

#define PDBCNT_COUNT0_MASK              1
#define PDBCNT_COUNT1_MASK              2
#define PDBCNT_COUNT2_MASK              4
#define PDBCNT_COUNT3_MASK              8
#define PDBCNT_COUNT4_MASK              16
#define PDBCNT_COUNT5_MASK              32
#define PDBCNT_COUNT6_MASK              64
#define PDBCNT_COUNT7_MASK              128
#define PDBCNT_COUNT8_MASK              256
#define PDBCNT_COUNT9_MASK              512
#define PDBCNT_COUNT10_MASK             1024
#define PDBCNT_COUNT11_MASK             2048
#define PDBCNT_COUNT12_MASK             4096
#define PDBCNT_COUNT13_MASK             8192
#define PDBCNT_COUNT14_MASK             16384
#define PDBCNT_COUNT15_MASK             32768


/*** PDBSCR - PDB Status Register; 0xFFFF986A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte DAF         :1;                                       /* Delay A flag */
    byte             :1; 
    byte DBF         :1;                                       /* Delay B flag */
    byte             :1; 
    byte COF         :1;                                       /* Counter overflow flag */
    byte PDBEN       :1;                                       /* PDB module enable */
    byte             :1; 
  } Bits;
} PDBSCRSTR;
extern volatile PDBSCRSTR _PDBSCR @0xFFFF986A;
#define PDBSCR                          _PDBSCR.Byte
#define PDBSCR_DAF                      _PDBSCR.Bits.DAF
#define PDBSCR_DBF                      _PDBSCR.Bits.DBF
#define PDBSCR_COF                      _PDBSCR.Bits.COF
#define PDBSCR_PDBEN                    _PDBSCR.Bits.PDBEN

#define PDBSCR_DAF_MASK                 2
#define PDBSCR_DBF_MASK                 8
#define PDBSCR_COF_MASK                 32
#define PDBSCR_PDBEN_MASK               64


/*** WDOG_ST_CTRL - Watchdog Status and Control Register; 0xFFFF9880 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** WDOG_ST_CTRL_H - Watchdog Status and Control Register High; 0xFFFF9880 ***/
    union {
      word Word;
      struct {
        word WDOG_EN     :1;                                       /* Watchdog Enable */
        word CLK_SRC     :1;                                       /* Clock Source Select */
        word IRQ_RST_EN  :1;                                       /* Interrupt Enable */
        word WIN_EN      :1;                                       /* Window mode */
        word ALLOW_UPDATE :1;                                      /* Write once registers update */
        word DBG_EN      :1;                                       /* Debug mode enable */
        word STOP_EN     :1;                                       /* Stop mode enable */
        word WAIT_EN     :1;                                       /* Wait mode enable */
        word             :1; 
        word             :1; 
        word TESTWDOG    :1;                                       /* Test watchdog */
        word TESTSEL     :1;                                       /* Test Selection */
        word BYTESEL0    :1;                                       /* Byte Test Selection, bit 0 */
        word BYTESEL1    :1;                                       /* Byte Test Selection, bit 1 */
        word DISABLE_TESTWDOG :1;                                  /* Test Mode Disable */
        word             :1; 
      } Bits;
      struct {
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word     :1;
        word grpBYTESEL :2;
        word     :1;
        word     :1;
      } MergedBits;
    } WDOG_ST_CTRL_HSTR;
    #define WDOG_ST_CTRL_H              _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Word
    #define WDOG_ST_CTRL_H_WDOG_EN      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.WDOG_EN
    #define WDOG_ST_CTRL_H_CLK_SRC      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.CLK_SRC
    #define WDOG_ST_CTRL_H_IRQ_RST_EN   _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.IRQ_RST_EN
    #define WDOG_ST_CTRL_H_WIN_EN       _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.WIN_EN
    #define WDOG_ST_CTRL_H_ALLOW_UPDATE _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.ALLOW_UPDATE
    #define WDOG_ST_CTRL_H_DBG_EN       _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.DBG_EN
    #define WDOG_ST_CTRL_H_STOP_EN      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.STOP_EN
    #define WDOG_ST_CTRL_H_WAIT_EN      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.WAIT_EN
    #define WDOG_ST_CTRL_H_TESTWDOG     _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.TESTWDOG
    #define WDOG_ST_CTRL_H_TESTSEL      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.TESTSEL
    #define WDOG_ST_CTRL_H_BYTESEL0     _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.BYTESEL0
    #define WDOG_ST_CTRL_H_BYTESEL1     _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.BYTESEL1
    #define WDOG_ST_CTRL_H_DISABLE_TESTWDOG _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.Bits.DISABLE_TESTWDOG
    #define WDOG_ST_CTRL_H_BYTESEL      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_HSTR.MergedBits.grpBYTESEL
    
    #define WDOG_ST_CTRL_H_WDOG_EN_MASK 1
    #define WDOG_ST_CTRL_H_CLK_SRC_MASK 2
    #define WDOG_ST_CTRL_H_IRQ_RST_EN_MASK 4
    #define WDOG_ST_CTRL_H_WIN_EN_MASK  8
    #define WDOG_ST_CTRL_H_ALLOW_UPDATE_MASK 16
    #define WDOG_ST_CTRL_H_DBG_EN_MASK  32
    #define WDOG_ST_CTRL_H_STOP_EN_MASK 64
    #define WDOG_ST_CTRL_H_WAIT_EN_MASK 128
    #define WDOG_ST_CTRL_H_TESTWDOG_MASK 1024
    #define WDOG_ST_CTRL_H_TESTSEL_MASK 2048
    #define WDOG_ST_CTRL_H_BYTESEL0_MASK 4096
    #define WDOG_ST_CTRL_H_BYTESEL1_MASK 8192
    #define WDOG_ST_CTRL_H_DISABLE_TESTWDOG_MASK 16384
    #define WDOG_ST_CTRL_H_BYTESEL_MASK 12288
    #define WDOG_ST_CTRL_H_BYTESEL_BITNUM 12
    

    /*** WDOG_ST_CTRL_L - Watchdog Status and Control Register Low; 0xFFFF9882 ***/
    union {
      word Word;
      struct {
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word INT_FLG     :1;                                       /* Interrupt Flag */
      } Bits;
    } WDOG_ST_CTRL_LSTR;
    #define WDOG_ST_CTRL_L              _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_LSTR.Word
    #define WDOG_ST_CTRL_L_INT_FLG      _WDOG_ST_CTRL.Overlap_STR.WDOG_ST_CTRL_LSTR.Bits.INT_FLG
    
    #define WDOG_ST_CTRL_L_INT_FLG_MASK 32768
    
  } Overlap_STR;

