AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword INT_FLG    :1;                                       /* Interrupt Flag */
    dword WDOG_EN    :1;                                       /* Watchdog Enable */
    dword CLK_SRC    :1;                                       /* Clock Source Select */
    dword IRQ_RST_EN :1;                                       /* Interrupt Enable */
    dword WIN_EN     :1;                                       /* Window mode */
    dword ALLOW_UPDATE :1;                                     /* Write once registers update */
    dword DBG_EN     :1;                                       /* Debug mode enable */
    dword STOP_EN    :1;                                       /* Stop mode enable */
    dword WAIT_EN    :1;                                       /* Wait mode enable */
    dword            :1; 
    dword            :1; 
    dword TESTWDOG   :1;                                       /* Test watchdog */
    dword TESTSEL    :1;                                       /* Test Selection */
    dword BYTESEL0   :1;                                       /* Byte Test Selection, bit 0 */
    dword BYTESEL1   :1;                                       /* Byte Test Selection, bit 1 */
    dword DISABLE_TESTWDOG :1;                                 /* Test Mode Disable */
    dword            :1; 
  } Bits;
  struct {
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpBYTESEL :2;
    dword        :1;
    dword        :1;
  } MergedBits;
} WDOG_ST_CTRLSTR;
extern volatile WDOG_ST_CTRLSTR _WDOG_ST_CTRL @0xFFFF9880;
#define WDOG_ST_CTRL                    _WDOG_ST_CTRL.Dword
#define WDOG_ST_CTRL_INT_FLG            _WDOG_ST_CTRL.Bits.INT_FLG
#define WDOG_ST_CTRL_WDOG_EN            _WDOG_ST_CTRL.Bits.WDOG_EN
#define WDOG_ST_CTRL_CLK_SRC            _WDOG_ST_CTRL.Bits.CLK_SRC
#define WDOG_ST_CTRL_IRQ_RST_EN         _WDOG_ST_CTRL.Bits.IRQ_RST_EN
#define WDOG_ST_CTRL_WIN_EN             _WDOG_ST_CTRL.Bits.WIN_EN
#define WDOG_ST_CTRL_ALLOW_UPDATE       _WDOG_ST_CTRL.Bits.ALLOW_UPDATE
#define WDOG_ST_CTRL_DBG_EN             _WDOG_ST_CTRL.Bits.DBG_EN
#define WDOG_ST_CTRL_STOP_EN            _WDOG_ST_CTRL.Bits.STOP_EN
#define WDOG_ST_CTRL_WAIT_EN            _WDOG_ST_CTRL.Bits.WAIT_EN
#define WDOG_ST_CTRL_TESTWDOG           _WDOG_ST_CTRL.Bits.TESTWDOG
#define WDOG_ST_CTRL_TESTSEL            _WDOG_ST_CTRL.Bits.TESTSEL
#define WDOG_ST_CTRL_BYTESEL0           _WDOG_ST_CTRL.Bits.BYTESEL0
#define WDOG_ST_CTRL_BYTESEL1           _WDOG_ST_CTRL.Bits.BYTESEL1
#define WDOG_ST_CTRL_DISABLE_TESTWDOG   _WDOG_ST_CTRL.Bits.DISABLE_TESTWDOG
#define WDOG_ST_CTRL_BYTESEL            _WDOG_ST_CTRL.MergedBits.grpBYTESEL

#define WDOG_ST_CTRL_INT_FLG_MASK       32768
#define WDOG_ST_CTRL_WDOG_EN_MASK       65536
#define WDOG_ST_CTRL_CLK_SRC_MASK       131072
#define WDOG_ST_CTRL_IRQ_RST_EN_MASK    262144
#define WDOG_ST_CTRL_WIN_EN_MASK        524288
#define WDOG_ST_CTRL_ALLOW_UPDATE_MASK  1048576
#define WDOG_ST_CTRL_DBG_EN_MASK        2097152
#define WDOG_ST_CTRL_STOP_EN_MASK       4194304
#define WDOG_ST_CTRL_WAIT_EN_MASK       8388608
#define WDOG_ST_CTRL_TESTWDOG_MASK      67108864
#define WDOG_ST_CTRL_TESTSEL_MASK       134217728
#define WDOG_ST_CTRL_BYTESEL0_MASK      268435456
#define WDOG_ST_CTRL_BYTESEL1_MASK      536870912
#define WDOG_ST_CTRL_DISABLE_TESTWDOG_MASK 1073741824
#define WDOG_ST_CTRL_BYTESEL_MASK       805306368
#define WDOG_ST_CTRL_BYTESEL_BITNUM     28


/*** WDOG_TO_VAL - Watchdog Control and Status Register; 0xFFFF9884 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** WDOG_TO_VAL_H - Watchdog Control and Status Register High; 0xFFFF9884 ***/
    union {
      word Word;
    } WDOG_TO_VAL_HSTR;
    #define WDOG_TO_VAL_H               _WDOG_TO_VAL.Overlap_STR.WDOG_TO_VAL_HSTR.Word
    

    /*** WDOG_TO_VAL_L - Watchdog Control and Status Register Low; 0xFFFF9886 ***/
    union {
      word Word;
    } WDOG_TO_VAL_LSTR;
    #define WDOG_TO_VAL_L               _WDOG_TO_VAL.Overlap_STR.WDOG_TO_VAL_LSTR.Word
    
  } Overlap_STR;

  struct {
    dword TO_VAL_LOW :16;                                      /* Timeout Value Low */
    dword TO_VAL_HIGH :16;                                     /* Timeout Value High */
  } Bits;
} WDOG_TO_VALSTR;
extern volatile WDOG_TO_VALSTR _WDOG_TO_VAL @0xFFFF9884;
#define WDOG_TO_VAL                     _WDOG_TO_VAL.Dword
#define WDOG_TO_VAL_TO_VAL_LOW          _WDOG_TO_VAL.Bits.TO_VAL_LOW
#define WDOG_TO_VAL_TO_VAL_HIGH         _WDOG_TO_VAL.Bits.TO_VAL_HIGH

#define WDOG_TO_VAL_TO_VAL_LOW_MASK     65535
#define WDOG_TO_VAL_TO_VAL_LOW_BITNUM   0
#define WDOG_TO_VAL_TO_VAL_HIGH_MASK    4294901760
#define WDOG_TO_VAL_TO_VAL_HIGH_BITNUM  16


/*** WDOG_WIN - Watchdog Window Register; 0xFFFF9888 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** WDOG_WIN_H - Watchdog Window Register High; 0xFFFF9888 ***/
    union {
      word Word;
    } WDOG_WIN_HSTR;
    #define WDOG_WIN_H                  _WDOG_WIN.Overlap_STR.WDOG_WIN_HSTR.Word
    

    /*** WDOG_WIN_L - Watchdog Window Register Low; 0xFFFF988A ***/
    union {
      word Word;
    } WDOG_WIN_LSTR;
    #define WDOG_WIN_L                  _WDOG_WIN.Overlap_STR.WDOG_WIN_LSTR.Word
    
  } Overlap_STR;

