AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
  struct {
    dword WIN_LOW    :16;                                      /* Window Low */
    dword WIN_HIGH   :16;                                      /* Window High */
  } Bits;
} WDOG_WINSTR;
extern volatile WDOG_WINSTR _WDOG_WIN @0xFFFF9888;
#define WDOG_WIN                        _WDOG_WIN.Dword
#define WDOG_WIN_WIN_LOW                _WDOG_WIN.Bits.WIN_LOW
#define WDOG_WIN_WIN_HIGH               _WDOG_WIN.Bits.WIN_HIGH

#define WDOG_WIN_WIN_LOW_MASK           65535
#define WDOG_WIN_WIN_LOW_BITNUM         0
#define WDOG_WIN_WIN_HIGH_MASK          4294901760
#define WDOG_WIN_WIN_HIGH_BITNUM        16


/*** WDOG_REFRESH - Watchdog Refresh Register; 0xFFFF988C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** WDOG_REFRESH_H - Watchdog Refresh High Register; 0xFFFF988C ***/
    union {
      byte Byte;
    } WDOG_REFRESH_HSTR;
    #define WDOG_REFRESH_H              _WDOG_REFRESH.Overlap_STR.WDOG_REFRESH_HSTR.Byte
    

    /*** WDOG_REFRESH_L - Watchdog Refresh Low Register; 0xFFFF988D ***/
    union {
      byte Byte;
    } WDOG_REFRESH_LSTR;
    #define WDOG_REFRESH_L              _WDOG_REFRESH.Overlap_STR.WDOG_REFRESH_LSTR.Byte
    
  } Overlap_STR;

} WDOG_REFRESHSTR;
extern volatile WDOG_REFRESHSTR _WDOG_REFRESH @0xFFFF988C;
#define WDOG_REFRESH                    _WDOG_REFRESH.Word


/*** WDOG_UNLOCK - Watchdog Unlock Register; 0xFFFF988E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** WDOG_UNLOCK_H - Watchdog Unlock High Register; 0xFFFF988E ***/
    union {
      byte Byte;
    } WDOG_UNLOCK_HSTR;
    #define WDOG_UNLOCK_H               _WDOG_UNLOCK.Overlap_STR.WDOG_UNLOCK_HSTR.Byte
    

    /*** WDOG_UNLOCK_L - Watchdog Unlock Low Register; 0xFFFF988F ***/
    union {
      byte Byte;
    } WDOG_UNLOCK_LSTR;
    #define WDOG_UNLOCK_L               _WDOG_UNLOCK.Overlap_STR.WDOG_UNLOCK_LSTR.Byte
    
  } Overlap_STR;

} WDOG_UNLOCKSTR;
extern volatile WDOG_UNLOCKSTR _WDOG_UNLOCK @0xFFFF988E;
#define WDOG_UNLOCK                     _WDOG_UNLOCK.Word


/*** WDOG_TIMER_OUT - Watchdog Timer Output Register; 0xFFFF9890 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** WDOG_TIMER_OUT_H - Watchdog Timer Output Register High; 0xFFFF9890 ***/
    union {
      word Word;
    } WDOG_TIMER_OUT_HSTR;
    #define WDOG_TIMER_OUT_H            _WDOG_TIMER_OUT.Overlap_STR.WDOG_TIMER_OUT_HSTR.Word
    

    /*** WDOG_TIMER_OUT_L - Watchdog Timer Output Register Low; 0xFFFF9892 ***/
    union {
      word Word;
    } WDOG_TIMER_OUT_LSTR;
    #define WDOG_TIMER_OUT_L            _WDOG_TIMER_OUT.Overlap_STR.WDOG_TIMER_OUT_LSTR.Word
    
  } Overlap_STR;

  struct {
    dword TIMER_OUT_LOW :16;                                   /* Timer Output Low */
    dword TIMER_OUT_HIGH :16;                                  /* Timer Output High */
  } Bits;
} WDOG_TIMER_OUTSTR;
extern volatile WDOG_TIMER_OUTSTR _WDOG_TIMER_OUT @0xFFFF9890;
#define WDOG_TIMER_OUT                  _WDOG_TIMER_OUT.Dword
#define WDOG_TIMER_OUT_TIMER_OUT_LOW    _WDOG_TIMER_OUT.Bits.TIMER_OUT_LOW
#define WDOG_TIMER_OUT_TIMER_OUT_HIGH   _WDOG_TIMER_OUT.Bits.TIMER_OUT_HIGH

#define WDOG_TIMER_OUT_TIMER_OUT_LOW_MASK 65535
#define WDOG_TIMER_OUT_TIMER_OUT_LOW_BITNUM 0
#define WDOG_TIMER_OUT_TIMER_OUT_HIGH_MASK 4294901760
#define WDOG_TIMER_OUT_TIMER_OUT_HIGH_BITNUM 16


/*** WDOG_RST_CNT - Watchdog Reset Count Register; 0xFFFF9894 ***/
typedef union {
  word Word;
} WDOG_RST_CNTSTR;
extern volatile WDOG_RST_CNTSTR _WDOG_RST_CNT @0xFFFF9894;
#define WDOG_RST_CNT                    _WDOG_RST_CNT.Word


/*** IEVENT_DR0 - iEvent Data Register 0; 0xFFFF9A00 ***/
typedef union {
  byte Byte;
  struct {
    byte In_A        :1;                                       /* Event Input A */
    byte In_B        :1;                                       /* Event Input B */
    byte In_C        :1;                                       /* Event Input C */
    byte In_D        :1;                                       /* Event Input D */
    byte Output_FSM0 :1;                                       /* Output Finite State Machine, bit 0 */
    byte Output_FSM1 :1;                                       /* Output Finite State Machine, bit 1 */
    byte Output_FSM2 :1;                                       /* Output Finite State Machine, bit 2 */
    byte Ev_Out      :1;                                       /* Event Output. This bit represents the state of the configured event output */
  } Bits;
  struct {
    byte grpIn_x :4;
    byte grpOutput_FSM :3;
    byte         :1;
  } MergedBits;
} IEVENT_DR0STR;
extern volatile IEVENT_DR0STR _IEVENT_DR0 @0xFFFF9A00;
#define IEVENT_DR0                      _IEVENT_DR0.Byte
#define IEVENT_DR0_In_A                 _IEVENT_DR0.Bits.In_A
#define IEVENT_DR0_In_B                 _IEVENT_DR0.Bits.In_B
#define IEVENT_DR0_In_C                 _IEVENT_DR0.Bits.In_C
#define IEVENT_DR0_In_D                 _IEVENT_DR0.Bits.In_D
#define IEVENT_DR0_Output_FSM0          _IEVENT_DR0.Bits.Output_FSM0
#define IEVENT_DR0_Output_FSM1          _IEVENT_DR0.Bits.Output_FSM1
#define IEVENT_DR0_Output_FSM2          _IEVENT_DR0.Bits.Output_FSM2
#define IEVENT_DR0_Ev_Out               _IEVENT_DR0.Bits.Ev_Out
/* IEVENT_DR_ARR: Access 4 IEVENT_DRx registers in an array */
#define IEVENT_DR_ARR                   ((volatile byte *) &IEVENT_DR0)
#define IEVENT_DR0_In_x                 _IEVENT_DR0.MergedBits.grpIn_x
#define IEVENT_DR0_Output_FSM           _IEVENT_DR0.MergedBits.grpOutput_FSM

#define IEVENT_DR0_In_A_MASK            1
#define IEVENT_DR0_In_B_MASK            2
#define IEVENT_DR0_In_C_MASK            4
#define IEVENT_DR0_In_D_MASK            8
#define IEVENT_DR0_Output_FSM0_MASK     16
#define IEVENT_DR0_Output_FSM1_MASK     32
#define IEVENT_DR0_Output_FSM2_MASK     64
#define IEVENT_DR0_Ev_Out_MASK          128
#define IEVENT_DR0_In_x_MASK            15
#define IEVENT_DR0_In_x_BITNUM          0
#define IEVENT_DR0_Output_FSM_MASK      112
#define IEVENT_DR0_Output_FSM_BITNUM    4


/*** IEVENT_DR1 - iEvent Data Register 1; 0xFFFF9A01 ***/
typedef union {
  byte Byte;
  struct {
    byte In_A        :1;                                       /* Event Input A */
    byte In_B        :1;                                       /* Event Input B */
    byte In_C        :1;                                       /* Event Input C */
    byte In_D        :1;                                       /* Event Input D */
    byte Output_FSM0 :1;                                       /* Output Finite State Machine, bit 0 */
    byte Output_FSM1 :1;                                       /* Output Finite State Machine, bit 1 */
    byte Output_FSM2 :1;                                       /* Output Finite State Machine, bit 2 */
    byte Ev_Out      :1;                                       /* Event Output. This bit represents the state of the configured event output */
  } Bits;
  struct {
    byte grpIn_x :4;
    byte grpOutput_FSM :3;
    byte         :1;
  } MergedBits;
} IEVENT_DR1STR;
extern volatile IEVENT_DR1STR _IEVENT_DR1 @0xFFFF9A01;
#define IEVENT_DR1                      _IEVENT_DR1.Byte
#define IEVENT_DR1_In_A                 _IEVENT_DR1.Bits.In_A
#define IEVENT_DR1_In_B                 _IEVENT_DR1.Bits.In_B
#define IEVENT_DR1_In_C                 _IEVENT_DR1.Bits.In_C
#define IEVENT_DR1_In_D                 _IEVENT_DR1.Bits.In_D
#define IEVENT_DR1_Output_FSM0          _IEVENT_DR1.Bits.Output_FSM0
#define IEVENT_DR1_Output_FSM1          _IEVENT_DR1.Bits.Output_FSM1
#define IEVENT_DR1_Output_FSM2          _IEVENT_DR1.Bits.Output_FSM2
#define IEVENT_DR1_Ev_Out               _IEVENT_DR1.Bits.Ev_Out
#define IEVENT_DR1_In_x                 _IEVENT_DR1.MergedBits.grpIn_x
#define IEVENT_DR1_Output_FSM           _IEVENT_DR1.MergedBits.grpOutput_FSM

#define IEVENT_DR1_In_A_MASK            1
#define IEVENT_DR1_In_B_MASK            2
#define IEVENT_DR1_In_C_MASK            4
#define IEVENT_DR1_In_D_MASK            8
#define IEVENT_DR1_Output_FSM0_MASK     16
#define IEVENT_DR1_Output_FSM1_MASK     32
#define IEVENT_DR1_Output_FSM2_MASK     64
#define IEVENT_DR1_Ev_Out_MASK          128
#define IEVENT_DR1_In_x_MASK            15
#define IEVENT_DR1_In_x_BITNUM          0
#define IEVENT_DR1_Output_FSM_MASK      112
#define IEVENT_DR1_Output_FSM_BITNUM    4


