AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** IEVENT_DR2 - iEvent Data Register 2; 0xFFFF9A02 ***/
typedef union {
  byte Byte;
  struct {
    byte In_A        :1;                                       /* Event Input A */
    byte In_B        :1;                                       /* Event Input B */
    byte In_C        :1;                                       /* Event Input C */
    byte In_D        :1;                                       /* Event Input D */
    byte Output_FSM0 :1;                                       /* Output Finite State Machine, bit 0 */
    byte Output_FSM1 :1;                                       /* Output Finite State Machine, bit 1 */
    byte Output_FSM2 :1;                                       /* Output Finite State Machine, bit 2 */
    byte Ev_Out      :1;                                       /* Event Output. This bit represents the state of the configured event output */
  } Bits;
  struct {
    byte grpIn_x :4;
    byte grpOutput_FSM :3;
    byte         :1;
  } MergedBits;
} IEVENT_DR2STR;
extern volatile IEVENT_DR2STR _IEVENT_DR2 @0xFFFF9A02;
#define IEVENT_DR2                      _IEVENT_DR2.Byte
#define IEVENT_DR2_In_A                 _IEVENT_DR2.Bits.In_A
#define IEVENT_DR2_In_B                 _IEVENT_DR2.Bits.In_B
#define IEVENT_DR2_In_C                 _IEVENT_DR2.Bits.In_C
#define IEVENT_DR2_In_D                 _IEVENT_DR2.Bits.In_D
#define IEVENT_DR2_Output_FSM0          _IEVENT_DR2.Bits.Output_FSM0
#define IEVENT_DR2_Output_FSM1          _IEVENT_DR2.Bits.Output_FSM1
#define IEVENT_DR2_Output_FSM2          _IEVENT_DR2.Bits.Output_FSM2
#define IEVENT_DR2_Ev_Out               _IEVENT_DR2.Bits.Ev_Out
#define IEVENT_DR2_In_x                 _IEVENT_DR2.MergedBits.grpIn_x
#define IEVENT_DR2_Output_FSM           _IEVENT_DR2.MergedBits.grpOutput_FSM

#define IEVENT_DR2_In_A_MASK            1
#define IEVENT_DR2_In_B_MASK            2
#define IEVENT_DR2_In_C_MASK            4
#define IEVENT_DR2_In_D_MASK            8
#define IEVENT_DR2_Output_FSM0_MASK     16
#define IEVENT_DR2_Output_FSM1_MASK     32
#define IEVENT_DR2_Output_FSM2_MASK     64
#define IEVENT_DR2_Ev_Out_MASK          128
#define IEVENT_DR2_In_x_MASK            15
#define IEVENT_DR2_In_x_BITNUM          0
#define IEVENT_DR2_Output_FSM_MASK      112
#define IEVENT_DR2_Output_FSM_BITNUM    4


/*** IEVENT_DR3 - iEvent Data Register 3; 0xFFFF9A03 ***/
typedef union {
  byte Byte;
  struct {
    byte In_A        :1;                                       /* Event Input A */
    byte In_B        :1;                                       /* Event Input B */
    byte In_C        :1;                                       /* Event Input C */
    byte In_D        :1;                                       /* Event Input D */
    byte Output_FSM0 :1;                                       /* Output Finite State Machine, bit 0 */
    byte Output_FSM1 :1;                                       /* Output Finite State Machine, bit 1 */
    byte Output_FSM2 :1;                                       /* Output Finite State Machine, bit 2 */
    byte Ev_Out      :1;                                       /* Event Output. This bit represents the state of the configured event output */
  } Bits;
  struct {
    byte grpIn_x :4;
    byte grpOutput_FSM :3;
    byte         :1;
  } MergedBits;
} IEVENT_DR3STR;
extern volatile IEVENT_DR3STR _IEVENT_DR3 @0xFFFF9A03;
#define IEVENT_DR3                      _IEVENT_DR3.Byte
#define IEVENT_DR3_In_A                 _IEVENT_DR3.Bits.In_A
#define IEVENT_DR3_In_B                 _IEVENT_DR3.Bits.In_B
#define IEVENT_DR3_In_C                 _IEVENT_DR3.Bits.In_C
#define IEVENT_DR3_In_D                 _IEVENT_DR3.Bits.In_D
#define IEVENT_DR3_Output_FSM0          _IEVENT_DR3.Bits.Output_FSM0
#define IEVENT_DR3_Output_FSM1          _IEVENT_DR3.Bits.Output_FSM1
#define IEVENT_DR3_Output_FSM2          _IEVENT_DR3.Bits.Output_FSM2
#define IEVENT_DR3_Ev_Out               _IEVENT_DR3.Bits.Ev_Out
#define IEVENT_DR3_In_x                 _IEVENT_DR3.MergedBits.grpIn_x
#define IEVENT_DR3_Output_FSM           _IEVENT_DR3.MergedBits.grpOutput_FSM

#define IEVENT_DR3_In_A_MASK            1
#define IEVENT_DR3_In_B_MASK            2
#define IEVENT_DR3_In_C_MASK            4
#define IEVENT_DR3_In_D_MASK            8
#define IEVENT_DR3_Output_FSM0_MASK     16
#define IEVENT_DR3_Output_FSM1_MASK     32
#define IEVENT_DR3_Output_FSM2_MASK     64
#define IEVENT_DR3_Ev_Out_MASK          128
#define IEVENT_DR3_In_x_MASK            15
#define IEVENT_DR3_In_x_BITNUM          0
#define IEVENT_DR3_Output_FSM_MASK      112
#define IEVENT_DR3_Output_FSM_BITNUM    4


/*** IEVENT_CR0 - iEvent Control Register 0; 0xFFFF9A80 ***/
typedef union {
  byte Byte;
  struct {
    byte Type0       :1;                                       /* Output Channel Type, bit 0 */
    byte Type1       :1;                                       /* Output Channel Type, bit 1 */
    byte OSE         :1;                                       /* One-Shot Enable */
    byte DDB         :1;                                       /* Disable Done Broadcast */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RO          :1;                                       /* Read-Only. This bit determines if the configuration registers can be written or are read-only */
  } Bits;
  struct {
    byte grpType :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IEVENT_CR0STR;
extern volatile IEVENT_CR0STR _IEVENT_CR0 @0xFFFF9A80;
#define IEVENT_CR0                      _IEVENT_CR0.Byte
#define IEVENT_CR0_Type0                _IEVENT_CR0.Bits.Type0
#define IEVENT_CR0_Type1                _IEVENT_CR0.Bits.Type1
#define IEVENT_CR0_OSE                  _IEVENT_CR0.Bits.OSE
#define IEVENT_CR0_DDB                  _IEVENT_CR0.Bits.DDB
#define IEVENT_CR0_RO                   _IEVENT_CR0.Bits.RO
/* IEVENT_CR_ARR: Access 4 IEVENT_CRx registers in an array */
#define IEVENT_CR_ARR                   ((volatile byte *) &IEVENT_CR0)
#define IEVENT_CR0_Type                 _IEVENT_CR0.MergedBits.grpType

#define IEVENT_CR0_Type0_MASK           1
#define IEVENT_CR0_Type1_MASK           2
#define IEVENT_CR0_OSE_MASK             4
#define IEVENT_CR0_DDB_MASK             8
#define IEVENT_CR0_RO_MASK              128
#define IEVENT_CR0_Type_MASK            3
#define IEVENT_CR0_Type_BITNUM          0


/*** IEVENT_CR1 - iEvent Control Register 1; 0xFFFF9A81 ***/
typedef union {
  byte Byte;
  struct {
    byte Type0       :1;                                       /* Output Channel Type, bit 0 */
    byte Type1       :1;                                       /* Output Channel Type, bit 1 */
    byte OSE         :1;                                       /* One-Shot Enable */
    byte DDB         :1;                                       /* Disable Done Broadcast */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RO          :1;                                       /* Read-Only. This bit determines if the configuration registers can be written or are read-only */
  } Bits;
  struct {
    byte grpType :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IEVENT_CR1STR;
extern volatile IEVENT_CR1STR _IEVENT_CR1 @0xFFFF9A81;
#define IEVENT_CR1                      _IEVENT_CR1.Byte
#define IEVENT_CR1_Type0                _IEVENT_CR1.Bits.Type0
#define IEVENT_CR1_Type1                _IEVENT_CR1.Bits.Type1
#define IEVENT_CR1_OSE                  _IEVENT_CR1.Bits.OSE
#define IEVENT_CR1_DDB                  _IEVENT_CR1.Bits.DDB
#define IEVENT_CR1_RO                   _IEVENT_CR1.Bits.RO
#define IEVENT_CR1_Type                 _IEVENT_CR1.MergedBits.grpType

#define IEVENT_CR1_Type0_MASK           1
#define IEVENT_CR1_Type1_MASK           2
#define IEVENT_CR1_OSE_MASK             4
#define IEVENT_CR1_DDB_MASK             8
#define IEVENT_CR1_RO_MASK              128
#define IEVENT_CR1_Type_MASK            3
#define IEVENT_CR1_Type_BITNUM          0


/*** IEVENT_CR2 - iEvent Control Register 2; 0xFFFF9A82 ***/
typedef union {
  byte Byte;
  struct {
    byte Type0       :1;                                       /* Output Channel Type, bit 0 */
    byte Type1       :1;                                       /* Output Channel Type, bit 1 */
    byte OSE         :1;                                       /* One-Shot Enable */
    byte DDB         :1;                                       /* Disable Done Broadcast */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RO          :1;                                       /* Read-Only. This bit determines if the configuration registers can be written or are read-only */
  } Bits;
  struct {
    byte grpType :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IEVENT_CR2STR;
extern volatile IEVENT_CR2STR _IEVENT_CR2 @0xFFFF9A82;
#define IEVENT_CR2                      _IEVENT_CR2.Byte
#define IEVENT_CR2_Type0                _IEVENT_CR2.Bits.Type0
#define IEVENT_CR2_Type1                _IEVENT_CR2.Bits.Type1
#define IEVENT_CR2_OSE                  _IEVENT_CR2.Bits.OSE
#define IEVENT_CR2_DDB                  _IEVENT_CR2.Bits.DDB
#define IEVENT_CR2_RO                   _IEVENT_CR2.Bits.RO
#define IEVENT_CR2_Type                 _IEVENT_CR2.MergedBits.grpType

#define IEVENT_CR2_Type0_MASK           1
#define IEVENT_CR2_Type1_MASK           2
#define IEVENT_CR2_OSE_MASK             4
#define IEVENT_CR2_DDB_MASK             8
#define IEVENT_CR2_RO_MASK              128
#define IEVENT_CR2_Type_MASK            3
#define IEVENT_CR2_Type_BITNUM          0


