AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** IEVENT_CR3 - iEvent Control Register 3; 0xFFFF9A83 ***/
typedef union {
  byte Byte;
  struct {
    byte Type0       :1;                                       /* Output Channel Type, bit 0 */
    byte Type1       :1;                                       /* Output Channel Type, bit 1 */
    byte OSE         :1;                                       /* One-Shot Enable */
    byte DDB         :1;                                       /* Disable Done Broadcast */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RO          :1;                                       /* Read-Only. This bit determines if the configuration registers can be written or are read-only */
  } Bits;
  struct {
    byte grpType :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IEVENT_CR3STR;
extern volatile IEVENT_CR3STR _IEVENT_CR3 @0xFFFF9A83;
#define IEVENT_CR3                      _IEVENT_CR3.Byte
#define IEVENT_CR3_Type0                _IEVENT_CR3.Bits.Type0
#define IEVENT_CR3_Type1                _IEVENT_CR3.Bits.Type1
#define IEVENT_CR3_OSE                  _IEVENT_CR3.Bits.OSE
#define IEVENT_CR3_DDB                  _IEVENT_CR3.Bits.DDB
#define IEVENT_CR3_RO                   _IEVENT_CR3.Bits.RO
#define IEVENT_CR3_Type                 _IEVENT_CR3.MergedBits.grpType

#define IEVENT_CR3_Type0_MASK           1
#define IEVENT_CR3_Type1_MASK           2
#define IEVENT_CR3_OSE_MASK             4
#define IEVENT_CR3_DDB_MASK             8
#define IEVENT_CR3_RO_MASK              128
#define IEVENT_CR3_Type_MASK            3
#define IEVENT_CR3_Type_BITNUM          0


/*** IEVENT_IMXCR0 - iEvent Input Mux Configuration Register 0; 0xFFFF9B00 ***/
typedef union {
  dword Dword;
  struct {
    dword D_Select0  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 0 */
    dword D_Select1  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 1 */
    dword D_Select2  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 2 */
    dword D_Select3  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword C_Select0  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 0 */
    dword C_Select1  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 1 */
    dword C_Select2  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 2 */
    dword C_Select3  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword B_Select0  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 0 */
    dword B_Select1  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 1 */
    dword B_Select2  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 2 */
    dword B_Select3  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword A_Select0  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 0 */
    dword A_Select1  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 1 */
    dword A_Select2  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 2 */
    dword A_Select3  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
  struct {
    dword grpD_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpC_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpB_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpA_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
  } MergedBits;
} IEVENT_IMXCR0STR;
extern volatile IEVENT_IMXCR0STR _IEVENT_IMXCR0 @0xFFFF9B00;
#define IEVENT_IMXCR0                   _IEVENT_IMXCR0.Dword
#define IEVENT_IMXCR0_D_Select0         _IEVENT_IMXCR0.Bits.D_Select0
#define IEVENT_IMXCR0_D_Select1         _IEVENT_IMXCR0.Bits.D_Select1
#define IEVENT_IMXCR0_D_Select2         _IEVENT_IMXCR0.Bits.D_Select2
#define IEVENT_IMXCR0_D_Select3         _IEVENT_IMXCR0.Bits.D_Select3
#define IEVENT_IMXCR0_C_Select0         _IEVENT_IMXCR0.Bits.C_Select0
#define IEVENT_IMXCR0_C_Select1         _IEVENT_IMXCR0.Bits.C_Select1
#define IEVENT_IMXCR0_C_Select2         _IEVENT_IMXCR0.Bits.C_Select2
#define IEVENT_IMXCR0_C_Select3         _IEVENT_IMXCR0.Bits.C_Select3
#define IEVENT_IMXCR0_B_Select0         _IEVENT_IMXCR0.Bits.B_Select0
#define IEVENT_IMXCR0_B_Select1         _IEVENT_IMXCR0.Bits.B_Select1
#define IEVENT_IMXCR0_B_Select2         _IEVENT_IMXCR0.Bits.B_Select2
#define IEVENT_IMXCR0_B_Select3         _IEVENT_IMXCR0.Bits.B_Select3
#define IEVENT_IMXCR0_A_Select0         _IEVENT_IMXCR0.Bits.A_Select0
#define IEVENT_IMXCR0_A_Select1         _IEVENT_IMXCR0.Bits.A_Select1
#define IEVENT_IMXCR0_A_Select2         _IEVENT_IMXCR0.Bits.A_Select2
#define IEVENT_IMXCR0_A_Select3         _IEVENT_IMXCR0.Bits.A_Select3
#define IEVENT_IMXCR0_D_Select          _IEVENT_IMXCR0.MergedBits.grpD_Select
#define IEVENT_IMXCR0_C_Select          _IEVENT_IMXCR0.MergedBits.grpC_Select
#define IEVENT_IMXCR0_B_Select          _IEVENT_IMXCR0.MergedBits.grpB_Select
#define IEVENT_IMXCR0_A_Select          _IEVENT_IMXCR0.MergedBits.grpA_Select

