AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** IEVENT_IMXCR1 - iEvent Input Mux Configuration Register 1; 0xFFFF9B08 ***/
typedef union {
  dword Dword;
  struct {
    dword D_Select0  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 0 */
    dword D_Select1  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 1 */
    dword D_Select2  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 2 */
    dword D_Select3  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword C_Select0  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 0 */
    dword C_Select1  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 1 */
    dword C_Select2  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 2 */
    dword C_Select3  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword B_Select0  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 0 */
    dword B_Select1  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 1 */
    dword B_Select2  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 2 */
    dword B_Select3  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword A_Select0  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 0 */
    dword A_Select1  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 1 */
    dword A_Select2  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 2 */
    dword A_Select3  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
  struct {
    dword grpD_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpC_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpB_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpA_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
  } MergedBits;
} IEVENT_IMXCR1STR;
extern volatile IEVENT_IMXCR1STR _IEVENT_IMXCR1 @0xFFFF9B08;
#define IEVENT_IMXCR1                   _IEVENT_IMXCR1.Dword
#define IEVENT_IMXCR1_D_Select0         _IEVENT_IMXCR1.Bits.D_Select0
#define IEVENT_IMXCR1_D_Select1         _IEVENT_IMXCR1.Bits.D_Select1
#define IEVENT_IMXCR1_D_Select2         _IEVENT_IMXCR1.Bits.D_Select2
#define IEVENT_IMXCR1_D_Select3         _IEVENT_IMXCR1.Bits.D_Select3
#define IEVENT_IMXCR1_C_Select0         _IEVENT_IMXCR1.Bits.C_Select0
#define IEVENT_IMXCR1_C_Select1         _IEVENT_IMXCR1.Bits.C_Select1
#define IEVENT_IMXCR1_C_Select2         _IEVENT_IMXCR1.Bits.C_Select2
#define IEVENT_IMXCR1_C_Select3         _IEVENT_IMXCR1.Bits.C_Select3
#define IEVENT_IMXCR1_B_Select0         _IEVENT_IMXCR1.Bits.B_Select0
#define IEVENT_IMXCR1_B_Select1         _IEVENT_IMXCR1.Bits.B_Select1
#define IEVENT_IMXCR1_B_Select2         _IEVENT_IMXCR1.Bits.B_Select2
#define IEVENT_IMXCR1_B_Select3         _IEVENT_IMXCR1.Bits.B_Select3
#define IEVENT_IMXCR1_A_Select0         _IEVENT_IMXCR1.Bits.A_Select0
#define IEVENT_IMXCR1_A_Select1         _IEVENT_IMXCR1.Bits.A_Select1
#define IEVENT_IMXCR1_A_Select2         _IEVENT_IMXCR1.Bits.A_Select2
#define IEVENT_IMXCR1_A_Select3         _IEVENT_IMXCR1.Bits.A_Select3
#define IEVENT_IMXCR1_D_Select          _IEVENT_IMXCR1.MergedBits.grpD_Select
#define IEVENT_IMXCR1_C_Select          _IEVENT_IMXCR1.MergedBits.grpC_Select
#define IEVENT_IMXCR1_B_Select          _IEVENT_IMXCR1.MergedBits.grpB_Select
#define IEVENT_IMXCR1_A_Select          _IEVENT_IMXCR1.MergedBits.grpA_Select

#define IEVENT_IMXCR1_D_Select0_MASK    1
#define IEVENT_IMXCR1_D_Select1_MASK    2
#define IEVENT_IMXCR1_D_Select2_MASK    4
#define IEVENT_IMXCR1_D_Select3_MASK    8
#define IEVENT_IMXCR1_C_Select0_MASK    256
#define IEVENT_IMXCR1_C_Select1_MASK    512
#define IEVENT_IMXCR1_C_Select2_MASK    1024
#define IEVENT_IMXCR1_C_Select3_MASK    2048
#define IEVENT_IMXCR1_B_Select0_MASK    65536
#define IEVENT_IMXCR1_B_Select1_MASK    131072
#define IEVENT_IMXCR1_B_Select2_MASK    262144
#define IEVENT_IMXCR1_B_Select3_MASK    524288
#define IEVENT_IMXCR1_A_Select0_MASK    16777216
#define IEVENT_IMXCR1_A_Select1_MASK    33554432
#define IEVENT_IMXCR1_A_Select2_MASK    67108864
#define IEVENT_IMXCR1_A_Select3_MASK    134217728
#define IEVENT_IMXCR1_D_Select_MASK     15
#define IEVENT_IMXCR1_D_Select_BITNUM   0
#define IEVENT_IMXCR1_C_Select_MASK     3840
#define IEVENT_IMXCR1_C_Select_BITNUM   8
#define IEVENT_IMXCR1_B_Select_MASK     983040
#define IEVENT_IMXCR1_B_Select_BITNUM   16
#define IEVENT_IMXCR1_A_Select_MASK     251658240
#define IEVENT_IMXCR1_A_Select_BITNUM   24


/*** IEVENT_BFECR1 - iEvent Boolean Function Evaluation Configuration Register 1; 0xFFFF9B0C ***/
typedef union {
  dword Dword;
  struct {
    dword PT3_DC0    :1;                                       /* Product Term 3, D input Configuration, bit 0 */
    dword PT3_DC1    :1;                                       /* Product Term 3, D input Configuration, bit 1 */
    dword PT3_CC0    :1;                                       /* Product Term 3, C input Configuration, bit 0 */
    dword PT3_CC1    :1;                                       /* Product Term 3, C input Configuration, bit 1 */
    dword PT3_BC0    :1;                                       /* Product Term 3, B input Configuration, bit 0 */
    dword PT3_BC1    :1;                                       /* Product Term 3, B input Configuration, bit 1 */
    dword PT3_AC0    :1;                                       /* Product Term 3, A input Configuration, bit 0 */
    dword PT3_AC1    :1;                                       /* Product Term 3, A input Configuration, bit 1 */
    dword PT2_DC0    :1;                                       /* Product Term 2, D input Configuration, bit 0 */
    dword PT2_DC1    :1;                                       /* Product Term 2, D input Configuration, bit 1 */
    dword PT2_CC0    :1;                                       /* Product Term 2, C input Configuration, bit 0 */
    dword PT2_CC1    :1;                                       /* Product Term 2, C input Configuration, bit 1 */
    dword PT2_BC0    :1;                                       /* Product Term 2, B input Configuration, bit 0 */
    dword PT2_BC1    :1;                                       /* Product Term 2, B input Configuration, bit 1 */
    dword PT2_AC0    :1;                                       /* Product Term 2, A input Configuration, bit 0 */
    dword PT2_AC1    :1;                                       /* Product Term 2, A input Configuration, bit 1 */
    dword PT1_DC0    :1;                                       /* Product Term 1, D input Configuration, bit 0 */
    dword PT1_DC1    :1;                                       /* Product Term 1, D input Configuration, bit 1 */
    dword PT1_CC0    :1;                                       /* Product Term 1, C input Configuration, bit 0 */
    dword PT1_CC1    :1;                                       /* Product Term 1, C input Configuration, bit 1 */
    dword PT1_BC0    :1;                                       /* Product Term 1, B input Configuration, bit 0 */
    dword PT1_BC1    :1;                                       /* Product Term 1, B input Configuration, bit 1 */
    dword PT1_AC0    :1;                                       /* Product Term 1, A input Configuration, bit 0 */
    dword PT1_AC1    :1;                                       /* Product Term 1, A input Configuration, bit 1 */
    dword PT0_DC0    :1;                                       /* Product Term 0, D input Configuration, bit 0 */
    dword PT0_DC1    :1;                                       /* Product Term 0, D input Configuration, bit 1 */
    dword PT0_CC0    :1;                                       /* Product Term 0, C input Configuration, bit 0 */
    dword PT0_CC1    :1;                                       /* Product Term 0, C input Configuration, bit 1 */
    dword PT0_BC0    :1;                                       /* Product Term 0, B input Configuration, bit 0 */
    dword PT0_BC1    :1;                                       /* Product Term 0, B input Configuration, bit 1 */
    dword PT0_AC0    :1;                                       /* Product Term 0, A input Configuration, bit 0 */
    dword PT0_AC1    :1;                                       /* Product Term 0, A input Configuration, bit 1 */
  } Bits;
  struct {
    dword grpPT3_DC :2;
    dword grpPT3_CC :2;
    dword grpPT3_BC :2;
    dword grpPT3_AC :2;
    dword grpPT2_DC :2;
    dword grpPT2_CC :2;
    dword grpPT2_BC :2;
    dword grpPT2_AC :2;
    dword grpPT1_DC :2;
    dword grpPT1_CC :2;
    dword grpPT1_BC :2;
    dword grpPT1_AC :2;
    dword grpPT0_DC :2;
    dword grpPT0_CC :2;
    dword grpPT0_BC :2;
    dword grpPT0_AC :2;
  } MergedBits;
} IEVENT_BFECR1STR;
extern volatile IEVENT_BFECR1STR _IEVENT_BFECR1 @0xFFFF9B0C;
#define IEVENT_BFECR1                   _IEVENT_BFECR1.Dword
#define IEVENT_BFECR1_PT3_DC0           _IEVENT_BFECR1.Bits.PT3_DC0
#define IEVENT_BFECR1_PT3_DC1           _IEVENT_BFECR1.Bits.PT3_DC1
#define IEVENT_BFECR1_PT3_CC0           _IEVENT_BFECR1.Bits.PT3_CC0
#define IEVENT_BFECR1_PT3_CC1           _IEVENT_BFECR1.Bits.PT3_CC1
#define IEVENT_BFECR1_PT3_BC0           _IEVENT_BFECR1.Bits.PT3_BC0
#define IEVENT_BFECR1_PT3_BC1           _IEVENT_BFECR1.Bits.PT3_BC1
#define IEVENT_BFECR1_PT3_AC0           _IEVENT_BFECR1.Bits.PT3_AC0
#define IEVENT_BFECR1_PT3_AC1           _IEVENT_BFECR1.Bits.PT3_AC1
#define IEVENT_BFECR1_PT2_DC0           _IEVENT_BFECR1.Bits.PT2_DC0
#define IEVENT_BFECR1_PT2_DC1           _IEVENT_BFECR1.Bits.PT2_DC1
#define IEVENT_BFECR1_PT2_CC0           _IEVENT_BFECR1.Bits.PT2_CC0
#define IEVENT_BFECR1_PT2_CC1           _IEVENT_BFECR1.Bits.PT2_CC1
#define IEVENT_BFECR1_PT2_BC0           _IEVENT_BFECR1.Bits.PT2_BC0
#define IEVENT_BFECR1_PT2_BC1           _IEVENT_BFECR1.Bits.PT2_BC1
#define IEVENT_BFECR1_PT2_AC0           _IEVENT_BFECR1.Bits.PT2_AC0
#define IEVENT_BFECR1_PT2_AC1           _IEVENT_BFECR1.Bits.PT2_AC1
#define IEVENT_BFECR1_PT1_DC0           _IEVENT_BFECR1.Bits.PT1_DC0
#define IEVENT_BFECR1_PT1_DC1           _IEVENT_BFECR1.Bits.PT1_DC1
#define IEVENT_BFECR1_PT1_CC0           _IEVENT_BFECR1.Bits.PT1_CC0
#define IEVENT_BFECR1_PT1_CC1           _IEVENT_BFECR1.Bits.PT1_CC1
#define IEVENT_BFECR1_PT1_BC0           _IEVENT_BFECR1.Bits.PT1_BC0
#define IEVENT_BFECR1_PT1_BC1           _IEVENT_BFECR1.Bits.PT1_BC1
#define IEVENT_BFECR1_PT1_AC0           _IEVENT_BFECR1.Bits.PT1_AC0
#define IEVENT_BFECR1_PT1_AC1           _IEVENT_BFECR1.Bits.PT1_AC1
#define IEVENT_BFECR1_PT0_DC0           _IEVENT_BFECR1.Bits.PT0_DC0
#define IEVENT_BFECR1_PT0_DC1           _IEVENT_BFECR1.Bits.PT0_DC1
#define IEVENT_BFECR1_PT0_CC0           _IEVENT_BFECR1.Bits.PT0_CC0
#define IEVENT_BFECR1_PT0_CC1           _IEVENT_BFECR1.Bits.PT0_CC1
#define IEVENT_BFECR1_PT0_BC0           _IEVENT_BFECR1.Bits.PT0_BC0
#define IEVENT_BFECR1_PT0_BC1           _IEVENT_BFECR1.Bits.PT0_BC1
#define IEVENT_BFECR1_PT0_AC0           _IEVENT_BFECR1.Bits.PT0_AC0
#define IEVENT_BFECR1_PT0_AC1           _IEVENT_BFECR1.Bits.PT0_AC1
#define IEVENT_BFECR1_PT3_DC            _IEVENT_BFECR1.MergedBits.grpPT3_DC
#define IEVENT_BFECR1_PT3_CC            _IEVENT_BFECR1.MergedBits.grpPT3_CC
#define IEVENT_BFECR1_PT3_BC            _IEVENT_BFECR1.MergedBits.grpPT3_BC
#define IEVENT_BFECR1_PT3_AC            _IEVENT_BFECR1.MergedBits.grpPT3_AC
#define IEVENT_BFECR1_PT2_DC            _IEVENT_BFECR1.MergedBits.grpPT2_DC
#define IEVENT_BFECR1_PT2_CC            _IEVENT_BFECR1.MergedBits.grpPT2_CC
#define IEVENT_BFECR1_PT2_BC            _IEVENT_BFECR1.MergedBits.grpPT2_BC
#define IEVENT_BFECR1_PT2_AC            _IEVENT_BFECR1.MergedBits.grpPT2_AC
#define IEVENT_BFECR1_PT1_DC            _IEVENT_BFECR1.MergedBits.grpPT1_DC
#define IEVENT_BFECR1_PT1_CC            _IEVENT_BFECR1.MergedBits.grpPT1_CC
#define IEVENT_BFECR1_PT1_BC            _IEVENT_BFECR1.MergedBits.grpPT1_BC
#define IEVENT_BFECR1_PT1_AC            _IEVENT_BFECR1.MergedBits.grpPT1_AC
#define IEVENT_BFECR1_PT0_DC            _IEVENT_BFECR1.MergedBits.grpPT0_DC
#define IEVENT_BFECR1_PT0_CC            _IEVENT_BFECR1.MergedBits.grpPT0_CC
#define IEVENT_BFECR1_PT0_BC            _IEVENT_BFECR1.MergedBits.grpPT0_BC
#define IEVENT_BFECR1_PT0_AC            _IEVENT_BFECR1.MergedBits.grpPT0_AC

#define IEVENT_BFECR1_PT3_DC0_MASK      1
#define IEVENT_BFECR1_PT3_DC1_MASK      2
#define IEVENT_BFECR1_PT3_CC0_MASK      4
#define IEVENT_BFECR1_PT3_CC1_MASK      8
#define IEVENT_BFECR1_PT3_BC0_MASK      16
#define IEVENT_BFECR1_PT3_BC1_MASK      32
#define IEVENT_BFECR1_PT3_AC0_MASK      64
#define IEVENT_BFECR1_PT3_AC1_MASK      128
#define IEVENT_BFECR1_PT2_DC0_MASK      256
#define IEVENT_BFECR1_PT2_DC1_MASK      512
#define IEVENT_BFECR1_PT2_CC0_MASK      1024
#define IEVENT_BFECR1_PT2_CC1_MASK      2048
#define IEVENT_BFECR1_PT2_BC0_MASK      4096
#define IEVENT_BFECR1_PT2_BC1_MASK      8192
#define IEVENT_BFECR1_PT2_AC0_MASK      16384
#define IEVENT_BFECR1_PT2_AC1_MASK      32768
#define IEVENT_BFECR1_PT1_DC0_MASK      65536
#define IEVENT_BFECR1_PT1_DC1_MASK      131072
#define IEVENT_BFECR1_PT1_CC0_MASK      262144
#define IEVENT_BFECR1_PT1_CC1_MASK      524288
#define IEVENT_BFECR1_PT1_BC0_MASK      1048576
#define IEVENT_BFECR1_PT1_BC1_MASK      2097152
#define IEVENT_BFECR1_PT1_AC0_MASK      4194304
#define IEVENT_BFECR1_PT1_AC1_MASK      8388608
#define IEVENT_BFECR1_PT0_DC0_MASK      16777216
#define IEVENT_BFECR1_PT0_DC1_MASK      33554432
#define IEVENT_BFECR1_PT0_CC0_MASK      67108864
#define IEVENT_BFECR1_PT0_CC1_MASK      134217728
#define IEVENT_BFECR1_PT0_BC0_MASK      268435456
#define IEVENT_BFECR1_PT0_BC1_MASK      536870912
#define IEVENT_BFECR1_PT0_AC0_MASK      1073741824
#define IEVENT_BFECR1_PT0_AC1_MASK      2147483648
#define IEVENT_BFECR1_PT3_DC_MASK       3
#define IEVENT_BFECR1_PT3_DC_BITNUM     0
#define IEVENT_BFECR1_PT3_CC_MASK       12
#define IEVENT_BFECR1_PT3_CC_BITNUM     2
#define IEVENT_BFECR1_PT3_BC_MASK       48
#define IEVENT_BFECR1_PT3_BC_BITNUM     4
#define IEVENT_BFECR1_PT3_AC_MASK       192
#define IEVENT_BFECR1_PT3_AC_BITNUM     6
#define IEVENT_BFECR1_PT2_DC_MASK       768
#define IEVENT_BFECR1_PT2_DC_BITNUM     8
#define IEVENT_BFECR1_PT2_CC_MASK       3072
#define IEVENT_BFECR1_PT2_CC_BITNUM     10
#define IEVENT_BFECR1_PT2_BC_MASK       12288
#define IEVENT_BFECR1_PT2_BC_BITNUM     12
#define IEVENT_BFECR1_PT2_AC_MASK       49152
#define IEVENT_BFECR1_PT2_AC_BITNUM     14
#define IEVENT_BFECR1_PT1_DC_MASK       196608
#define IEVENT_BFECR1_PT1_DC_BITNUM     16
#define IEVENT_BFECR1_PT1_CC_MASK       786432
#define IEVENT_BFECR1_PT1_CC_BITNUM     18
#define IEVENT_BFECR1_PT1_BC_MASK       3145728
#define IEVENT_BFECR1_PT1_BC_BITNUM     20
#define IEVENT_BFECR1_PT1_AC_MASK       12582912
#define IEVENT_BFECR1_PT1_AC_BITNUM     22
#define IEVENT_BFECR1_PT0_DC_MASK       50331648
#define IEVENT_BFECR1_PT0_DC_BITNUM     24
#define IEVENT_BFECR1_PT0_CC_MASK       201326592
#define IEVENT_BFECR1_PT0_CC_BITNUM     26
#define IEVENT_BFECR1_PT0_BC_MASK       805306368
#define IEVENT_BFECR1_PT0_BC_BITNUM     28
#define IEVENT_BFECR1_PT0_AC_MASK       3221225472
#define IEVENT_BFECR1_PT0_AC_BITNUM     30


/*** IEVENT_IMXCR2 - iEvent Input Mux Configuration Register 2; 0xFFFF9B10 ***/
typedef union {
  dword Dword;
  struct {
    dword D_Select0  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 0 */
    dword D_Select1  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 1 */
    dword D_Select2  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 2 */
    dword D_Select3  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword C_Select0  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 0 */
    dword C_Select1  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 1 */
    dword C_Select2  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 2 */
    dword C_Select3  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword B_Select0  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 0 */
    dword B_Select1  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 1 */
    dword B_Select2  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 2 */
    dword B_Select3  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword A_Select0  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 0 */
    dword A_Select1  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 1 */
    dword A_Select2  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 2 */
    dword A_Select3  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
  struct {
    dword grpD_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpC_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpB_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpA_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
  } MergedBits;
} IEVENT_IMXCR2STR;
extern volatile IEVENT_IMXCR2STR _IEVENT_IMXCR2 @0xFFFF9B10;
#define IEVENT_IMXCR2                   _IEVENT_IMXCR2.Dword
#define IEVENT_IMXCR2_D_Select0         _IEVENT_IMXCR2.Bits.D_Select0
#define IEVENT_IMXCR2_D_Select1         _IEVENT_IMXCR2.Bits.D_Select1
#define IEVENT_IMXCR2_D_Select2         _IEVENT_IMXCR2.Bits.D_Select2
#define IEVENT_IMXCR2_D_Select3         _IEVENT_IMXCR2.Bits.D_Select3
#define IEVENT_IMXCR2_C_Select0         _IEVENT_IMXCR2.Bits.C_Select0
#define IEVENT_IMXCR2_C_Select1         _IEVENT_IMXCR2.Bits.C_Select1
#define IEVENT_IMXCR2_C_Select2         _IEVENT_IMXCR2.Bits.C_Select2
#define IEVENT_IMXCR2_C_Select3         _IEVENT_IMXCR2.Bits.C_Select3
#define IEVENT_IMXCR2_B_Select0         _IEVENT_IMXCR2.Bits.B_Select0
#define IEVENT_IMXCR2_B_Select1         _IEVENT_IMXCR2.Bits.B_Select1
#define IEVENT_IMXCR2_B_Select2         _IEVENT_IMXCR2.Bits.B_Select2
#define IEVENT_IMXCR2_B_Select3         _IEVENT_IMXCR2.Bits.B_Select3
#define IEVENT_IMXCR2_A_Select0         _IEVENT_IMXCR2.Bits.A_Select0
#define IEVENT_IMXCR2_A_Select1         _IEVENT_IMXCR2.Bits.A_Select1
#define IEVENT_IMXCR2_A_Select2         _IEVENT_IMXCR2.Bits.A_Select2
#define IEVENT_IMXCR2_A_Select3         _IEVENT_IMXCR2.Bits.A_Select3
#define IEVENT_IMXCR2_D_Select          _IEVENT_IMXCR2.MergedBits.grpD_Select
#define IEVENT_IMXCR2_C_Select          _IEVENT_IMXCR2.MergedBits.grpC_Select
#define IEVENT_IMXCR2_B_Select          _IEVENT_IMXCR2.MergedBits.grpB_Select
#define IEVENT_IMXCR2_A_Select          _IEVENT_IMXCR2.MergedBits.grpA_Select

#define IEVENT_IMXCR2_D_Select0_MASK    1
#define IEVENT_IMXCR2_D_Select1_MASK    2
#define IEVENT_IMXCR2_D_Select2_MASK    4
#define IEVENT_IMXCR2_D_Select3_MASK    8
#define IEVENT_IMXCR2_C_Select0_MASK    256
#define IEVENT_IMXCR2_C_Select1_MASK    512
#define IEVENT_IMXCR2_C_Select2_MASK    1024
#define IEVENT_IMXCR2_C_Select3_MASK    2048
#define IEVENT_IMXCR2_B_Select0_MASK    65536
#define IEVENT_IMXCR2_B_Select1_MASK    131072
#define IEVENT_IMXCR2_B_Select2_MASK    262144
#define IEVENT_IMXCR2_B_Select3_MASK    524288
#define IEVENT_IMXCR2_A_Select0_MASK    16777216
#define IEVENT_IMXCR2_A_Select1_MASK    33554432
#define IEVENT_IMXCR2_A_Select2_MASK    67108864
#define IEVENT_IMXCR2_A_Select3_MASK    134217728
#define IEVENT_IMXCR2_D_Select_MASK     15
#define IEVENT_IMXCR2_D_Select_BITNUM   0
#define IEVENT_IMXCR2_C_Select_MASK     3840
#define IEVENT_IMXCR2_C_Select_BITNUM   8
#define IEVENT_IMXCR2_B_Select_MASK     983040
#define IEVENT_IMXCR2_B_Select_BITNUM   16
#define IEVENT_IMXCR2_A_Select_MASK     251658240
#define IEVENT_IMXCR2_A_Select_BITNUM   24


