AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** IEVENT_BFECR2 - iEvent Boolean Function Evaluation Configuration Register 2; 0xFFFF9B14 ***/
typedef union {
  dword Dword;
  struct {
    dword PT3_DC0    :1;                                       /* Product Term 3, D input Configuration, bit 0 */
    dword PT3_DC1    :1;                                       /* Product Term 3, D input Configuration, bit 1 */
    dword PT3_CC0    :1;                                       /* Product Term 3, C input Configuration, bit 0 */
    dword PT3_CC1    :1;                                       /* Product Term 3, C input Configuration, bit 1 */
    dword PT3_BC0    :1;                                       /* Product Term 3, B input Configuration, bit 0 */
    dword PT3_BC1    :1;                                       /* Product Term 3, B input Configuration, bit 1 */
    dword PT3_AC0    :1;                                       /* Product Term 3, A input Configuration, bit 0 */
    dword PT3_AC1    :1;                                       /* Product Term 3, A input Configuration, bit 1 */
    dword PT2_DC0    :1;                                       /* Product Term 2, D input Configuration, bit 0 */
    dword PT2_DC1    :1;                                       /* Product Term 2, D input Configuration, bit 1 */
    dword PT2_CC0    :1;                                       /* Product Term 2, C input Configuration, bit 0 */
    dword PT2_CC1    :1;                                       /* Product Term 2, C input Configuration, bit 1 */
    dword PT2_BC0    :1;                                       /* Product Term 2, B input Configuration, bit 0 */
    dword PT2_BC1    :1;                                       /* Product Term 2, B input Configuration, bit 1 */
    dword PT2_AC0    :1;                                       /* Product Term 2, A input Configuration, bit 0 */
    dword PT2_AC1    :1;                                       /* Product Term 2, A input Configuration, bit 1 */
    dword PT1_DC0    :1;                                       /* Product Term 1, D input Configuration, bit 0 */
    dword PT1_DC1    :1;                                       /* Product Term 1, D input Configuration, bit 1 */
    dword PT1_CC0    :1;                                       /* Product Term 1, C input Configuration, bit 0 */
    dword PT1_CC1    :1;                                       /* Product Term 1, C input Configuration, bit 1 */
    dword PT1_BC0    :1;                                       /* Product Term 1, B input Configuration, bit 0 */
    dword PT1_BC1    :1;                                       /* Product Term 1, B input Configuration, bit 1 */
    dword PT1_AC0    :1;                                       /* Product Term 1, A input Configuration, bit 0 */
    dword PT1_AC1    :1;                                       /* Product Term 1, A input Configuration, bit 1 */
    dword PT0_DC0    :1;                                       /* Product Term 0, D input Configuration, bit 0 */
    dword PT0_DC1    :1;                                       /* Product Term 0, D input Configuration, bit 1 */
    dword PT0_CC0    :1;                                       /* Product Term 0, C input Configuration, bit 0 */
    dword PT0_CC1    :1;                                       /* Product Term 0, C input Configuration, bit 1 */
    dword PT0_BC0    :1;                                       /* Product Term 0, B input Configuration, bit 0 */
    dword PT0_BC1    :1;                                       /* Product Term 0, B input Configuration, bit 1 */
    dword PT0_AC0    :1;                                       /* Product Term 0, A input Configuration, bit 0 */
    dword PT0_AC1    :1;                                       /* Product Term 0, A input Configuration, bit 1 */
  } Bits;
  struct {
    dword grpPT3_DC :2;
    dword grpPT3_CC :2;
    dword grpPT3_BC :2;
    dword grpPT3_AC :2;
    dword grpPT2_DC :2;
    dword grpPT2_CC :2;
    dword grpPT2_BC :2;
    dword grpPT2_AC :2;
    dword grpPT1_DC :2;
    dword grpPT1_CC :2;
    dword grpPT1_BC :2;
    dword grpPT1_AC :2;
    dword grpPT0_DC :2;
    dword grpPT0_CC :2;
    dword grpPT0_BC :2;
    dword grpPT0_AC :2;
  } MergedBits;
} IEVENT_BFECR2STR;
extern volatile IEVENT_BFECR2STR _IEVENT_BFECR2 @0xFFFF9B14;
#define IEVENT_BFECR2                   _IEVENT_BFECR2.Dword
#define IEVENT_BFECR2_PT3_DC0           _IEVENT_BFECR2.Bits.PT3_DC0
#define IEVENT_BFECR2_PT3_DC1           _IEVENT_BFECR2.Bits.PT3_DC1
#define IEVENT_BFECR2_PT3_CC0           _IEVENT_BFECR2.Bits.PT3_CC0
#define IEVENT_BFECR2_PT3_CC1           _IEVENT_BFECR2.Bits.PT3_CC1
#define IEVENT_BFECR2_PT3_BC0           _IEVENT_BFECR2.Bits.PT3_BC0
#define IEVENT_BFECR2_PT3_BC1           _IEVENT_BFECR2.Bits.PT3_BC1
#define IEVENT_BFECR2_PT3_AC0           _IEVENT_BFECR2.Bits.PT3_AC0
#define IEVENT_BFECR2_PT3_AC1           _IEVENT_BFECR2.Bits.PT3_AC1
#define IEVENT_BFECR2_PT2_DC0           _IEVENT_BFECR2.Bits.PT2_DC0
#define IEVENT_BFECR2_PT2_DC1           _IEVENT_BFECR2.Bits.PT2_DC1
#define IEVENT_BFECR2_PT2_CC0           _IEVENT_BFECR2.Bits.PT2_CC0
#define IEVENT_BFECR2_PT2_CC1           _IEVENT_BFECR2.Bits.PT2_CC1
#define IEVENT_BFECR2_PT2_BC0           _IEVENT_BFECR2.Bits.PT2_BC0
#define IEVENT_BFECR2_PT2_BC1           _IEVENT_BFECR2.Bits.PT2_BC1
#define IEVENT_BFECR2_PT2_AC0           _IEVENT_BFECR2.Bits.PT2_AC0
#define IEVENT_BFECR2_PT2_AC1           _IEVENT_BFECR2.Bits.PT2_AC1
#define IEVENT_BFECR2_PT1_DC0           _IEVENT_BFECR2.Bits.PT1_DC0
#define IEVENT_BFECR2_PT1_DC1           _IEVENT_BFECR2.Bits.PT1_DC1
#define IEVENT_BFECR2_PT1_CC0           _IEVENT_BFECR2.Bits.PT1_CC0
#define IEVENT_BFECR2_PT1_CC1           _IEVENT_BFECR2.Bits.PT1_CC1
#define IEVENT_BFECR2_PT1_BC0           _IEVENT_BFECR2.Bits.PT1_BC0
#define IEVENT_BFECR2_PT1_BC1           _IEVENT_BFECR2.Bits.PT1_BC1
#define IEVENT_BFECR2_PT1_AC0           _IEVENT_BFECR2.Bits.PT1_AC0
#define IEVENT_BFECR2_PT1_AC1           _IEVENT_BFECR2.Bits.PT1_AC1
#define IEVENT_BFECR2_PT0_DC0           _IEVENT_BFECR2.Bits.PT0_DC0
#define IEVENT_BFECR2_PT0_DC1           _IEVENT_BFECR2.Bits.PT0_DC1
#define IEVENT_BFECR2_PT0_CC0           _IEVENT_BFECR2.Bits.PT0_CC0
#define IEVENT_BFECR2_PT0_CC1           _IEVENT_BFECR2.Bits.PT0_CC1
#define IEVENT_BFECR2_PT0_BC0           _IEVENT_BFECR2.Bits.PT0_BC0
#define IEVENT_BFECR2_PT0_BC1           _IEVENT_BFECR2.Bits.PT0_BC1
#define IEVENT_BFECR2_PT0_AC0           _IEVENT_BFECR2.Bits.PT0_AC0
#define IEVENT_BFECR2_PT0_AC1           _IEVENT_BFECR2.Bits.PT0_AC1
#define IEVENT_BFECR2_PT3_DC            _IEVENT_BFECR2.MergedBits.grpPT3_DC
#define IEVENT_BFECR2_PT3_CC            _IEVENT_BFECR2.MergedBits.grpPT3_CC
#define IEVENT_BFECR2_PT3_BC            _IEVENT_BFECR2.MergedBits.grpPT3_BC
#define IEVENT_BFECR2_PT3_AC            _IEVENT_BFECR2.MergedBits.grpPT3_AC
#define IEVENT_BFECR2_PT2_DC            _IEVENT_BFECR2.MergedBits.grpPT2_DC
#define IEVENT_BFECR2_PT2_CC            _IEVENT_BFECR2.MergedBits.grpPT2_CC
#define IEVENT_BFECR2_PT2_BC            _IEVENT_BFECR2.MergedBits.grpPT2_BC
#define IEVENT_BFECR2_PT2_AC            _IEVENT_BFECR2.MergedBits.grpPT2_AC
#define IEVENT_BFECR2_PT1_DC            _IEVENT_BFECR2.MergedBits.grpPT1_DC
#define IEVENT_BFECR2_PT1_CC            _IEVENT_BFECR2.MergedBits.grpPT1_CC
#define IEVENT_BFECR2_PT1_BC            _IEVENT_BFECR2.MergedBits.grpPT1_BC
#define IEVENT_BFECR2_PT1_AC            _IEVENT_BFECR2.MergedBits.grpPT1_AC
#define IEVENT_BFECR2_PT0_DC            _IEVENT_BFECR2.MergedBits.grpPT0_DC
#define IEVENT_BFECR2_PT0_CC            _IEVENT_BFECR2.MergedBits.grpPT0_CC
#define IEVENT_BFECR2_PT0_BC            _IEVENT_BFECR2.MergedBits.grpPT0_BC
#define IEVENT_BFECR2_PT0_AC            _IEVENT_BFECR2.MergedBits.grpPT0_AC

