AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
#define IEVENT_BFECR2_PT3_DC0_MASK      1
#define IEVENT_BFECR2_PT3_DC1_MASK      2
#define IEVENT_BFECR2_PT3_CC0_MASK      4
#define IEVENT_BFECR2_PT3_CC1_MASK      8
#define IEVENT_BFECR2_PT3_BC0_MASK      16
#define IEVENT_BFECR2_PT3_BC1_MASK      32
#define IEVENT_BFECR2_PT3_AC0_MASK      64
#define IEVENT_BFECR2_PT3_AC1_MASK      128
#define IEVENT_BFECR2_PT2_DC0_MASK      256
#define IEVENT_BFECR2_PT2_DC1_MASK      512
#define IEVENT_BFECR2_PT2_CC0_MASK      1024
#define IEVENT_BFECR2_PT2_CC1_MASK      2048
#define IEVENT_BFECR2_PT2_BC0_MASK      4096
#define IEVENT_BFECR2_PT2_BC1_MASK      8192
#define IEVENT_BFECR2_PT2_AC0_MASK      16384
#define IEVENT_BFECR2_PT2_AC1_MASK      32768
#define IEVENT_BFECR2_PT1_DC0_MASK      65536
#define IEVENT_BFECR2_PT1_DC1_MASK      131072
#define IEVENT_BFECR2_PT1_CC0_MASK      262144
#define IEVENT_BFECR2_PT1_CC1_MASK      524288
#define IEVENT_BFECR2_PT1_BC0_MASK      1048576
#define IEVENT_BFECR2_PT1_BC1_MASK      2097152
#define IEVENT_BFECR2_PT1_AC0_MASK      4194304
#define IEVENT_BFECR2_PT1_AC1_MASK      8388608
#define IEVENT_BFECR2_PT0_DC0_MASK      16777216
#define IEVENT_BFECR2_PT0_DC1_MASK      33554432
#define IEVENT_BFECR2_PT0_CC0_MASK      67108864
#define IEVENT_BFECR2_PT0_CC1_MASK      134217728
#define IEVENT_BFECR2_PT0_BC0_MASK      268435456
#define IEVENT_BFECR2_PT0_BC1_MASK      536870912
#define IEVENT_BFECR2_PT0_AC0_MASK      1073741824
#define IEVENT_BFECR2_PT0_AC1_MASK      2147483648
#define IEVENT_BFECR2_PT3_DC_MASK       3
#define IEVENT_BFECR2_PT3_DC_BITNUM     0
#define IEVENT_BFECR2_PT3_CC_MASK       12
#define IEVENT_BFECR2_PT3_CC_BITNUM     2
#define IEVENT_BFECR2_PT3_BC_MASK       48
#define IEVENT_BFECR2_PT3_BC_BITNUM     4
#define IEVENT_BFECR2_PT3_AC_MASK       192
#define IEVENT_BFECR2_PT3_AC_BITNUM     6
#define IEVENT_BFECR2_PT2_DC_MASK       768
#define IEVENT_BFECR2_PT2_DC_BITNUM     8
#define IEVENT_BFECR2_PT2_CC_MASK       3072
#define IEVENT_BFECR2_PT2_CC_BITNUM     10
#define IEVENT_BFECR2_PT2_BC_MASK       12288
#define IEVENT_BFECR2_PT2_BC_BITNUM     12
#define IEVENT_BFECR2_PT2_AC_MASK       49152
#define IEVENT_BFECR2_PT2_AC_BITNUM     14
#define IEVENT_BFECR2_PT1_DC_MASK       196608
#define IEVENT_BFECR2_PT1_DC_BITNUM     16
#define IEVENT_BFECR2_PT1_CC_MASK       786432
#define IEVENT_BFECR2_PT1_CC_BITNUM     18
#define IEVENT_BFECR2_PT1_BC_MASK       3145728
#define IEVENT_BFECR2_PT1_BC_BITNUM     20
#define IEVENT_BFECR2_PT1_AC_MASK       12582912
#define IEVENT_BFECR2_PT1_AC_BITNUM     22
#define IEVENT_BFECR2_PT0_DC_MASK       50331648
#define IEVENT_BFECR2_PT0_DC_BITNUM     24
#define IEVENT_BFECR2_PT0_CC_MASK       201326592
#define IEVENT_BFECR2_PT0_CC_BITNUM     26
#define IEVENT_BFECR2_PT0_BC_MASK       805306368
#define IEVENT_BFECR2_PT0_BC_BITNUM     28
#define IEVENT_BFECR2_PT0_AC_MASK       3221225472
#define IEVENT_BFECR2_PT0_AC_BITNUM     30


/*** IEVENT_IMXCR3 - iEvent Input Mux Configuration Register 3; 0xFFFF9B18 ***/
typedef union {
  dword Dword;
  struct {
    dword D_Select0  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 0 */
    dword D_Select1  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 1 */
    dword D_Select2  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 2 */
    dword D_Select3  :1;                                       /* D_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input D, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword C_Select0  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 0 */
    dword C_Select1  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 1 */
    dword C_Select2  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 2 */
    dword C_Select3  :1;                                       /* C_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input C, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword B_Select0  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 0 */
    dword B_Select1  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 1 */
    dword B_Select2  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 2 */
    dword B_Select3  :1;                                       /* B_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input B, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword A_Select0  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 0 */
    dword A_Select1  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 1 */
    dword A_Select2  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 2 */
    dword A_Select3  :1;                                       /* A_Select. This 4-bit field defines the bit number of the 16-bit event input vector to be selected as input A, bit 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
  struct {
    dword grpD_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpC_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpB_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword grpA_Select :4;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
  } MergedBits;
} IEVENT_IMXCR3STR;
extern volatile IEVENT_IMXCR3STR _IEVENT_IMXCR3 @0xFFFF9B18;
#define IEVENT_IMXCR3                   _IEVENT_IMXCR3.Dword
#define IEVENT_IMXCR3_D_Select0         _IEVENT_IMXCR3.Bits.D_Select0
#define IEVENT_IMXCR3_D_Select1         _IEVENT_IMXCR3.Bits.D_Select1
#define IEVENT_IMXCR3_D_Select2         _IEVENT_IMXCR3.Bits.D_Select2
#define IEVENT_IMXCR3_D_Select3         _IEVENT_IMXCR3.Bits.D_Select3
#define IEVENT_IMXCR3_C_Select0         _IEVENT_IMXCR3.Bits.C_Select0
#define IEVENT_IMXCR3_C_Select1         _IEVENT_IMXCR3.Bits.C_Select1
#define IEVENT_IMXCR3_C_Select2         _IEVENT_IMXCR3.Bits.C_Select2
#define IEVENT_IMXCR3_C_Select3         _IEVENT_IMXCR3.Bits.C_Select3
#define IEVENT_IMXCR3_B_Select0         _IEVENT_IMXCR3.Bits.B_Select0
#define IEVENT_IMXCR3_B_Select1         _IEVENT_IMXCR3.Bits.B_Select1
#define IEVENT_IMXCR3_B_Select2         _IEVENT_IMXCR3.Bits.B_Select2
#define IEVENT_IMXCR3_B_Select3         _IEVENT_IMXCR3.Bits.B_Select3
#define IEVENT_IMXCR3_A_Select0         _IEVENT_IMXCR3.Bits.A_Select0
#define IEVENT_IMXCR3_A_Select1         _IEVENT_IMXCR3.Bits.A_Select1
#define IEVENT_IMXCR3_A_Select2         _IEVENT_IMXCR3.Bits.A_Select2
#define IEVENT_IMXCR3_A_Select3         _IEVENT_IMXCR3.Bits.A_Select3
#define IEVENT_IMXCR3_D_Select          _IEVENT_IMXCR3.MergedBits.grpD_Select
#define IEVENT_IMXCR3_C_Select          _IEVENT_IMXCR3.MergedBits.grpC_Select
#define IEVENT_IMXCR3_B_Select          _IEVENT_IMXCR3.MergedBits.grpB_Select
#define IEVENT_IMXCR3_A_Select          _IEVENT_IMXCR3.MergedBits.grpA_Select

#define IEVENT_IMXCR3_D_Select0_MASK    1
#define IEVENT_IMXCR3_D_Select1_MASK    2
#define IEVENT_IMXCR3_D_Select2_MASK    4
#define IEVENT_IMXCR3_D_Select3_MASK    8
#define IEVENT_IMXCR3_C_Select0_MASK    256
#define IEVENT_IMXCR3_C_Select1_MASK    512
#define IEVENT_IMXCR3_C_Select2_MASK    1024
#define IEVENT_IMXCR3_C_Select3_MASK    2048
#define IEVENT_IMXCR3_B_Select0_MASK    65536
#define IEVENT_IMXCR3_B_Select1_MASK    131072
#define IEVENT_IMXCR3_B_Select2_MASK    262144
#define IEVENT_IMXCR3_B_Select3_MASK    524288
#define IEVENT_IMXCR3_A_Select0_MASK    16777216
#define IEVENT_IMXCR3_A_Select1_MASK    33554432
#define IEVENT_IMXCR3_A_Select2_MASK    67108864
#define IEVENT_IMXCR3_A_Select3_MASK    134217728
#define IEVENT_IMXCR3_D_Select_MASK     15
#define IEVENT_IMXCR3_D_Select_BITNUM   0
#define IEVENT_IMXCR3_C_Select_MASK     3840
#define IEVENT_IMXCR3_C_Select_BITNUM   8
#define IEVENT_IMXCR3_B_Select_MASK     983040
#define IEVENT_IMXCR3_B_Select_BITNUM   16
#define IEVENT_IMXCR3_A_Select_MASK     251658240
#define IEVENT_IMXCR3_A_Select_BITNUM   24


/*** IEVENT_BFECR3 - iEvent Boolean Function Evaluation Configuration Register 3; 0xFFFF9B1C ***/
typedef union {
  dword Dword;
  struct {
    dword PT3_DC0    :1;                                       /* Product Term 3, D input Configuration, bit 0 */
    dword PT3_DC1    :1;                                       /* Product Term 3, D input Configuration, bit 1 */
    dword PT3_CC0    :1;                                       /* Product Term 3, C input Configuration, bit 0 */
    dword PT3_CC1    :1;                                       /* Product Term 3, C input Configuration, bit 1 */
    dword PT3_BC0    :1;                                       /* Product Term 3, B input Configuration, bit 0 */
    dword PT3_BC1    :1;                                       /* Product Term 3, B input Configuration, bit 1 */
    dword PT3_AC0    :1;                                       /* Product Term 3, A input Configuration, bit 0 */
    dword PT3_AC1    :1;                                       /* Product Term 3, A input Configuration, bit 1 */
    dword PT2_DC0    :1;                                       /* Product Term 2, D input Configuration, bit 0 */
    dword PT2_DC1    :1;                                       /* Product Term 2, D input Configuration, bit 1 */
    dword PT2_CC0    :1;                                       /* Product Term 2, C input Configuration, bit 0 */
    dword PT2_CC1    :1;                                       /* Product Term 2, C input Configuration, bit 1 */
    dword PT2_BC0    :1;                                       /* Product Term 2, B input Configuration, bit 0 */
    dword PT2_BC1    :1;                                       /* Product Term 2, B input Configuration, bit 1 */
    dword PT2_AC0    :1;                                       /* Product Term 2, A input Configuration, bit 0 */
    dword PT2_AC1    :1;                                       /* Product Term 2, A input Configuration, bit 1 */
    dword PT1_DC0    :1;                                       /* Product Term 1, D input Configuration, bit 0 */
    dword PT1_DC1    :1;                                       /* Product Term 1, D input Configuration, bit 1 */
    dword PT1_CC0    :1;                                       /* Product Term 1, C input Configuration, bit 0 */
    dword PT1_CC1    :1;                                       /* Product Term 1, C input Configuration, bit 1 */
    dword PT1_BC0    :1;                                       /* Product Term 1, B input Configuration, bit 0 */
    dword PT1_BC1    :1;                                       /* Product Term 1, B input Configuration, bit 1 */
    dword PT1_AC0    :1;                                       /* Product Term 1, A input Configuration, bit 0 */
    dword PT1_AC1    :1;                                       /* Product Term 1, A input Configuration, bit 1 */
    dword PT0_DC0    :1;                                       /* Product Term 0, D input Configuration, bit 0 */
    dword PT0_DC1    :1;                                       /* Product Term 0, D input Configuration, bit 1 */
    dword PT0_CC0    :1;                                       /* Product Term 0, C input Configuration, bit 0 */
    dword PT0_CC1    :1;                                       /* Product Term 0, C input Configuration, bit 1 */
    dword PT0_BC0    :1;                                       /* Product Term 0, B input Configuration, bit 0 */
    dword PT0_BC1    :1;                                       /* Product Term 0, B input Configuration, bit 1 */
    dword PT0_AC0    :1;                                       /* Product Term 0, A input Configuration, bit 0 */
    dword PT0_AC1    :1;                                       /* Product Term 0, A input Configuration, bit 1 */
  } Bits;
  struct {
    dword grpPT3_DC :2;
    dword grpPT3_CC :2;
    dword grpPT3_BC :2;
    dword grpPT3_AC :2;
    dword grpPT2_DC :2;
    dword grpPT2_CC :2;
    dword grpPT2_BC :2;
    dword grpPT2_AC :2;
    dword grpPT1_DC :2;
    dword grpPT1_CC :2;
    dword grpPT1_BC :2;
    dword grpPT1_AC :2;
    dword grpPT0_DC :2;
    dword grpPT0_CC :2;
    dword grpPT0_BC :2;
    dword grpPT0_AC :2;
  } MergedBits;
} IEVENT_BFECR3STR;
extern volatile IEVENT_BFECR3STR _IEVENT_BFECR3 @0xFFFF9B1C;
#define IEVENT_BFECR3                   _IEVENT_BFECR3.Dword
#define IEVENT_BFECR3_PT3_DC0           _IEVENT_BFECR3.Bits.PT3_DC0
#define IEVENT_BFECR3_PT3_DC1           _IEVENT_BFECR3.Bits.PT3_DC1
#define IEVENT_BFECR3_PT3_CC0           _IEVENT_BFECR3.Bits.PT3_CC0
#define IEVENT_BFECR3_PT3_CC1           _IEVENT_BFECR3.Bits.PT3_CC1
#define IEVENT_BFECR3_PT3_BC0           _IEVENT_BFECR3.Bits.PT3_BC0
#define IEVENT_BFECR3_PT3_BC1           _IEVENT_BFECR3.Bits.PT3_BC1
#define IEVENT_BFECR3_PT3_AC0           _IEVENT_BFECR3.Bits.PT3_AC0
#define IEVENT_BFECR3_PT3_AC1           _IEVENT_BFECR3.Bits.PT3_AC1
#define IEVENT_BFECR3_PT2_DC0           _IEVENT_BFECR3.Bits.PT2_DC0
#define IEVENT_BFECR3_PT2_DC1           _IEVENT_BFECR3.Bits.PT2_DC1
#define IEVENT_BFECR3_PT2_CC0           _IEVENT_BFECR3.Bits.PT2_CC0
#define IEVENT_BFECR3_PT2_CC1           _IEVENT_BFECR3.Bits.PT2_CC1
#define IEVENT_BFECR3_PT2_BC0           _IEVENT_BFECR3.Bits.PT2_BC0
#define IEVENT_BFECR3_PT2_BC1           _IEVENT_BFECR3.Bits.PT2_BC1
#define IEVENT_BFECR3_PT2_AC0           _IEVENT_BFECR3.Bits.PT2_AC0
#define IEVENT_BFECR3_PT2_AC1           _IEVENT_BFECR3.Bits.PT2_AC1
#define IEVENT_BFECR3_PT1_DC0           _IEVENT_BFECR3.Bits.PT1_DC0
#define IEVENT_BFECR3_PT1_DC1           _IEVENT_BFECR3.Bits.PT1_DC1
#define IEVENT_BFECR3_PT1_CC0           _IEVENT_BFECR3.Bits.PT1_CC0
#define IEVENT_BFECR3_PT1_CC1           _IEVENT_BFECR3.Bits.PT1_CC1
#define IEVENT_BFECR3_PT1_BC0           _IEVENT_BFECR3.Bits.PT1_BC0
#define IEVENT_BFECR3_PT1_BC1           _IEVENT_BFECR3.Bits.PT1_BC1
#define IEVENT_BFECR3_PT1_AC0           _IEVENT_BFECR3.Bits.PT1_AC0
#define IEVENT_BFECR3_PT1_AC1           _IEVENT_BFECR3.Bits.PT1_AC1
#define IEVENT_BFECR3_PT0_DC0           _IEVENT_BFECR3.Bits.PT0_DC0
#define IEVENT_BFECR3_PT0_DC1           _IEVENT_BFECR3.Bits.PT0_DC1
#define IEVENT_BFECR3_PT0_CC0           _IEVENT_BFECR3.Bits.PT0_CC0
#define IEVENT_BFECR3_PT0_CC1           _IEVENT_BFECR3.Bits.PT0_CC1
#define IEVENT_BFECR3_PT0_BC0           _IEVENT_BFECR3.Bits.PT0_BC0
#define IEVENT_BFECR3_PT0_BC1           _IEVENT_BFECR3.Bits.PT0_BC1
#define IEVENT_BFECR3_PT0_AC0           _IEVENT_BFECR3.Bits.PT0_AC0
#define IEVENT_BFECR3_PT0_AC1           _IEVENT_BFECR3.Bits.PT0_AC1
#define IEVENT_BFECR3_PT3_DC            _IEVENT_BFECR3.MergedBits.grpPT3_DC
#define IEVENT_BFECR3_PT3_CC            _IEVENT_BFECR3.MergedBits.grpPT3_CC
#define IEVENT_BFECR3_PT3_BC            _IEVENT_BFECR3.MergedBits.grpPT3_BC
#define IEVENT_BFECR3_PT3_AC            _IEVENT_BFECR3.MergedBits.grpPT3_AC
#define IEVENT_BFECR3_PT2_DC            _IEVENT_BFECR3.MergedBits.grpPT2_DC
#define IEVENT_BFECR3_PT2_CC            _IEVENT_BFECR3.MergedBits.grpPT2_CC
#define IEVENT_BFECR3_PT2_BC            _IEVENT_BFECR3.MergedBits.grpPT2_BC
#define IEVENT_BFECR3_PT2_AC            _IEVENT_BFECR3.MergedBits.grpPT2_AC
#define IEVENT_BFECR3_PT1_DC            _IEVENT_BFECR3.MergedBits.grpPT1_DC
#define IEVENT_BFECR3_PT1_CC            _IEVENT_BFECR3.MergedBits.grpPT1_CC
#define IEVENT_BFECR3_PT1_BC            _IEVENT_BFECR3.MergedBits.grpPT1_BC
#define IEVENT_BFECR3_PT1_AC            _IEVENT_BFECR3.MergedBits.grpPT1_AC
#define IEVENT_BFECR3_PT0_DC            _IEVENT_BFECR3.MergedBits.grpPT0_DC
#define IEVENT_BFECR3_PT0_CC            _IEVENT_BFECR3.MergedBits.grpPT0_CC
#define IEVENT_BFECR3_PT0_BC            _IEVENT_BFECR3.MergedBits.grpPT0_BC
#define IEVENT_BFECR3_PT0_AC            _IEVENT_BFECR3.MergedBits.grpPT0_AC

#define IEVENT_BFECR3_PT3_DC0_MASK      1
#define IEVENT_BFECR3_PT3_DC1_MASK      2
#define IEVENT_BFECR3_PT3_CC0_MASK      4
#define IEVENT_BFECR3_PT3_CC1_MASK      8
#define IEVENT_BFECR3_PT3_BC0_MASK      16
#define IEVENT_BFECR3_PT3_BC1_MASK      32
#define IEVENT_BFECR3_PT3_AC0_MASK      64
#define IEVENT_BFECR3_PT3_AC1_MASK      128
#define IEVENT_BFECR3_PT2_DC0_MASK      256
#define IEVENT_BFECR3_PT2_DC1_MASK      512
#define IEVENT_BFECR3_PT2_CC0_MASK      1024
#define IEVENT_BFECR3_PT2_CC1_MASK      2048
#define IEVENT_BFECR3_PT2_BC0_MASK      4096
#define IEVENT_BFECR3_PT2_BC1_MASK      8192
#define IEVENT_BFECR3_PT2_AC0_MASK      16384
#define IEVENT_BFECR3_PT2_AC1_MASK      32768
#define IEVENT_BFECR3_PT1_DC0_MASK      65536
#define IEVENT_BFECR3_PT1_DC1_MASK      131072
#define IEVENT_BFECR3_PT1_CC0_MASK      262144
#define IEVENT_BFECR3_PT1_CC1_MASK      524288
#define IEVENT_BFECR3_PT1_BC0_MASK      1048576
#define IEVENT_BFECR3_PT1_BC1_MASK      2097152
#define IEVENT_BFECR3_PT1_AC0_MASK      4194304
#define IEVENT_BFECR3_PT1_AC1_MASK      8388608
#define IEVENT_BFECR3_PT0_DC0_MASK      16777216
#define IEVENT_BFECR3_PT0_DC1_MASK      33554432
#define IEVENT_BFECR3_PT0_CC0_MASK      67108864
#define IEVENT_BFECR3_PT0_CC1_MASK      134217728
#define IEVENT_BFECR3_PT0_BC0_MASK      268435456
#define IEVENT_BFECR3_PT0_BC1_MASK      536870912
#define IEVENT_BFECR3_PT0_AC0_MASK      1073741824
#define IEVENT_BFECR3_PT0_AC1_MASK      2147483648
#define IEVENT_BFECR3_PT3_DC_MASK       3
#define IEVENT_BFECR3_PT3_DC_BITNUM     0
#define IEVENT_BFECR3_PT3_CC_MASK       12
#define IEVENT_BFECR3_PT3_CC_BITNUM     2
#define IEVENT_BFECR3_PT3_BC_MASK       48
#define IEVENT_BFECR3_PT3_BC_BITNUM     4
#define IEVENT_BFECR3_PT3_AC_MASK       192
#define IEVENT_BFECR3_PT3_AC_BITNUM     6
#define IEVENT_BFECR3_PT2_DC_MASK       768
#define IEVENT_BFECR3_PT2_DC_BITNUM     8
#define IEVENT_BFECR3_PT2_CC_MASK       3072
#define IEVENT_BFECR3_PT2_CC_BITNUM     10
#define IEVENT_BFECR3_PT2_BC_MASK       12288
#define IEVENT_BFECR3_PT2_BC_BITNUM     12
#define IEVENT_BFECR3_PT2_AC_MASK       49152
#define IEVENT_BFECR3_PT2_AC_BITNUM     14
#define IEVENT_BFECR3_PT1_DC_MASK       196608
#define IEVENT_BFECR3_PT1_DC_BITNUM     16
#define IEVENT_BFECR3_PT1_CC_MASK       786432
#define IEVENT_BFECR3_PT1_CC_BITNUM     18
#define IEVENT_BFECR3_PT1_BC_MASK       3145728
#define IEVENT_BFECR3_PT1_BC_BITNUM     20
#define IEVENT_BFECR3_PT1_AC_MASK       12582912
#define IEVENT_BFECR3_PT1_AC_BITNUM     22
#define IEVENT_BFECR3_PT0_DC_MASK       50331648
#define IEVENT_BFECR3_PT0_DC_BITNUM     24
#define IEVENT_BFECR3_PT0_CC_MASK       201326592
#define IEVENT_BFECR3_PT0_CC_BITNUM     26
#define IEVENT_BFECR3_PT0_BC_MASK       805306368
#define IEVENT_BFECR3_PT0_BC_BITNUM     28
#define IEVENT_BFECR3_PT0_AC_MASK       3221225472
#define IEVENT_BFECR3_PT0_AC_BITNUM     30


/*** DMAREQC - DMA Request Control; 0xFFFFE400 ***/
typedef union {
  dword Dword;
  struct {
    dword DMAC3      :4;                                       /* DMA Channel 3 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword DMAC2      :4;                                       /* DMA Channel 2 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword DMAC1      :4;                                       /* DMA Channel 1 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword DMAC0      :4;                                       /* DMA Channel 0 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} DMAREQCSTR;
extern volatile DMAREQCSTR _DMAREQC @0xFFFFE400;
#define DMAREQC                         _DMAREQC.Dword
#define DMAREQC_DMAC3                   _DMAREQC.Bits.DMAC3
#define DMAREQC_DMAC2                   _DMAREQC.Bits.DMAC2
#define DMAREQC_DMAC1                   _DMAREQC.Bits.DMAC1
#define DMAREQC_DMAC0                   _DMAREQC.Bits.DMAC0

#define DMAREQC_DMAC3_MASK              15
#define DMAREQC_DMAC3_BITNUM            0
#define DMAREQC_DMAC2_MASK              3840
#define DMAREQC_DMAC2_BITNUM            8
#define DMAREQC_DMAC1_MASK              983040
#define DMAREQC_DMAC1_BITNUM            16
#define DMAREQC_DMAC0_MASK              251658240
#define DMAREQC_DMAC0_BITNUM            24


/*** SAR0 - Source Address Register 0; 0xFFFFE500 ***/
typedef union {
  dword Dword;
  struct {
    dword SAR        :24;                                      /* Source address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} SAR0STR;
extern volatile SAR0STR _SAR0 @0xFFFFE500;
#define SAR0                            _SAR0.Dword
#define SAR0_SAR                        _SAR0.Bits.SAR

#define SAR0_SAR_MASK                   16777215
#define SAR0_SAR_BITNUM                 0


/*** DAR0 - Destination Address Register 0; 0xFFFFE504 ***/
typedef union {
  dword Dword;
  struct {
    dword DAR        :24;                                      /* Destination address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} DAR0STR;
extern volatile DAR0STR _DAR0 @0xFFFFE504;
#define DAR0                            _DAR0.Dword
#define DAR0_DAR                        _DAR0.Bits.DAR

#define DAR0_DAR_MASK                   16777215
#define DAR0_DAR_BITNUM                 0


