AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** BCR0 - Byte Count Register 0; 0xFFFFE508 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** DSR0 - DMA Status Register 0; 0xFFFFE508 ***/
    union {
      byte Byte;
      struct {
        byte DONE        :1;                                       /* Transactions done. Set when all DMA controller transactions complete, as determined by transfer count or error conditions. When BCR reaches zero, DONE is set when the final transfer completes successfully. DONE can also be used to abort a transfer by resetting the status bits. When a transfer completes, software must clear DONE before reprogramming the DMA */
        byte BSY         :1;                                       /* Busy */
        byte REQ         :1;                                       /* Request */
        byte             :1; 
        byte BED         :1;                                       /* Bus error on destination */
        byte BES         :1;                                       /* Bus error on source */
        byte CE          :1;                                       /* Configuration error. Occurs when BCR, SAR, or DAR does not match the requested transfer size, or if BCR = 0 when the DMA receives a start condition. CE is cleared at hardware reset or by writing a 1 to DSR[DONE] */
        byte             :1; 
      } Bits;
    } DSR0STR;
    #define DSR0                        _BCR0.Overlap_STR.DSR0STR.Byte
    #define DSR0_DONE                   _BCR0.Overlap_STR.DSR0STR.Bits.DONE
    #define DSR0_BSY                    _BCR0.Overlap_STR.DSR0STR.Bits.BSY
    #define DSR0_REQ                    _BCR0.Overlap_STR.DSR0STR.Bits.REQ
    #define DSR0_BED                    _BCR0.Overlap_STR.DSR0STR.Bits.BED
    #define DSR0_BES                    _BCR0.Overlap_STR.DSR0STR.Bits.BES
    #define DSR0_CE                     _BCR0.Overlap_STR.DSR0STR.Bits.CE
    
    #define DSR0_DONE_MASK              1
    #define DSR0_BSY_MASK               2
    #define DSR0_REQ_MASK               4
    #define DSR0_BED_MASK               16
    #define DSR0_BES_MASK               32
    #define DSR0_CE_MASK                64
    
  } Overlap_STR;

  struct {
    dword BCR        :24;                                      /* Byte count */
    dword DSR        :8;                                       /* DMA Status Register */
  } Bits;
} BCR0STR;
extern volatile BCR0STR _BCR0 @0xFFFFE508;
#define BCR0                            _BCR0.Dword
#define BCR0_BCR                        _BCR0.Bits.BCR
#define BCR0_DSR                        _BCR0.Bits.DSR

#define BCR0_BCR_MASK                   16777215
#define BCR0_BCR_BITNUM                 0
#define BCR0_DSR_MASK                   4278190080
#define BCR0_DSR_BITNUM                 24


/*** DCR0 - DMA Control Register 0; 0xFFFFE50C ***/
typedef union {
  dword Dword;
  struct {
    dword LCH2       :2;                                       /* Link channel 2. Indicates the DMA channel assigned as link channel 2. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR0[CE] is set) */
    dword LCH1       :2;                                       /* Link channel 1. Indicates the DMA channel assigned as link channel 1. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR0[CE] is set) */
    dword LINKCC     :2;                                       /* Link channel control. Allows DMA channels to have their transfers linked. The current DMA channel will trigger a DMA request to the linked channels (LCH1 or LCH2) depending on the condition described by the LINKCC bits. The LINKCC field provides a 2-bit encoded value defining the applicable channel-to-channel linking */
    dword            :1; 
    dword D_REQ      :1;                                       /* Disable request. If this flag is set, the DMA hardware automatically clears the DCR0[ERQ] bit when the byte count register reaches zero */
    dword DMOD       :4;                                       /* Destination address modulo. Defines the size of the destination data circular buffer used by the DMA controller */
    dword SMOD       :4;                                       /* Source address modulo. Defines the size of the source data circular buffer used by the DMA controller */
    dword START      :1;                                       /* Start transfer */
    dword DSIZE      :2;                                       /* Destination size. Determines the data size of the destination bus cycle for the DMA controller */
    dword DINC       :1;                                       /* Destination increment. Controls whether a destination address increments after each successful transfer */
    dword SSIZE      :2;                                       /* Source size. Determines the data size of the source bus cycle for the DMA control module */
    dword SINC       :1;                                       /* Source increment. Controls whether a source address increments after each successful transfer */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword AA         :1;                                       /* Auto-align. AA and SIZE determine whether the source or destination is auto-aligned, that is, transfers are optimized based on the address and size */
    dword CS         :1;                                       /* Cycle steal */
    dword ERQ        :1;                                       /* Enable peripheral request. Care should be taken because a collision can occur between the START bit and DREQ0 when ERQ equals 1 */
    dword EINT       :1;                                       /* Interrupt on completion of transfer. Determines whether an interrupt is generated by completing a transfer or by the occurrence of an error condition */
  } Bits;
} DCR0STR;
extern volatile DCR0STR _DCR0 @0xFFFFE50C;
#define DCR0                            _DCR0.Dword
#define DCR0_LCH2                       _DCR0.Bits.LCH2
#define DCR0_LCH1                       _DCR0.Bits.LCH1
#define DCR0_LINKCC                     _DCR0.Bits.LINKCC
#define DCR0_D_REQ                      _DCR0.Bits.D_REQ
#define DCR0_DMOD                       _DCR0.Bits.DMOD
#define DCR0_SMOD                       _DCR0.Bits.SMOD
#define DCR0_START                      _DCR0.Bits.START
#define DCR0_DSIZE                      _DCR0.Bits.DSIZE
#define DCR0_DINC                       _DCR0.Bits.DINC
#define DCR0_SSIZE                      _DCR0.Bits.SSIZE
#define DCR0_SINC                       _DCR0.Bits.SINC
#define DCR0_AA                         _DCR0.Bits.AA
#define DCR0_CS                         _DCR0.Bits.CS
#define DCR0_ERQ                        _DCR0.Bits.ERQ
#define DCR0_EINT                       _DCR0.Bits.EINT

#define DCR0_LCH2_MASK                  3
#define DCR0_LCH2_BITNUM                0
#define DCR0_LCH1_MASK                  12
#define DCR0_LCH1_BITNUM                2
#define DCR0_LINKCC_MASK                48
#define DCR0_LINKCC_BITNUM              4
#define DCR0_D_REQ_MASK                 128
#define DCR0_DMOD_MASK                  3840
#define DCR0_DMOD_BITNUM                8
#define DCR0_SMOD_MASK                  61440
#define DCR0_SMOD_BITNUM                12
#define DCR0_START_MASK                 65536
#define DCR0_DSIZE_MASK                 393216
#define DCR0_DSIZE_BITNUM               17
#define DCR0_DINC_MASK                  524288
#define DCR0_SSIZE_MASK                 3145728
#define DCR0_SSIZE_BITNUM               20
#define DCR0_SINC_MASK                  4194304
#define DCR0_AA_MASK                    268435456
#define DCR0_CS_MASK                    536870912
#define DCR0_ERQ_MASK                   1073741824
#define DCR0_EINT_MASK                  2147483648


