AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** SAR1 - Source Address Register 1; 0xFFFFE510 ***/
typedef union {
  dword Dword;
  struct {
    dword SAR        :24;                                      /* Source address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} SAR1STR;
extern volatile SAR1STR _SAR1 @0xFFFFE510;
#define SAR1                            _SAR1.Dword
#define SAR1_SAR                        _SAR1.Bits.SAR

#define SAR1_SAR_MASK                   16777215
#define SAR1_SAR_BITNUM                 0


/*** DAR1 - Destination Address Register 1; 0xFFFFE514 ***/
typedef union {
  dword Dword;
  struct {
    dword DAR        :24;                                      /* Destination address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} DAR1STR;
extern volatile DAR1STR _DAR1 @0xFFFFE514;
#define DAR1                            _DAR1.Dword
#define DAR1_DAR                        _DAR1.Bits.DAR

#define DAR1_DAR_MASK                   16777215
#define DAR1_DAR_BITNUM                 0


/*** BCR1 - Byte Count Register 1; 0xFFFFE518 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** DSR1 - DMA Status Register 1; 0xFFFFE518 ***/
    union {
      byte Byte;
      struct {
        byte DONE        :1;                                       /* Transactions done. Set when all DMA controller transactions complete, as determined by transfer count or error conditions. When BCR reaches zero, DONE is set when the final transfer completes successfully. DONE can also be used to abort a transfer by resetting the status bits. When a transfer completes, software must clear DONE before reprogramming the DMA */
        byte BSY         :1;                                       /* Busy */
        byte REQ         :1;                                       /* Request */
        byte             :1; 
        byte BED         :1;                                       /* Bus error on destination */
        byte BES         :1;                                       /* Bus error on source */
        byte CE          :1;                                       /* Configuration error. Occurs when BCR, SAR, or DAR does not match the requested transfer size, or if BCR = 0 when the DMA receives a start condition. CE is cleared at hardware reset or by writing a 1 to DSR[DONE] */
        byte             :1; 
      } Bits;
    } DSR1STR;
    #define DSR1                        _BCR1.Overlap_STR.DSR1STR.Byte
    #define DSR1_DONE                   _BCR1.Overlap_STR.DSR1STR.Bits.DONE
    #define DSR1_BSY                    _BCR1.Overlap_STR.DSR1STR.Bits.BSY
    #define DSR1_REQ                    _BCR1.Overlap_STR.DSR1STR.Bits.REQ
    #define DSR1_BED                    _BCR1.Overlap_STR.DSR1STR.Bits.BED
    #define DSR1_BES                    _BCR1.Overlap_STR.DSR1STR.Bits.BES
    #define DSR1_CE                     _BCR1.Overlap_STR.DSR1STR.Bits.CE
    
    #define DSR1_DONE_MASK              1
    #define DSR1_BSY_MASK               2
    #define DSR1_REQ_MASK               4
    #define DSR1_BED_MASK               16
    #define DSR1_BES_MASK               32
    #define DSR1_CE_MASK                64
    
  } Overlap_STR;

  struct {
    dword BCR        :24;                                      /* Byte count */
    dword DSR        :8;                                       /* DMA Status Register */
  } Bits;
} BCR1STR;
extern volatile BCR1STR _BCR1 @0xFFFFE518;
#define BCR1                            _BCR1.Dword
#define BCR1_BCR                        _BCR1.Bits.BCR
#define BCR1_DSR                        _BCR1.Bits.DSR

#define BCR1_BCR_MASK                   16777215
#define BCR1_BCR_BITNUM                 0
#define BCR1_DSR_MASK                   4278190080
#define BCR1_DSR_BITNUM                 24


/*** DCR1 - DMA Control Register 1; 0xFFFFE51C ***/
typedef union {
  dword Dword;
  struct {
    dword LCH2       :2;                                       /* Link channel 2. Indicates the DMA channel assigned as link channel 2. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR1[CE] is set) */
    dword LCH1       :2;                                       /* Link channel 1. Indicates the DMA channel assigned as link channel 1. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR1[CE] is set) */
    dword LINKCC     :2;                                       /* Link channel control. Allows DMA channels to have their transfers linked. The current DMA channel will trigger a DMA request to the linked channels (LCH1 or LCH2) depending on the condition described by the LINKCC bits. The LINKCC field provides a 2-bit encoded value defining the applicable channel-to-channel linking */
    dword            :1; 
    dword D_REQ      :1;                                       /* Disable request. If this flag is set, the DMA hardware automatically clears the DCR1[ERQ] bit when the byte count register reaches zero */
    dword DMOD       :4;                                       /* Destination address modulo. Defines the size of the destination data circular buffer used by the DMA controller */
    dword SMOD       :4;                                       /* Source address modulo. Defines the size of the source data circular buffer used by the DMA controller */
    dword START      :1;                                       /* Start transfer */
    dword DSIZE      :2;                                       /* Destination size. Determines the data size of the destination bus cycle for the DMA controller */
    dword DINC       :1;                                       /* Destination increment. Controls whether a destination address increments after each successful transfer */
    dword SSIZE      :2;                                       /* Source size. Determines the data size of the source bus cycle for the DMA control module */
    dword SINC       :1;                                       /* Source increment. Controls whether a source address increments after each successful transfer */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword AA         :1;                                       /* Auto-align. AA and SIZE determine whether the source or destination is auto-aligned, that is, transfers are optimized based on the address and size */
    dword CS         :1;                                       /* Cycle steal */
    dword ERQ        :1;                                       /* Enable peripheral request. Care should be taken because a collision can occur between the START bit and DREQ1 when ERQ equals 1 */
    dword EINT       :1;                                       /* Interrupt on completion of transfer. Determines whether an interrupt is generated by completing a transfer or by the occurrence of an error condition */
  } Bits;
} DCR1STR;
