AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile DCR1STR _DCR1 @0xFFFFE51C;
#define DCR1                            _DCR1.Dword
#define DCR1_LCH2                       _DCR1.Bits.LCH2
#define DCR1_LCH1                       _DCR1.Bits.LCH1
#define DCR1_LINKCC                     _DCR1.Bits.LINKCC
#define DCR1_D_REQ                      _DCR1.Bits.D_REQ
#define DCR1_DMOD                       _DCR1.Bits.DMOD
#define DCR1_SMOD                       _DCR1.Bits.SMOD
#define DCR1_START                      _DCR1.Bits.START
#define DCR1_DSIZE                      _DCR1.Bits.DSIZE
#define DCR1_DINC                       _DCR1.Bits.DINC
#define DCR1_SSIZE                      _DCR1.Bits.SSIZE
#define DCR1_SINC                       _DCR1.Bits.SINC
#define DCR1_AA                         _DCR1.Bits.AA
#define DCR1_CS                         _DCR1.Bits.CS
#define DCR1_ERQ                        _DCR1.Bits.ERQ
#define DCR1_EINT                       _DCR1.Bits.EINT

#define DCR1_LCH2_MASK                  3
#define DCR1_LCH2_BITNUM                0
#define DCR1_LCH1_MASK                  12
#define DCR1_LCH1_BITNUM                2
#define DCR1_LINKCC_MASK                48
#define DCR1_LINKCC_BITNUM              4
#define DCR1_D_REQ_MASK                 128
#define DCR1_DMOD_MASK                  3840
#define DCR1_DMOD_BITNUM                8
#define DCR1_SMOD_MASK                  61440
#define DCR1_SMOD_BITNUM                12
#define DCR1_START_MASK                 65536
#define DCR1_DSIZE_MASK                 393216
#define DCR1_DSIZE_BITNUM               17
#define DCR1_DINC_MASK                  524288
#define DCR1_SSIZE_MASK                 3145728
#define DCR1_SSIZE_BITNUM               20
#define DCR1_SINC_MASK                  4194304
#define DCR1_AA_MASK                    268435456
#define DCR1_CS_MASK                    536870912
#define DCR1_ERQ_MASK                   1073741824
#define DCR1_EINT_MASK                  2147483648


/*** SAR2 - Source Address Register 2; 0xFFFFE520 ***/
typedef union {
  dword Dword;
  struct {
    dword SAR        :24;                                      /* Source address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} SAR2STR;
extern volatile SAR2STR _SAR2 @0xFFFFE520;
#define SAR2                            _SAR2.Dword
#define SAR2_SAR                        _SAR2.Bits.SAR

#define SAR2_SAR_MASK                   16777215
#define SAR2_SAR_BITNUM                 0


/*** DAR2 - Destination Address Register 2; 0xFFFFE524 ***/
typedef union {
  dword Dword;
  struct {
    dword DAR        :24;                                      /* Destination address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} DAR2STR;
extern volatile DAR2STR _DAR2 @0xFFFFE524;
#define DAR2                            _DAR2.Dword
#define DAR2_DAR                        _DAR2.Bits.DAR

#define DAR2_DAR_MASK                   16777215
#define DAR2_DAR_BITNUM                 0


/*** BCR2 - Byte Count Register 2; 0xFFFFE528 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** DSR2 - DMA Status Register 2; 0xFFFFE528 ***/
    union {
      byte Byte;
      struct {
        byte DONE        :1;                                       /* Transactions done. Set when all DMA controller transactions complete, as determined by transfer count or error conditions. When BCR reaches zero, DONE is set when the final transfer completes successfully. DONE can also be used to abort a transfer by resetting the status bits. When a transfer completes, software must clear DONE before reprogramming the DMA */
        byte BSY         :1;                                       /* Busy */
        byte REQ         :1;                                       /* Request */
        byte             :1; 
        byte BED         :1;                                       /* Bus error on destination */
        byte BES         :1;                                       /* Bus error on source */
        byte CE          :1;                                       /* Configuration error. Occurs when BCR, SAR, or DAR does not match the requested transfer size, or if BCR = 0 when the DMA receives a start condition. CE is cleared at hardware reset or by writing a 1 to DSR[DONE] */
        byte             :1; 
      } Bits;
    } DSR2STR;
    #define DSR2                        _BCR2.Overlap_STR.DSR2STR.Byte
    #define DSR2_DONE                   _BCR2.Overlap_STR.DSR2STR.Bits.DONE
    #define DSR2_BSY                    _BCR2.Overlap_STR.DSR2STR.Bits.BSY
    #define DSR2_REQ                    _BCR2.Overlap_STR.DSR2STR.Bits.REQ
    #define DSR2_BED                    _BCR2.Overlap_STR.DSR2STR.Bits.BED
    #define DSR2_BES                    _BCR2.Overlap_STR.DSR2STR.Bits.BES
    #define DSR2_CE                     _BCR2.Overlap_STR.DSR2STR.Bits.CE
    
    #define DSR2_DONE_MASK              1
    #define DSR2_BSY_MASK               2
    #define DSR2_REQ_MASK               4
    #define DSR2_BED_MASK               16
    #define DSR2_BES_MASK               32
    #define DSR2_CE_MASK                64
    
  } Overlap_STR;

  struct {
    dword BCR        :24;                                      /* Byte count */
    dword DSR        :8;                                       /* DMA Status Register */
  } Bits;
} BCR2STR;
extern volatile BCR2STR _BCR2 @0xFFFFE528;
#define BCR2                            _BCR2.Dword
#define BCR2_BCR                        _BCR2.Bits.BCR
#define BCR2_DSR                        _BCR2.Bits.DSR

#define BCR2_BCR_MASK                   16777215
#define BCR2_BCR_BITNUM                 0
#define BCR2_DSR_MASK                   4278190080
#define BCR2_DSR_BITNUM                 24


/*** DCR2 - DMA Control Register 2; 0xFFFFE52C ***/
typedef union {
  dword Dword;
  struct {
    dword LCH2       :2;                                       /* Link channel 2. Indicates the DMA channel assigned as link channel 2. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR2[CE] is set) */
    dword LCH1       :2;                                       /* Link channel 1. Indicates the DMA channel assigned as link channel 1. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR2[CE] is set) */
    dword LINKCC     :2;                                       /* Link channel control. Allows DMA channels to have their transfers linked. The current DMA channel will trigger a DMA request to the linked channels (LCH1 or LCH2) depending on the condition described by the LINKCC bits. The LINKCC field provides a 2-bit encoded value defining the applicable channel-to-channel linking */
    dword            :1; 
    dword D_REQ      :1;                                       /* Disable request. If this flag is set, the DMA hardware automatically clears the DCR2[ERQ] bit when the byte count register reaches zero */
    dword DMOD       :4;                                       /* Destination address modulo. Defines the size of the destination data circular buffer used by the DMA controller */
    dword SMOD       :4;                                       /* Source address modulo. Defines the size of the source data circular buffer used by the DMA controller */
    dword START      :1;                                       /* Start transfer */
    dword DSIZE      :2;                                       /* Destination size. Determines the data size of the destination bus cycle for the DMA controller */
    dword DINC       :1;                                       /* Destination increment. Controls whether a destination address increments after each successful transfer */
    dword SSIZE      :2;                                       /* Source size. Determines the data size of the source bus cycle for the DMA control module */
    dword SINC       :1;                                       /* Source increment. Controls whether a source address increments after each successful transfer */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword AA         :1;                                       /* Auto-align. AA and SIZE determine whether the source or destination is auto-aligned, that is, transfers are optimized based on the address and size */
    dword CS         :1;                                       /* Cycle steal */
    dword ERQ        :1;                                       /* Enable peripheral request. Care should be taken because a collision can occur between the START bit and DREQ2 when ERQ equals 1 */
    dword EINT       :1;                                       /* Interrupt on completion of transfer. Determines whether an interrupt is generated by completing a transfer or by the occurrence of an error condition */
  } Bits;
} DCR2STR;
extern volatile DCR2STR _DCR2 @0xFFFFE52C;
#define DCR2                            _DCR2.Dword
#define DCR2_LCH2                       _DCR2.Bits.LCH2
#define DCR2_LCH1                       _DCR2.Bits.LCH1
#define DCR2_LINKCC                     _DCR2.Bits.LINKCC
#define DCR2_D_REQ                      _DCR2.Bits.D_REQ
#define DCR2_DMOD                       _DCR2.Bits.DMOD
#define DCR2_SMOD                       _DCR2.Bits.SMOD
#define DCR2_START                      _DCR2.Bits.START
#define DCR2_DSIZE                      _DCR2.Bits.DSIZE
#define DCR2_DINC                       _DCR2.Bits.DINC
#define DCR2_SSIZE                      _DCR2.Bits.SSIZE
#define DCR2_SINC                       _DCR2.Bits.SINC
#define DCR2_AA                         _DCR2.Bits.AA
#define DCR2_CS                         _DCR2.Bits.CS
#define DCR2_ERQ                        _DCR2.Bits.ERQ
#define DCR2_EINT                       _DCR2.Bits.EINT

#define DCR2_LCH2_MASK                  3
#define DCR2_LCH2_BITNUM                0
#define DCR2_LCH1_MASK                  12
#define DCR2_LCH1_BITNUM                2
#define DCR2_LINKCC_MASK                48
#define DCR2_LINKCC_BITNUM              4
#define DCR2_D_REQ_MASK                 128
#define DCR2_DMOD_MASK                  3840
#define DCR2_DMOD_BITNUM                8
#define DCR2_SMOD_MASK                  61440
#define DCR2_SMOD_BITNUM                12
#define DCR2_START_MASK                 65536
#define DCR2_DSIZE_MASK                 393216
#define DCR2_DSIZE_BITNUM               17
#define DCR2_DINC_MASK                  524288
#define DCR2_SSIZE_MASK                 3145728
#define DCR2_SSIZE_BITNUM               20
#define DCR2_SINC_MASK                  4194304
#define DCR2_AA_MASK                    268435456
#define DCR2_CS_MASK                    536870912
#define DCR2_ERQ_MASK                   1073741824
#define DCR2_EINT_MASK                  2147483648


