AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
/*** SAR3 - Source Address Register 3; 0xFFFFE530 ***/
typedef union {
  dword Dword;
  struct {
    dword SAR        :24;                                      /* Source address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} SAR3STR;
extern volatile SAR3STR _SAR3 @0xFFFFE530;
#define SAR3                            _SAR3.Dword
#define SAR3_SAR                        _SAR3.Bits.SAR

#define SAR3_SAR_MASK                   16777215
#define SAR3_SAR_BITNUM                 0


/*** DAR3 - Destination Address Register 3; 0xFFFFE534 ***/
typedef union {
  dword Dword;
  struct {
    dword DAR        :24;                                      /* Destination address */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
} DAR3STR;
extern volatile DAR3STR _DAR3 @0xFFFFE534;
#define DAR3                            _DAR3.Dword
#define DAR3_DAR                        _DAR3.Bits.DAR

#define DAR3_DAR_MASK                   16777215
#define DAR3_DAR_BITNUM                 0


/*** BCR3 - Byte Count Register 3; 0xFFFFE538 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** DSR3 - DMA Status Register 3; 0xFFFFE538 ***/
    union {
      byte Byte;
      struct {
        byte DONE        :1;                                       /* Transactions done. Set when all DMA controller transactions complete, as determined by transfer count or error conditions. When BCR reaches zero, DONE is set when the final transfer completes successfully. DONE can also be used to abort a transfer by resetting the status bits. When a transfer completes, software must clear DONE before reprogramming the DMA */
        byte BSY         :1;                                       /* Busy */
        byte REQ         :1;                                       /* Request */
        byte             :1; 
        byte BED         :1;                                       /* Bus error on destination */
        byte BES         :1;                                       /* Bus error on source */
        byte CE          :1;                                       /* Configuration error. Occurs when BCR, SAR, or DAR does not match the requested transfer size, or if BCR = 0 when the DMA receives a start condition. CE is cleared at hardware reset or by writing a 1 to DSR[DONE] */
        byte             :1; 
      } Bits;
    } DSR3STR;
    #define DSR3                        _BCR3.Overlap_STR.DSR3STR.Byte
    #define DSR3_DONE                   _BCR3.Overlap_STR.DSR3STR.Bits.DONE
    #define DSR3_BSY                    _BCR3.Overlap_STR.DSR3STR.Bits.BSY
    #define DSR3_REQ                    _BCR3.Overlap_STR.DSR3STR.Bits.REQ
    #define DSR3_BED                    _BCR3.Overlap_STR.DSR3STR.Bits.BED
    #define DSR3_BES                    _BCR3.Overlap_STR.DSR3STR.Bits.BES
    #define DSR3_CE                     _BCR3.Overlap_STR.DSR3STR.Bits.CE
    
    #define DSR3_DONE_MASK              1
    #define DSR3_BSY_MASK               2
    #define DSR3_REQ_MASK               4
    #define DSR3_BED_MASK               16
    #define DSR3_BES_MASK               32
    #define DSR3_CE_MASK                64
    
  } Overlap_STR;

  struct {
    dword BCR        :24;                                      /* Byte count */
    dword DSR        :8;                                       /* DMA Status Register */
  } Bits;
} BCR3STR;
extern volatile BCR3STR _BCR3 @0xFFFFE538;
#define BCR3                            _BCR3.Dword
#define BCR3_BCR                        _BCR3.Bits.BCR
#define BCR3_DSR                        _BCR3.Bits.DSR

#define BCR3_BCR_MASK                   16777215
#define BCR3_BCR_BITNUM                 0
#define BCR3_DSR_MASK                   4278190080
#define BCR3_DSR_BITNUM                 24


/*** DCR3 - DMA Control Register 3; 0xFFFFE53C ***/
typedef union {
  dword Dword;
  struct {
    dword LCH2       :2;                                       /* Link channel 2. Indicates the DMA channel assigned as link channel 2. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR3[CE] is set) */
    dword LCH1       :2;                                       /* Link channel 1. Indicates the DMA channel assigned as link channel 1. The link channel number cannot be the same as the currently executing channel, and generates a configuration error if this is attempted (DSR3[CE] is set) */
    dword LINKCC     :2;                                       /* Link channel control. Allows DMA channels to have their transfers linked. The current DMA channel will trigger a DMA request to the linked channels (LCH1 or LCH2) depending on the condition described by the LINKCC bits. The LINKCC field provides a 2-bit encoded value defining the applicable channel-to-channel linking */
    dword            :1; 
    dword D_REQ      :1;                                       /* Disable request. If this flag is set, the DMA hardware automatically clears the DCR3[ERQ] bit when the byte count register reaches zero */
    dword DMOD       :4;                                       /* Destination address modulo. Defines the size of the destination data circular buffer used by the DMA controller */
    dword SMOD       :4;                                       /* Source address modulo. Defines the size of the source data circular buffer used by the DMA controller */
    dword START      :1;                                       /* Start transfer */
    dword DSIZE      :2;                                       /* Destination size. Determines the data size of the destination bus cycle for the DMA controller */
    dword DINC       :1;                                       /* Destination increment. Controls whether a destination address increments after each successful transfer */
    dword SSIZE      :2;                                       /* Source size. Determines the data size of the source bus cycle for the DMA control module */
    dword SINC       :1;                                       /* Source increment. Controls whether a source address increments after each successful transfer */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword AA         :1;                                       /* Auto-align. AA and SIZE determine whether the source or destination is auto-aligned, that is, transfers are optimized based on the address and size */
    dword CS         :1;                                       /* Cycle steal */
    dword ERQ        :1;                                       /* Enable peripheral request. Care should be taken because a collision can occur between the START bit and DREQ3 when ERQ equals 1 */
    dword EINT       :1;                                       /* Interrupt on completion of transfer. Determines whether an interrupt is generated by completing a transfer or by the occurrence of an error condition */
  } Bits;
} DCR3STR;
extern volatile DCR3STR _DCR3 @0xFFFFE53C;
#define DCR3                            _DCR3.Dword
#define DCR3_LCH2                       _DCR3.Bits.LCH2
#define DCR3_LCH1                       _DCR3.Bits.LCH1
#define DCR3_LINKCC                     _DCR3.Bits.LINKCC
#define DCR3_D_REQ                      _DCR3.Bits.D_REQ
#define DCR3_DMOD                       _DCR3.Bits.DMOD
#define DCR3_SMOD                       _DCR3.Bits.SMOD
#define DCR3_START                      _DCR3.Bits.START
#define DCR3_DSIZE                      _DCR3.Bits.DSIZE
#define DCR3_DINC                       _DCR3.Bits.DINC
#define DCR3_SSIZE                      _DCR3.Bits.SSIZE
#define DCR3_SINC                       _DCR3.Bits.SINC
#define DCR3_AA                         _DCR3.Bits.AA
#define DCR3_CS                         _DCR3.Bits.CS
#define DCR3_ERQ                        _DCR3.Bits.ERQ
#define DCR3_EINT                       _DCR3.Bits.EINT

#define DCR3_LCH2_MASK                  3
#define DCR3_LCH2_BITNUM                0
#define DCR3_LCH1_MASK                  12
#define DCR3_LCH1_BITNUM                2
#define DCR3_LINKCC_MASK                48
#define DCR3_LINKCC_BITNUM              4
#define DCR3_D_REQ_MASK                 128
#define DCR3_DMOD_MASK                  3840
#define DCR3_DMOD_BITNUM                8
#define DCR3_SMOD_MASK                  61440
#define DCR3_SMOD_BITNUM                12
#define DCR3_START_MASK                 65536
#define DCR3_DSIZE_MASK                 393216
#define DCR3_DSIZE_BITNUM               17
#define DCR3_DINC_MASK                  524288
#define DCR3_SSIZE_MASK                 3145728
#define DCR3_SSIZE_BITNUM               20
#define DCR3_SINC_MASK                  4194304
#define DCR3_AA_MASK                    268435456
#define DCR3_CS_MASK                    536870912
#define DCR3_ERQ_MASK                   1073741824
#define DCR3_EINT_MASK                  2147483648


/*** INTC_IMRH - Interrupt Mask Register High; 0xFFFFFFC8 ***/
typedef union {
  dword Dword;
  struct {
    dword IMR32      :1;                                       /* Interrupt mask register 32 */
    dword IMR33      :1;                                       /* Interrupt mask register 33 */
    dword IMR34      :1;                                       /* Interrupt mask register 34 */
    dword IMR35      :1;                                       /* Interrupt mask register 35 */
    dword IMR36      :1;                                       /* Interrupt mask register 36 */
    dword IMR37      :1;                                       /* Interrupt mask register 37 */
    dword IMR38      :1;                                       /* Interrupt mask register 38 */
    dword IMR39      :1;                                       /* Interrupt mask register 39 */
    dword IMR40      :1;                                       /* Interrupt mask register 40 */
    dword IMR41      :1;                                       /* Interrupt mask register 41 */
    dword IMR42      :1;                                       /* Interrupt mask register 42 */
    dword IMR43      :1;                                       /* Interrupt mask register 43 */
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
    dword            :1; 
  } Bits;
  struct {
    dword grpIMR_32 :12;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
    dword        :1;
  } MergedBits;
} INTC_IMRHSTR;
extern volatile INTC_IMRHSTR _INTC_IMRH @0xFFFFFFC8;
#define INTC_IMRH                       _INTC_IMRH.Dword
#define INTC_IMRH_IMR32                 _INTC_IMRH.Bits.IMR32
#define INTC_IMRH_IMR33                 _INTC_IMRH.Bits.IMR33
#define INTC_IMRH_IMR34                 _INTC_IMRH.Bits.IMR34
#define INTC_IMRH_IMR35                 _INTC_IMRH.Bits.IMR35
#define INTC_IMRH_IMR36                 _INTC_IMRH.Bits.IMR36
#define INTC_IMRH_IMR37                 _INTC_IMRH.Bits.IMR37
#define INTC_IMRH_IMR38                 _INTC_IMRH.Bits.IMR38
#define INTC_IMRH_IMR39                 _INTC_IMRH.Bits.IMR39
#define INTC_IMRH_IMR40                 _INTC_IMRH.Bits.IMR40
#define INTC_IMRH_IMR41                 _INTC_IMRH.Bits.IMR41
#define INTC_IMRH_IMR42                 _INTC_IMRH.Bits.IMR42
#define INTC_IMRH_IMR43                 _INTC_IMRH.Bits.IMR43
#define INTC_IMRH_IMR_32                _INTC_IMRH.MergedBits.grpIMR_32
#define INTC_IMRH_IMR                   INTC_IMRH_IMR_32

#define INTC_IMRH_IMR32_MASK            1
#define INTC_IMRH_IMR33_MASK            2
#define INTC_IMRH_IMR34_MASK            4
#define INTC_IMRH_IMR35_MASK            8
#define INTC_IMRH_IMR36_MASK            16
#define INTC_IMRH_IMR37_MASK            32
#define INTC_IMRH_IMR38_MASK            64
#define INTC_IMRH_IMR39_MASK            128
#define INTC_IMRH_IMR40_MASK            256
#define INTC_IMRH_IMR41_MASK            512
#define INTC_IMRH_IMR42_MASK            1024
#define INTC_IMRH_IMR43_MASK            2048
#define INTC_IMRH_IMR_32_MASK           4095
#define INTC_IMRH_IMR_32_BITNUM         0


/*** INTC_IMRL - Interrupt Mask Register Low; 0xFFFFFFCC ***/
typedef union {
  dword Dword;
  struct {
    dword IMR0       :1;                                       /* Interrupt mask register 0 */
    dword IMR1       :1;                                       /* Interrupt mask register 1 */
    dword IMR2       :1;                                       /* Interrupt mask register 2 */
    dword IMR3       :1;                                       /* Interrupt mask register 3 */
    dword IMR4       :1;                                       /* Interrupt mask register 4 */
    dword IMR5       :1;                                       /* Interrupt mask register 5 */
    dword IMR6       :1;                                       /* Interrupt mask register 6 */
    dword IMR7       :1;                                       /* Interrupt mask register 7 */
    dword IMR8       :1;                                       /* Interrupt mask register 8 */
    dword IMR9       :1;                                       /* Interrupt mask register 9 */
    dword IMR10      :1;                                       /* Interrupt mask register 10 */
    dword IMR11      :1;                                       /* Interrupt mask register 11 */
    dword IMR12      :1;                                       /* Interrupt mask register 12 */
    dword IMR13      :1;                                       /* Interrupt mask register 13 */
    dword IMR14      :1;                                       /* Interrupt mask register 14 */
    dword IMR15      :1;                                       /* Interrupt mask register 15 */
    dword IMR16      :1;                                       /* Interrupt mask register 16 */
    dword IMR17      :1;                                       /* Interrupt mask register 17 */
    dword IMR18      :1;                                       /* Interrupt mask register 18 */
    dword IMR19      :1;                                       /* Interrupt mask register 19 */
    dword IMR20      :1;                                       /* Interrupt mask register 20 */
    dword IMR21      :1;                                       /* Interrupt mask register 21 */
    dword IMR22      :1;                                       /* Interrupt mask register 22 */
    dword IMR23      :1;                                       /* Interrupt mask register 23 */
    dword IMR24      :1;                                       /* Interrupt mask register 24 */
    dword IMR25      :1;                                       /* Interrupt mask register 25 */
    dword IMR26      :1;                                       /* Interrupt mask register 26 */
    dword IMR27      :1;                                       /* Interrupt mask register 27 */
    dword IMR28      :1;                                       /* Interrupt mask register 28 */
    dword IMR29      :1;                                       /* Interrupt mask register 29 */
    dword IMR30      :1;                                       /* Interrupt mask register 30 */
    dword IMR31      :1;                                       /* Interrupt mask register 31 */
  } Bits;
} INTC_IMRLSTR;
