AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile INTC_IMRLSTR _INTC_IMRL @0xFFFFFFCC;
#define INTC_IMRL                       _INTC_IMRL.Dword
#define INTC_IMRL_IMR0                  _INTC_IMRL.Bits.IMR0
#define INTC_IMRL_IMR1                  _INTC_IMRL.Bits.IMR1
#define INTC_IMRL_IMR2                  _INTC_IMRL.Bits.IMR2
#define INTC_IMRL_IMR3                  _INTC_IMRL.Bits.IMR3
#define INTC_IMRL_IMR4                  _INTC_IMRL.Bits.IMR4
#define INTC_IMRL_IMR5                  _INTC_IMRL.Bits.IMR5
#define INTC_IMRL_IMR6                  _INTC_IMRL.Bits.IMR6
#define INTC_IMRL_IMR7                  _INTC_IMRL.Bits.IMR7
#define INTC_IMRL_IMR8                  _INTC_IMRL.Bits.IMR8
#define INTC_IMRL_IMR9                  _INTC_IMRL.Bits.IMR9
#define INTC_IMRL_IMR10                 _INTC_IMRL.Bits.IMR10
#define INTC_IMRL_IMR11                 _INTC_IMRL.Bits.IMR11
#define INTC_IMRL_IMR12                 _INTC_IMRL.Bits.IMR12
#define INTC_IMRL_IMR13                 _INTC_IMRL.Bits.IMR13
#define INTC_IMRL_IMR14                 _INTC_IMRL.Bits.IMR14
#define INTC_IMRL_IMR15                 _INTC_IMRL.Bits.IMR15
#define INTC_IMRL_IMR16                 _INTC_IMRL.Bits.IMR16
#define INTC_IMRL_IMR17                 _INTC_IMRL.Bits.IMR17
#define INTC_IMRL_IMR18                 _INTC_IMRL.Bits.IMR18
#define INTC_IMRL_IMR19                 _INTC_IMRL.Bits.IMR19
#define INTC_IMRL_IMR20                 _INTC_IMRL.Bits.IMR20
#define INTC_IMRL_IMR21                 _INTC_IMRL.Bits.IMR21
#define INTC_IMRL_IMR22                 _INTC_IMRL.Bits.IMR22
#define INTC_IMRL_IMR23                 _INTC_IMRL.Bits.IMR23
#define INTC_IMRL_IMR24                 _INTC_IMRL.Bits.IMR24
#define INTC_IMRL_IMR25                 _INTC_IMRL.Bits.IMR25
#define INTC_IMRL_IMR26                 _INTC_IMRL.Bits.IMR26
#define INTC_IMRL_IMR27                 _INTC_IMRL.Bits.IMR27
#define INTC_IMRL_IMR28                 _INTC_IMRL.Bits.IMR28
#define INTC_IMRL_IMR29                 _INTC_IMRL.Bits.IMR29
#define INTC_IMRL_IMR30                 _INTC_IMRL.Bits.IMR30
#define INTC_IMRL_IMR31                 _INTC_IMRL.Bits.IMR31

#define INTC_IMRL_IMR0_MASK             1
#define INTC_IMRL_IMR1_MASK             2
#define INTC_IMRL_IMR2_MASK             4
#define INTC_IMRL_IMR3_MASK             8
#define INTC_IMRL_IMR4_MASK             16
#define INTC_IMRL_IMR5_MASK             32
#define INTC_IMRL_IMR6_MASK             64
#define INTC_IMRL_IMR7_MASK             128
#define INTC_IMRL_IMR8_MASK             256
#define INTC_IMRL_IMR9_MASK             512
#define INTC_IMRL_IMR10_MASK            1024
#define INTC_IMRL_IMR11_MASK            2048
#define INTC_IMRL_IMR12_MASK            4096
#define INTC_IMRL_IMR13_MASK            8192
#define INTC_IMRL_IMR14_MASK            16384
#define INTC_IMRL_IMR15_MASK            32768
#define INTC_IMRL_IMR16_MASK            65536
#define INTC_IMRL_IMR17_MASK            131072
#define INTC_IMRL_IMR18_MASK            262144
#define INTC_IMRL_IMR19_MASK            524288
#define INTC_IMRL_IMR20_MASK            1048576
#define INTC_IMRL_IMR21_MASK            2097152
#define INTC_IMRL_IMR22_MASK            4194304
#define INTC_IMRL_IMR23_MASK            8388608
#define INTC_IMRL_IMR24_MASK            16777216
#define INTC_IMRL_IMR25_MASK            33554432
#define INTC_IMRL_IMR26_MASK            67108864
#define INTC_IMRL_IMR27_MASK            134217728
#define INTC_IMRL_IMR28_MASK            268435456
#define INTC_IMRL_IMR29_MASK            536870912
#define INTC_IMRL_IMR30_MASK            1073741824
#define INTC_IMRL_IMR31_MASK            2147483648


/*** INTC_FRC - INTC Force Interrupt Register; 0xFFFFFFD0 ***/
typedef union {
  byte Byte;
  struct {
    byte LVL7        :1;                                       /* Force Level 7 interrupt */
    byte LVL6        :1;                                       /* Force Level 6 interrupt */
    byte LVL5        :1;                                       /* Force Level 5 interrupt */
    byte LVL4        :1;                                       /* Force Level 4 interrupt */
    byte LVL3        :1;                                       /* Force Level 3 interrupt */
    byte LVL2        :1;                                       /* Force Level 2 interrupt */
    byte LVL1        :1;                                       /* Force Level 1 interrupt */
    byte             :1; 
  } Bits;
} INTC_FRCSTR;
extern volatile INTC_FRCSTR _INTC_FRC @0xFFFFFFD0;
#define INTC_FRC                        _INTC_FRC.Byte
#define INTC_FRC_LVL7                   _INTC_FRC.Bits.LVL7
#define INTC_FRC_LVL6                   _INTC_FRC.Bits.LVL6
#define INTC_FRC_LVL5                   _INTC_FRC.Bits.LVL5
#define INTC_FRC_LVL4                   _INTC_FRC.Bits.LVL4
#define INTC_FRC_LVL3                   _INTC_FRC.Bits.LVL3
#define INTC_FRC_LVL2                   _INTC_FRC.Bits.LVL2
#define INTC_FRC_LVL1                   _INTC_FRC.Bits.LVL1

#define INTC_FRC_LVL7_MASK              1
#define INTC_FRC_LVL6_MASK              2
#define INTC_FRC_LVL5_MASK              4
#define INTC_FRC_LVL4_MASK              8
#define INTC_FRC_LVL3_MASK              16
#define INTC_FRC_LVL2_MASK              32
#define INTC_FRC_LVL1_MASK              64


/*** INTC_PL6P7 - INTC Programmable Level 6, Priority 7 Register; 0xFFFFFFD8 ***/
typedef union {
  byte Byte;
  struct {
    byte REQN0       :1;                                       /* Request number, bit 0 */
    byte REQN1       :1;                                       /* Request number, bit 1 */
    byte REQN2       :1;                                       /* Request number, bit 2 */
    byte REQN3       :1;                                       /* Request number, bit 3 */
    byte REQN4       :1;                                       /* Request number, bit 4 */
    byte REQN5       :1;                                       /* Request number, bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpREQN :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} INTC_PL6P7STR;
