AndEmi81/indesit_inertia_rx210/HAL/FS_MCF51_AG128/fs_mcf51_ag128_reg.h
extern volatile INTC_PL6P7STR _INTC_PL6P7 @0xFFFFFFD8;
#define INTC_PL6P7                      _INTC_PL6P7.Byte
#define INTC_PL6P7_REQN0                _INTC_PL6P7.Bits.REQN0
#define INTC_PL6P7_REQN1                _INTC_PL6P7.Bits.REQN1
#define INTC_PL6P7_REQN2                _INTC_PL6P7.Bits.REQN2
#define INTC_PL6P7_REQN3                _INTC_PL6P7.Bits.REQN3
#define INTC_PL6P7_REQN4                _INTC_PL6P7.Bits.REQN4
#define INTC_PL6P7_REQN5                _INTC_PL6P7.Bits.REQN5
#define INTC_PL6P7_REQN                 _INTC_PL6P7.MergedBits.grpREQN

#define INTC_PL6P7_REQN0_MASK           1
#define INTC_PL6P7_REQN1_MASK           2
#define INTC_PL6P7_REQN2_MASK           4
#define INTC_PL6P7_REQN3_MASK           8
#define INTC_PL6P7_REQN4_MASK           16
#define INTC_PL6P7_REQN5_MASK           32
#define INTC_PL6P7_REQN_MASK            63
#define INTC_PL6P7_REQN_BITNUM          0


/*** INTC_PL6P6 - INTC Programmable Level 6, Priority 6 Register; 0xFFFFFFD9 ***/
typedef union {
  byte Byte;
  struct {
    byte REQN0       :1;                                       /* Request number, bit 0 */
    byte REQN1       :1;                                       /* Request number, bit 1 */
    byte REQN2       :1;                                       /* Request number, bit 2 */
    byte REQN3       :1;                                       /* Request number, bit 3 */
    byte REQN4       :1;                                       /* Request number, bit 4 */
    byte REQN5       :1;                                       /* Request number, bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpREQN :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} INTC_PL6P6STR;
extern volatile INTC_PL6P6STR _INTC_PL6P6 @0xFFFFFFD9;
#define INTC_PL6P6                      _INTC_PL6P6.Byte
#define INTC_PL6P6_REQN0                _INTC_PL6P6.Bits.REQN0
#define INTC_PL6P6_REQN1                _INTC_PL6P6.Bits.REQN1
#define INTC_PL6P6_REQN2                _INTC_PL6P6.Bits.REQN2
#define INTC_PL6P6_REQN3                _INTC_PL6P6.Bits.REQN3
#define INTC_PL6P6_REQN4                _INTC_PL6P6.Bits.REQN4
#define INTC_PL6P6_REQN5                _INTC_PL6P6.Bits.REQN5
#define INTC_PL6P6_REQN                 _INTC_PL6P6.MergedBits.grpREQN

#define INTC_PL6P6_REQN0_MASK           1
#define INTC_PL6P6_REQN1_MASK           2
#define INTC_PL6P6_REQN2_MASK           4
#define INTC_PL6P6_REQN3_MASK           8
#define INTC_PL6P6_REQN4_MASK           16
#define INTC_PL6P6_REQN5_MASK           32
#define INTC_PL6P6_REQN_MASK            63
#define INTC_PL6P6_REQN_BITNUM          0


/*** INTC_WCR - INTC Wake-up Control Register; 0xFFFFFFDB ***/
typedef union {
  byte Byte;
  struct {
    byte MASK0       :1;                                       /* Interrupt mask level, bit 0 */
    byte MASK1       :1;                                       /* Interrupt mask level, bit 1 */
    byte MASK2       :1;                                       /* Interrupt mask level, bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ENB         :1;                                       /* Enable */
  } Bits;
  struct {
    byte grpMASK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} INTC_WCRSTR;
extern volatile INTC_WCRSTR _INTC_WCR @0xFFFFFFDB;
#define INTC_WCR                        _INTC_WCR.Byte
#define INTC_WCR_MASK0                  _INTC_WCR.Bits.MASK0
#define INTC_WCR_MASK1                  _INTC_WCR.Bits.MASK1
#define INTC_WCR_MASK2                  _INTC_WCR.Bits.MASK2
#define INTC_WCR_ENB                    _INTC_WCR.Bits.ENB
#define INTC_WCR_MASK                   _INTC_WCR.MergedBits.grpMASK

#define INTC_WCR_MASK0_MASK             1
#define INTC_WCR_MASK1_MASK             2
#define INTC_WCR_MASK2_MASK             4
#define INTC_WCR_ENB_MASK               128
#define INTC_WCR_MASK_MASK              7
#define INTC_WCR_MASK_BITNUM            0


/*** INTC_SIMR - Set Interrupt Mask Register; 0xFFFFFFDC ***/
typedef union {
  byte Byte;
  struct {
    byte SIMR0       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 0 */
    byte SIMR1       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 1 */
    byte SIMR2       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 2 */
    byte SIMR3       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 3 */
    byte SIMR4       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 4 */
    byte SIMR5       :1;                                       /* Set the corresponding bit in the INTC_IMR{H,L} register, masking the interrupt request, bit 5 */
    byte SALL        :1;                                       /* Set all bits in the INTC_IMR{H,L} register, masking all interrupt requests */
    byte             :1; 
  } Bits;
  struct {
    byte grpSIMR :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} INTC_SIMRSTR;
extern volatile INTC_SIMRSTR _INTC_SIMR @0xFFFFFFDC;
#define INTC_SIMR                       _INTC_SIMR.Byte
#define INTC_SIMR_SIMR0                 _INTC_SIMR.Bits.SIMR0
#define INTC_SIMR_SIMR1                 _INTC_SIMR.Bits.SIMR1
#define INTC_SIMR_SIMR2                 _INTC_SIMR.Bits.SIMR2
#define INTC_SIMR_SIMR3                 _INTC_SIMR.Bits.SIMR3
#define INTC_SIMR_SIMR4                 _INTC_SIMR.Bits.SIMR4
#define INTC_SIMR_SIMR5                 _INTC_SIMR.Bits.SIMR5
#define INTC_SIMR_SALL                  _INTC_SIMR.Bits.SALL
#define INTC_SIMR_SIMR                  _INTC_SIMR.MergedBits.grpSIMR

#define INTC_SIMR_SIMR0_MASK            1
#define INTC_SIMR_SIMR1_MASK            2
#define INTC_SIMR_SIMR2_MASK            4
#define INTC_SIMR_SIMR3_MASK            8
#define INTC_SIMR_SIMR4_MASK            16
#define INTC_SIMR_SIMR5_MASK            32
#define INTC_SIMR_SALL_MASK             64
#define INTC_SIMR_SIMR_MASK             63
#define INTC_SIMR_SIMR_BITNUM           0


/*** INTC_CIMR - Clear Interrupt Mask Register; 0xFFFFFFDD ***/
typedef union {
  byte Byte;
  struct {
    byte CIMR0       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 0 */
    byte CIMR1       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 1 */
    byte CIMR2       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 2 */
    byte CIMR3       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 3 */
    byte CIMR4       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 4 */
    byte CIMR5       :1;                                       /* Clear the corresponding bit in the INTC_IMR{H,L} registers, enabling the interrupt request, bit 5 */
    byte CALL        :1;                                       /* Clear all bits in the INTC_IMR{H,L} register, enabling all interrupt requests */
    byte             :1; 
  } Bits;
  struct {
    byte grpCIMR :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} INTC_CIMRSTR;
